{"url": "https://www.google.com/search?q=civilization+in+New+York&ibp=htl%3Bjobs&sa=X&hl=en", "jobs": [{"title": "Senior Manager/ Product Marketing- 2K/Firaxis - Urgent Position", "company": "Firaxis Games", "location": "New York, NY, USA", "via": "via GrabJobs", "time": "3 days ago", "type": "Full-time", "salary": "none", "links": ["https://grabjobs.co/us/job/full-time/marketing-media/senior-manager-product-marketing-2kfiraxis-urgent-position-21957710?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "We are hiring an organized Senior Manager, Product Marketing- 2K/Firaxis to join our diverse team at Firaxis Games in Sparks Glencoe, MD.\nGrowing your career as a Full Time Senior Manager, Product Marketing- 2K/Firaxis is a fantastic opportunity to develop exceptional skills.\nIf you are strong in presentation, creativity and have the right drive for the job, then apply for the position of Senior... Manager, Product Marketing- 2K/Firaxis at Firaxis Games today!\n\nWho We Are:\n\nFounded in 2005, 2K Games is a global video game company, publishing titles developed by some of the most influential game development studios in the world. Our studios responsible for developing 2K's portfolio of world-class games across multiple platforms, include Visual Concepts, Firaxis, Hangar 13, CatDaddy, Cloud Chamber, and HB Studios. Our portfolio of titles is expanding due to our global strategic plan, building and acquiring exciting studios whose content continues to inspire all of us! 2K publishes titles in today's most popular gaming genres, including sports, shooters, action, role-playing, strategy, casual, and family entertainment.\n\nOur team of engineers, marketers, artists, writers, data scientists, producers, thinkers and doers, are the professional publishing stewards of our growing library of critically-acclaimed franchises such as NBA 2K, Battleborn, BioShock, Borderlands, The Darkness, Mafia, Sid Meier's Civilization, WWE 2K, and XCOM.\n\nAt 2K, we pride ourselves on creating an inclusive work environment, which means encouraging our teams to Come as You Are and do your best work! We are dedicated to diversity and inclusion, and want our community of candidates to reflect this commitment. We encourage all qualified applicants to explore our global positions. 2K is headquartered in Novato, California and is a wholly owned label of Take-Two Interactive Software, Inc. (NASDAQ: TTWO). What We Need:\n\n2K is looking for a Senior Product Marketing Manager , to be embedded within our Firaxis studio located in Sparks, Maryland . In this position you will work closely with both the Firaxis Development and 2K Global Marketing teams as we plan for the future of one of gaming's most beloved franchises. Reporting to the 2K Director of Global Marketing Strategy, the ideal candidate will have a wealth of knowledge about the Firaxis portfolio of titles, especially Civilization, with previous experience in one or more of the following areas: consumer insights and data analytics, game development, product management.\n\nEqual parts consumer advocate and liaison, you are a player advocate working collaboratively with both marketing and development teams to represent, ideate, and help drive marketing initiatives at the studio level in addition to working closely with development teams to ensure we have the right product features and plans to ensure Civilization's continued reign as the best strategy game on Earth.\n\nWhat You'll Do:\n\nIn this role, you will be passionate about two key success KPIs: improving game quality and driving player engagement. To accomplish these, you will have to wear several different hats: diplomat, strategist, data analyst, and marketing producer. Representing the voice of the consumer, you will work closely with the Development Studio, 2K PD and Global Publishing partners to build detailed profiles of our customers and their gaming needs.\n\nThis position will be based onsite 3 days/week at our Firaxis studio in Sparks, MD. Global Audience & Product Strategy:\n• Starting with insights- customer, product, competitor, cultural, macro etc., represent the voice of the consumer, identifying global audience needs and opportunities that will contribute to how we develop our current and future products and inform our strategic marketing planning with a long-term 5-, 3-, and 1- year global perspective.\n• Identify our Audience, by synthesizing game telemetry data, competitive research, consumer insights, community input, etc.) to create detailed profiles of our audience including their needs, motivations, and desired features.\n• Help define and prioritize specific product features needs by working closely with data analytics, consumer insights, and community teams across 2K and Firaxis, to synthesize various inputs into specific feature requests and design improvement suggestions that deliver on the needs of our customers.\n• Be able to put on your diplomat hat and work with the game team on how to get these features implemented.\n• Work closely with both the Game Development team and Consumer Insights to ensure that we have the correct feature sets and product vision for future products.\n• Immerse yourself deeply in the Strategy gaming genre and be a product master in terms of Civilization and our top competitors.\n• Provide product / competitive expertise for Development, Marketing, and Publishing teams.\nMarketing Strategy & Project Management:\n• Act as the embedded representative of the 2K Global Marketing team within the studio, being a champion of the marketing plan and strategic vision during day-to-day interactions with the game development team.\n• Work closely with the Global Marketing Strategy team to ensure they have everything they need - game information wise - to develop a world-class plan and be a sounding board for how we can execute ideas and in-game activations.\n• Present marketing plans and represent marketing during day-to-day Firaxis meetings, all-hands, etc.\n• Assist both the development and brand marketing teams with strategic planning and long-term campaign rollouts, and help facilitate various marketing requests of the development team and development requests of the marketing team.\n• Liaise closely with both Global Marketing Strategy and Development teams to ensure both are well informed and constantly up to date in terms of scheduling and planning, raising concerns as they come up.\n• Project tracking, maintaining & updating deliverable dates to ensure timely delivery of global marketing materials from the development team.\nLeadership, Collaboration and Communication:\n• Be an impactful influencer in a senior role with your direct team, also cross functionally to add value to the product and business strategy, and drive excellence in campaign execution.\n• Regularly partner, present and report to 2K and Firaxis stakeholders on marketing campaign progress, including findings, results and recommendations as needed.\n• Oversee and/or direct the tasks and progress of direct reports, weekly, if not daily, conducting meetings to touch base, observe, and provide guidance as necessary.\nWhat Will Make You a Great Fit:\n\nIf you're a collaborative, data-driven, community advocate who is a passionate strategy gamer/Civilization die-hard fan, you might be the right fit for 2K's team of award-winning brand marketers. You'll wake up each day thinking about our players and how we can consistently meet their needs and enjoy working across all the marketing disciplines and development teams to orchestrate execution excellence.\n• Bachelor's degree in marketing, analytics, gaming, or related field required.\n• Minimum of 5-7 years' experience in gaming working with or on a development team or marketing in a producer, data-analyst, marketing, or related field.\n• Proactive problem solver and strategist with the ability to think ahead, self-prioritize effectively and contribute cross-functionally.\n• Understanding of games-as-a-service, virtual goods, and emerging technologies and trends.\n• Impeccable project management skills and a high degree of comfort in leading multiple projects.\n• A strong foundational understanding of both consumer research and business analytics.\n• Excellent analytical, verbal, and written communication/presentation skills and a proven track record of working collaboratively across a number of internal, external, and international teams.\n• Results-oriented, self-motivated, extremely organized, and meticulous.\nAs an equal opportunity employer, we are committed to ensuring that qualified individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform their essential job functions, and to receive other benefits and privileges of employment. Please contact us if you need reasonable accommodation.\n\nPlease note that 2K Games and its studios never uses instant messaging apps or personal email accounts to contact prospective employees or conduct interviews and when emailing, only use 2K.com accounts.\n\nThe pay range for this position in Maryland at the start of employment is expected to be between $109,000.00 and $146,000.00 per Year. However, base pay offered is based on market location, and may vary further depending on individualized factors for job candidates, such as job-related knowledge, skills, experience, and other objective business considerations. Subject to those same considerations, the total compensation package for this position may also include other elements, including a bonus and/or equity awards, in addition to a full range of medical, financial, and/or other benefits. Details of participation in these benefit plans will be provided if an employee receives an offer of employment. If hired, employee will be in an 'at-will position' and the company reserves the right to modify base salary (as well as any other discretionary payment or compensation or benefit program) at any time, including for reasons related to individual performance, company or individual department/team performance, and market factors.\nBenefits of working as a Senior Manager, Product Marketing- 2K/Firaxis in Sparks Glencoe, MD:\n\n● Company offers great benefits\n● Opportunities to grow\n● Competitive salary\n\nOriginal job Senior Manager/ Product Marketing- 2K/Firaxis - Urgent Position posted on GrabJobs ©. To flag any issues with this job please use the Report Job button below", "occupation": "civilization"}, {"title": "Narrative Lead - Start Now", "company": "Firaxis Games", "location": "New York, NY, USA", "via": "via GrabJobs", "time": "13 days ago", "type": "Full-time", "salary": "none", "links": ["https://grabjobs.co/us/job/full-time/accounting-finance/narrative-lead-start-now-20312571?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "We are hiring a capable Narrative Lead to join our dynamic team at Firaxis Games in Sparks Glencoe, MD.\nGrowing your career as a Full Time Narrative Lead is an incredible opportunity to develop excellent skills.\nIf you are strong in presentation, people management and have the right initiative for the job, then apply for the position of Narrative Lead at Firaxis Games today...\n\nFiraxis Games is looking for a talented Narrative Lead for a sequel to an established AAA Title. This is an opportunity to join an established team behind some of the industry's most beloved franchises such as the XCOM and the Civilization series and work on a beloved worldwide IP. What is the role?\n\nWe are looking for someone to own and execute the Narrative of an upcoming title. You will work closely with the Creative Director to help create a story in a well-known IP universe. Working with a team you will drive the execution of a strong narrative vision.\n\nWe are looking for someone who:\n• Can effectively direct a team of writers, both internal and external across multiple locations.\n• Has shipped at least one AAA title in a credited Lead or Director role.\n• Is experienced in writing cinematics as well as in-game content (including branching dialogues).\n• Is experienced using in-game tools and can help drive their development.\n• Can represent the story of the game both internally as well as to external partners.\n• Has a sense of visual storytelling. Can work with the Cinematic Director as well as writers, designers, and animators to help block-out, build, and finalize scenes.\n\nRequired Skills:\n• Strong writing skills, particularly dialog.\n• Mastery of story structure and pacing across media.\n• Strong communication skills - able to collaborate with multiple disciplines effectively.\n\nNice to haves:\n• A Proficiency in Unreal and/or other game engines.\n• Voice or live action Directing experience\nPlease note that 2K Games and its studios never uses instant messaging apps or personal email accounts to contact prospective employees or conduct interviews and when emailing, only use Firaxis.com or 2K.com accounts.\n\n#LI-WA1\n\n#LI-Onsite\nBenefits of working as a Narrative Lead in Sparks Glencoe, MD:\n\n● Company offers great benefits\n● Company offers career progression opportunities\n● Competitive salary\n\nOriginal job Narrative Lead - Start Now posted on GrabJobs ©. To flag any issues with this job please use the Report Job button below", "occupation": "civilization"}]}