{"url": "https://www.google.com/search?q=business+analyze+in+new+york&ibp=htl%3Bjobs&sa=X&hl=en", "jobs": [{"title": "Senior Manager Business Analysis", "company": "Xoriant", "location": "New York, NY, USA", "via": "via LinkedIn", "time": "1 day ago", "type": "Contractor", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/senior-manager-business-analysis-at-xoriant-3766139556?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Senior Manager-Business Analysis\n\nLocation: Long Island City, NY,11101/ Bethpage, NY/ Piscataway, NJ (3 days per week onsite...\n\nContract to Hire\n\nJob Description: We are seeking a Sr. Mgr., Business Analysis to support our telecommunications client on-site in Long Island City, New York. The Sr. Mgr., Business Analysis engages with the business owners and key stakeholders in the operational, financial, and strategic analysis of new and existing business opportunities and enhancements. Additionally, he/she works in close partnership with the Product Owners to represent the needs of the various functional areas of a company. He/She is accountable for customer centric analyses to support strategies and business needs, overall quality of business and functional requirements, and delivery of the solution.\n\nResponsibilities\n• Supports the Business and Product Owners to define the business requirements at high-level using Jira Epics/Features from the customer lens with clear acceptance criteria and definition of “done”.\n• Partner closely with technology and cross-functional business teams to shape the product strategy, define and develop the vision, create a differentiated value proposition, and identify high-value growth scenarios that provide a catalyst for growth.\n• Partner closely with technology and cross-functional business teams to define the product development Capacity Management model. This includes tracking on bandwidth and capacity utilization through quarterly planning, prioritization, and impact/tradeoff analysis.\n• Support Business and Product Owners to build their Investment Justification (Business Case) for various product development projects and to track the post-launch benefit realized to measure the ROI attainment for every product development project.\n• Align with Business and Product Owners on the key performance indicators (KPI) for various business verticals and portfolios, and report on them through various information radiators (scorecards, dashboards, newsletters, … etc.)\n• Partner closely with technology and cross-functional business teams to estimate the Level Of Effort (LOE) for each product development project which supports the investment justification and capacity planning processes.\n• Provides guidance and coaching on tools to use to support the product development process and portfolio management (Clarity PPM, Jira, Power BI)\n\nSkills\n• 10+ years’ experience in the areas of Business Analysis, Portfolio Management, or Product Management preferably in telecommunications and technology domains\n• Expert in working in an Agile environment (Scrum, Kanban, SAFe, Tribes/Squads)\n• Experience with Customer Experience design methodologies such as Journey Mapping and A/B Testing along with CX metrics such as NPS and CSAT\n• Expert knowledge of business analysis tasks like analysis and documentation of business requirements and coordination of development efforts, maintaining knowledge of current tools, technology, and methodologies, executing data collection and interpretation, and providing analytical customer insights and advice\n• Experience in planning and prioritization of demand to support the organization.\n• Excellent communication skills\n• Analytical mindset and ability to synthesize complex information, connect ideas with data and present in digestible, easy to understand format", "occupation": "business analyze"}, {"title": "Business Analyst", "company": "Gen II Fund Services", "location": "New York, NY, USA", "via": "via LinkedIn", "time": "7 hours ago", "type": "Full-time", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/business-analyst-at-gen-ii-fund-services-3767020418?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.indeed.com/viewjob?jk=d40fbba74a3c2864&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.simplyhired.com/job/TO1Ke3yVRVthwa6BROg77JIbEHT1EQES-DRaq8pPqTCOMTljaNm3Pg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "As the business analyst, you will be the primary liaison between Gen II’s Treasury and Information Technology teams focusing on the development, implementation, and continuous improvement of GEN II’s treasury management system (TMS). Key areas to include automating wire-based payments, integrating data from multiple banks, implementing interfaces between the TMS and Gen II’s accounting systems... and rolling out new functionality to the end-user community.\n\nThe role of the business analyst also includes end-user technical support and training as well as the maintenance, improvement, and integration of fund accounting platforms with the TMS. You will act as a partner to business operations teams to collect and document their needs on various initiatives, and you will participate in the technical development lifecycle of new solutions.\n\nPrimary Responsibilities Will Include:\n\nBusiness analysis:\n• Leads the identification and documentation of business requirements for the integration between existing Gen II systems and the TMS.\n• Analyzes and challenges business requirements to implement new features in the existing TMS (Bank reconciliation, payments, bank statements…)\n• Works on the interface between the TMS and the banks to be integrated (Mapping, Data analysis, Testing…)\n• Identifies and helps to prioritize possible enhancements across existing systems.\n• Assesses the impact of proposed technical and operational changes on our core business (Private equity, Accounting, SWIFT Payments…)\n\nBusiness support:\n• Become the in-house subject-matter-expert (SME) on system functionality and process workflows.\n• Provide guidance and support to business teams with new-client onboarding activities.\n• Assist client service teams with day-to-day requests and inquiries.\n\nProject management:\n• Maintain detailed project plans and timelines covering all IT related project activities in partnership with Treasury management to ensure consistent messaging.\n• Take a leadership role in new projects supporting Treasury Management System, fund accounting platform, data migrations…\n• Manage a portfolio of active projects/tasks and be able to manage/communicate the daily progress.\n• Collaborate with the different project actors across the organization and at different levels.\n\nDevelopment:\n• Work closely with the IT development team to develop and maintain data interfaces between existing fund accounting platforms and the TMS.\n• Design any necessary new reports and features in accounting/reporting platforms.\n\nJob Requirements, Skills, Education and Experience:\n• Masters/ Bachelor’s degree in engineering, computer science, IT or project management.\n• 2+ years of experience.\n• Understanding SWIFT messages (MT101, MT103, MT940.)\n• Ability to manipulate large sets of data.\n• Strong understanding of cash management, investment management processes and related accounting rules.\n• Knowledge of a treasury management system.\n• Ability to work independently and effectively prioritize tasks in a fast-paced environment.\n• Ability to prioritize, think independently, and handle multiple tasks at a time.\n• Excellent analytical and problem-solving skills, with the ability to think creatively and outside the box.\n• Superior written and verbal communication skills, with the ability to present complex information in a clear and concise manner.\n• Strong attention to detail and project management skills, with the ability to lead cross-functional teams and drive projects to completion.\n• Fluent in English.\n\nNice to have:\n• Knowledge of Hazeltree Treasury Management platform is strongly preferred.\n• Knowledge of Allvue, Sage Intacct, eFront or any other Fund Accounting platform.\n• Knowledge of Private Equity/Real Estate or corporate finance.\n• Knowledge of at least one coding language (Javascript, VBA…).\n• Experience/Knowledge of programming in SQL.\n\nThe salary range for this position is $120,000-$150,000, in addition to a comprehensive benefits package. Please note that the actual salary offered within that range will depend on the candidate’s experience level.\n\nAbout the Company\n\nGen II Fund Services, LLC is one of the largest global independent private equity fund administrators, administering over $1 trillion of private capital on behalf of its clients with offices in New York, San Francisco, Boston, Stamford, Dallas, Denver, Vancouver, and Luxembourg. Gen II offers private fund sponsors a best-in-class combination of people, process, and technology, enabling fund sponsors to most effectively manage their operational infrastructure, financial reporting, and investor communications. The Gen II team is the most experienced and longest tenured team in the private equity fund administration industry, with broad expertise across buyout, funds of funds, real estate, energy, infrastructure, credit, co-investment, hybrid funds, feeder funds, venture capital, retail, and managed accounts.\n\nKey Facts:\n• Administering over $1T in assets\n• Servicing nearly every significant investor in the asset class\n• Institutional grade infrastructure and SSAE 18 (SOC-1, Type 2) certification, ensuring confidence in our processes and operating model\n• The most experienced and best performing team in the industry\n\nhttps://gen2fund.com/candidate-privacy-statement/\n\nEqual Opportunity Employer/Protected Veterans/Individuals with Disabilities\n\nThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c", "occupation": "business analyze"}, {"title": "Business Analyst", "company": "New York University", "location": "New York, NY, USA", "via": "via NYU Jobs", "time": "4 days ago", "type": "Full-time", "salary": "none", "links": ["https://uscareers-nyu.icims.com/jobs/12250/business-analyst/job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.higheredjobs.com/admin/details.cfm?JobCode=178456972&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.ziprecruiter.com/c/New-York-University/Job/Business-Analyst/-in-New-York,NY?jid=ae543db185fe9b18&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.salary.com/job/new-york-university/business-analyst/j202303101003127792596?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.indeed.com/viewjob?jk=66fec2ae26deb8c3&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.bebee.com/job/20231029-55ff0d8285080b533e0b85891bd1c0f9?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://myjobsny.usnlx.com/new-york-ny/business-analyst/833300087B1A4447BEE8171CA8D14F84/job/?vs=25&utm_source=RR+RSS+Feed-DE&utm_medium=Other&utm_campaign=RR+RSS+Feed&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://lensa.com/business-analyst-jobs/new-york/jd/90afcb90613ecdcba8e77165049ee1af?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Position Summary\nThe Business Analyst is responsible for providing functional support to Enrollment Management and units across the University for the University student information system (SIS) and other ancillary systems/applications. This position oversees the management of data integrity, provides training, and creates documentation. The Business Analyst maintains advanced knowledge of... University system functionality, analyzes business processes/procedures, and identifies dependencies and implications of change to various functional areas and integration points with other systems. The Business Analysts is expected to design, configure, develop, test, implement and maintain approved applications, including reports, interfaces, and data conversions. They must communicate and coordinate effectively and professionally with business owners to ensure accurate understanding and acceptance of system configurations.\nQualifications\n\nRequired Education:Bachelor’s Degree\nPreferred Education:Experience with batch process schedulers (BMC Control M, PeopleSoft, or similar). Relevant courses (systems analysis, database systems, Java, web programming)\nRequired Experience:At least 2 years related experience or equivalent combination, with student applications in an academic environment. Must include experience with systems applications and analysis, integrated systems and providing user support services. Strong functional and technical experience in the PeopleSoft Student Records Campus Solutions module.\nPreferred Experience:Experience with security administration for related systems and applications (e.g., PeopleSoft) and supporting mainframe systems.\nRequired Skills, Knowledge and Abilities:Ability to diagnose & troubleshoot system errors with exceptional attention to detail and accuracy. Strong team player as well as demonstrate the ability to complete projects independently. Proficient with MS office applications. Ability to effectively communicate technical information to non-technical audience. Able to complete tasks with aggressive timelines. Strong desire to serve students, faculty, and administrators in an university support setting. Excellent organizational, interpersonal, communication and client support skills. PeopleSoft Campus Solutions Query, SQL experience, BRIO, Tableau or similar reporting tool. Ability to interact with a diverse population and all levels of personnel, and to demonstrate tact and diplomacy when in dealing with difficult issues and/or diverse organizations. Ability to develop positive and cooperative relationships with students, faculty, staff, parents, professional colleagues, and the public.\nPreferred Skills, Knowledge and Abilities:Demonstrate understanding of programming logic (examples: SQL, XML, HTML, and/or JavaScript). Understands the working of a relational database (examples: PeopleSoft 9.x, ImageNow). Experience with Windows OS, Linux/Unix.\nAdditional Information\nIn compliance with NYC's Pay Transparency Act, the annual base salary range for this position is USD $73,800.00 to USD $90,200.00. New York University considers factors such as (but not limited to) scope and responsibilities of the position, candidate's work experience, education/training, key skills, internal peer equity, as well as, market and organizational considerations when extending an offer. This pay range represents base pay only and excludes any additional items such as incentives, bonuses, clinical compensation, or other items. NYU aims to be among the greenest urban campuses in the country and carbon neutral by 2040. Learn more at nyu.edu/nyugreen.EOE/AA/Minorities/Females/Vet/Disabled/Sexual Orientation/Gender Identity", "occupation": "business analyze"}, {"title": "Business Analyst", "company": "TALENT Software Services", "location": "New York, NY, USA", "via": "via LinkedIn", "time": "8 hours ago", "type": "Contractor", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/business-analyst-at-talent-software-services-3761492557?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Summary:\n• Strong documentation and analytical skills to interpret and translate business needs into business and functional requirements.\n• Business analysis, developing change and culture management, digital marketing, software development and technology business solutions...\n• Designs, creates & distributes weekly and monthly web analytics dashboards & reports, analyzes web traffic and site behavior business insights, multi-tasker with time management skills to manage a variety of tasks/projects with changing priorities.\n• Strong communication skills with various users at all levels Technical Team, Business Managers, Executives and end users, HL7, CCDA, SDA\n\nRequired Skills:\n• Expert in MS Office products with a concentration in Excel, Access, Visio, and Publisher, EMR and HER, MS SQL, HealthShare, Ensemble, Population Health Informatics initiatives, KPI's, Google Analytics and Google Adwords, Azure or other cloud technologies", "occupation": "business analyze"}, {"title": "Business Analyst [73015]", "company": "Onward Search", "location": "United States", "via": "via LinkedIn", "time": "1 day ago", "type": "Contractor", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/business-analyst-73015-at-onward-search-3760332910?refId=UTIdGN0cljlJyIn1fQLaLg%3D%3D&trackingId=9WmeVnmINqSqcrq8fO6Stg%3D%3D&position=30&pageNum=0&trk=public_jobs_jserp-result_search-card&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Onward Search needs a Business Analyst for a Tech company.\n\nThis is a 6+ month contract opportunity. Hybrid, 1-2 days weekly in NYC office...\n\nOnward Search is unable to support 1099 / Corp-to-Corp or Independent Contractor arrangements at this time. All contractors will be paid as W2 employees.\n\nTo learn more about this Business Analyst opportunity, apply now and chat with a recruiter today!\n\nAs a Business Analyst you’ll:\n\n• Collaborate with Team Leads to establish Team Key Results, providing agile teams with clear objectives for product and feature delivery.\n\n• Work closely with geographically dispersed Team Leads to elaborate on feature scopes and intricacies.\n\n• Analyze requirements comprehensively and transform them into functional and system design specifications.\n\n• Articulate intricate changes effectively, leading workshops and discussions to derive solutions aligned with Team Key Results.\n\n• Ensure the involvement of relevant Team Leads and Technical Leads in validating design decisions.\n\n• Condense requirements into user stories tailored for consumption within a sprint by Agile teams.\n\nQualifications:\n\n• Hold a Bachelor's degree in Business Administration, Computer Science, Information Systems, or Engineering\n\n• Accumulate 3 to 5 years of experience as an Agile Business Analyst\n\n• Demonstrate a proven track record of supporting complex change and multi-disciplinary projects, consistently achieving successful delivery.\n\n• Possess expertise in handling extensive datasets within Equity, Commodities, Forex, Futures, and Options asset classes.\n\n• Display proficiency in SDLC, Agile methodologies, and Cloud Computing Technologies.\n\n• Possess an understanding of feature modeling techniques and methods.\n\n• Familiarity with tools such as MS Azure Dev-Ops, Jira, Confluence, and MS SharePoint is advantageous.\n\nTo learn more about this Business Analyst opportunity, apply now and chat with a recruiter today!\n\nWhat’s in our benefits packages:\n• Medical, Dental, and Vision Insurance\n• Life Insurance\n• 401k Program\n• Commuter Benefit\n• eLearning\n• Education Reimbursement\n• Ongoing Training & Development\n• *To qualify for our benefits package, you must work over 30 hours per week and the length of assignment must be a minimum of 10 weeks.\n\nAt Onward Search, our job is to find you dream jobs.\n\nWe are creatives, marketers and digital wizards who use our talents to connect talented people with the nation’s leading brands. And our relationship won’t end with your start date.\n\nMore than recruiters, we are your advocates, advisors, and employers of record. We pay weekly, make sure your needs are met, and measure our success by yours. Join us.\n\nDE&I is not just our promise, it’s our passion.\n\nOnward Search is an equal opportunity employer dedicated to a policy of non-discrimination in employment regarding race, color, religion, gender, sexual orientation, national origin, age, disability, genetic information, veteran status, or any other classification protected by federal, state and local laws and ordinances.\n\nRefer-A-Friend\n\nHave talented friends or colleagues in your network looking for their next gig? Refer them to us and earn $250!\n\nRefer-A-Job\n\nKnow somebody hiring? Refer them to us and earn $500!\n\nUncover more creative, gaming, marketing and tech opportunities at Onwardsearch.com\n\nOnward Search is unable to support 1099 / Corp-to-Corp or Independent Contractor arrangements at this time. All contractors will be paid as W2 employees", "occupation": "business analyze"}, {"title": "Sr Technical Business Analyst - Onsite", "company": "Simple Solutions", "location": "New York, NY, USA", "via": "via ZipRecruiter", "time": "14 hours ago", "type": "Contractor", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Simple-Solutions/Job/Sr-Technical-Business-Analyst-Onsite/-in-New-York,NY?jid=8ba882a9a8e5c12c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job description :\n\nWe are trying to source Sr. Technical Business Analyst for our direct client for a long-term project onsite project at Brooklyn, NY. We need Senior Business Analyst who will assist in requirements management and corresponding program initiatives...\n\nIt will be a Long-Term Onsite Project at Brooklyn, NY.\n• *****We need only Local candidates only (NY or NJ Area)*****\n\nProject Goals for this contract include:\n• Implement the standard SDLC methodology of gathering requirements to determine business requirements.\n• Review business needs to provide developers requirements for modifications and enhancements\n• Manage the application that allows providers to create an invoice, budget, and enrollment\n• Updating new functions and processes based on business needs Client requires IT professional services to support day-to-day needs for critical business functions and objectives of the Client\\u2019s application.\n\nThe Senior Technical Business Analyst will be responsible for, but not limited to:\n• Analyzing administrative and operational processes and procedures to facilitate the implementation of new systems or modifications to existing systems\n• Identifying business needs, developing functional requirements documents, and evaluating potential business solutions\n• Conducting data analytics, mapping, and database analysis to define, document, prioritize, and validate business and system functional requirements\n• Creating business and system functional requirement documents, as well as complex COGNOS reports, studies and other business analysis artifacts.\n\nOUTLINE OF RESPONSIBILITIES\n• Evaluate information gathered from multiple sources, reconcile conflicts, decompose high-level information into details, abstract up from low-level information to a general understanding, and distinguish user requests from the underlying true needs.\n• Communicate and collaborate with external and internal customers to analyze information needs and functional requirements and deliver functional requirements, e.g., Business Requirements Documents. Use Cases, GUI, screen layouts and interface designs.\n• Utilize enterprise-wide requirements definitions and management systems and methodologies, as required.\n• Work independently with users to define concepts and report out on findings to an assigned Project Manager.\n• Drive and challenge business units on their assumptions of how they will successfully execute their plans\n• Interpret customer business needs and translate them into application and operational requirements.\n• Serve as the conduit between the customer community (internal and external customers) and the software development team through which requirements flow.\n• Develop requirements specifications according to standard templates, using natural language.\n• Collaborate with developers and subject matter experts to establish the technical vision and analyze tradeoffs between usability and performance needs.\n• Maintain a liaison between the business units, technology teams and support teams.\n• Lead requirements analysis and verification, ensuring that requirement statements are complete and verifiable, and that they conform to standards.\n\nMANDATORY MINIMUM QUALIFICATIONS\n\nThe successful candidate must have minimally achieved the following level of experience:\n• 8+ years of experience writing and maintaining functional testing for enterprise level systems\n• Minimum 8+ years of Experience working with planning, process analysis, and problem solving.\n• Minimum 8+ years of Experience working with Microsoft Office products such as MS Project, MS Access, Visio, PowerPoint, Excel and Word.\n• Minimum 8+ years of Experience in software engineering and information technology.\n• Minimum 5+ years of Experience in Microsoft SQL Server databases, SQL Reporting tools\n• Minimum 5+ years of Experience working with Microsoft TFS, TFS Release Manger and Cognos\n• Minimum 5+ years of Experience in TFS Test Manager, QA testing, Test Plan and Test Cases.\n• Minimum 8+ years of Experience in Software Development Life cycle \\u2013 Agile methodology.\n\nPREFERABLE QUALIFICATIONS\n• Minimum 6 years of Financial Data Analytics\n• Bachelor\\u2019s Degree in computer science from an accredited college, at minimum\n• Prior education industry/project experience\n• Excellent oral and written communication skills; ability to communicate in a credible and confident manner at all levels in the organization especially on technical issues to a non-technical audience.\n• Detailed and process oriented", "occupation": "business analyze"}, {"title": "Business Analyst 1566", "company": "Certec, Inc.", "location": "New York, NY, USA", "via": "via LinkedIn", "time": "2 days ago", "type": "Contractor", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/business-analyst-1566-at-certec-inc-3763902751?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.indeed.com/viewjob?jk=d9f8476e00e06e33&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.ziprecruiter.com/c/Certec-Consulting/Job/Business-Analyst-1566/-in-New-York,NY?jid=e199a4461ad13c97&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.theladders.com/job/business-analyst-aceworkforcetechnologies-brooklyn-ny_65743953?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.simplyhired.com/job/26vRhf_iKAcp0M0qMGdOnTSRmfb5_35mRLdxH7vrITsvHB29E_AJCg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "HYBRID ROLE FOR SR. BUSINESS ANALYST\n\nVisa: W2(USC/GC/H4/L2/GC-EAD/H1-B, Hire Friendly) ONLY NO C2C...\n\nRate 45 - 55 W2/1099\n\nSKILL MATRIX IS REQUIRED : https://docs.google.com/document/d/1gG9gl9FuQ25-72Sk_BVeReU8X-myXeL7/edit?usp=sharing&ouid=110300139976076811765&rtpof=true&sd=true\n\nDO NOT SUBMIT VIA LINKEDIN, INDEED OR DICE USE THE EASY APPLY BUTTON AT https://certecinc.com/certec-open-positions/\n\nONLY LOCALS TO NJ-NY-PA-CT\n\nBusiness Analyst Project Scope\n\nThe Business Analyst will be responsible for supporting business decisions; managing, analyzing, and creating design documents and workflow charts generally associated with existing applications, new applications, or program changes to existing applications, including Accela, CRM Microsoft Dynamics and various other Agency applications (BIS and unit specific inspection databases). The selected candidate will be required to perform, and in some cases, analyze tasks related to the transformation activities from mainframe applications to new system technology platforms.\n\nDuties Include, But Are Not Limited To\n\nModeling, developing, designing, implementing, enhancing, maintaining, documenting requirements, creating and maintaining technical/functional design documents for multiple software systems and legacy applications.\n\nBusiness Analyst Mandatory Skills\n• An experienced forward-thinking leader who can understand business processes and how technology solutions can increase efficiency and productivity.\n• Detail-oriented who knows how to extract and elicit all the right relevant information pertaining to current business processes.\n• Proven ability to develop and maintain functional and technical design documents that are handed to software developers.\n• Ability to write, communicate and execute different levels of test scenarios and test scripts to new and ongoing changes to support transformation activities.\n• Experience supporting the training development team on multiple levels of user training\n• Ability to participate in system demos to different stakeholders and ensures business and technology alignments are met based on key decision documents.\n• Proficiency in creating and implementing precise management plans, presentations and/or reports for every project, with attention to transparent communication at all levels.\n\nBusiness Analyst Preferred Experience And Qualifications\n• Bachelor's degree in Computer Science, Information Technology, or a related field\n• Experience in creating, documenting, evaluating, analyzing, and communicating systems requirements on a continuous basis\n• Experience with Accela, CRM Microsoft Dynamics, SQL\n• Experience maintaining systems process documents, including the delivery of ongoing status sessions\n\nAssumptions Regarding Consultant Tasks and Deliverables\n\nDescription\n\nThe Business Analyst shall provide Information Technology BA consultant services to DOB and will be responsible for supporting business decisions by managing, analyzing, and creating design documents. The following descriptions and deliverables shall apply:\n\nRole: The Business Analyst is tasked with supporting business decisions by managing, analyzing, and creating design documents, workflow charts/diagrams, test scripts/scenarios, and more. The role covers tasks associated with both existing applications and new applications (such as BIS, inspection databases), and programming changes to existing applications including Accela, CRM Microsoft Dynamics, and various other DOB applications and systems.\n\nThe selected candidate will be expected to proficiently complete tasks such as modeling, developing, designing, implementing, enhancing, maintaining, and identifying requirements for multiple software systems and legacy applications.\n\nObjective: The Business Analyst will be responsible for understanding business processes and exploring how technology solutions can enhance efficiency and productivity. The role involves extracting and eliciting relevant information pertaining to current business processes, documenting, evaluating, analyzing, and continuously communicating system requirements.\n\nThe analyst is expected to develop and maintain functional and technical design documents, write, communicate, and execute different levels of test scenarios and test scripts. Additionally, they will evaluate and thoroughly explain system development to DOB software developers, support the training development team by creating and reviewing training materials, participate in system demos, and create and implement precise management plans.\n\nDeliverables: The Business Analyst is responsible for the following:\n• Business Requirements Document (BRD) outlining the identified needs, objectives, and expectations\n• Business Process Maps illustrating the current and future state of the operations\n• Regular progress reports and updates on activities\n• Designing “as is” and “to be” processes, refining business cases, creating necessary project documentation\n• Write, communicate, and execute different levels of test scenarios and test scripts\n• Develop and maintain functional and technical design documents\n• Create, document, evaluate, analyze, and communicate systems requirements on a continuous basis\n• Participate in system demos to different stakeholders and ensure business and technology aligns\n• Create and implement precise management plans, presentations, and/or reports for every project\n\nThanks,\n\nJay Kernes\n\nCertec Consulting, inc\n\n847-253-8968, Fax 888-523-7832\n\nWe are certified as a Women's Business Enterprise (WBE", "occupation": "business analyze"}, {"title": "Business Analyst - Finance Domain", "company": "Trianz", "location": "New York, NY, USA", "via": "via Jobvite", "time": "28 days ago", "type": "Contractor", "salary": "none", "links": ["http://jobs.jobvite.com/trianz/job/otz2ofwc?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.ziprecruiter.com/c/Trianz/Job/Business-Analyst-Finance-Domain/-in-New-York,NY?jid=f8fa169f5ebfea39&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.careerbuilder.com/job/J3W5WH67ZF2JNCZF6GH?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.institutedata.com/job/2225933/business-analyst/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.trabajo.org/job-835-20231103-c2031809bf1413d90623c57676f6dc48?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.bebee.com/job/20231110-bb2703a7f37c71202c7e2591b52c5372?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jooble.org/jdp/-3518002903271929298/Business-Analyst-+-Finance-Domain-New-York%2C-NY?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.jobrapido.com/jobpreview/3056147596?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "About Trianz\n\nTrianz is a digital transformation technology and services firm that helps clients transform their value proposition and business value chains. We deliver end-to-end digital transformation services from strategy and roadmaps to experience design, technology implementations, and managed services. With a multi-disciplinary, collaborative model, we help clients understand their... competitive digital maturity, develop effective strategies, and transform using our IP-led platforms and technology services. We lead with data and IP that accelerates digital transformations, optimizes investments, and delivers measurable results. We have been rated #1 for 'transformational impact' and 'predictability of execution' by a Fortune 1000 client base- 5 years straight.\n\nAt Trianz, we offer you an open and learning-oriented culture essential to emerge as a leader. Completely focused on the Digital Evolution philosophy and phenomenon, we view delivering our value proposition consistently as a non-negotiable commitment. Our enablers include Intelligent Team Formations, a Client-Centric Approach, Predictability in Execution, and establishing a Unique Relationship Experience. A culture of innovation, encouraging our people to create, and belief in the importance of training and development set us apart.\n\nRole: Business Analyst\nEmployment Type: Contract – 6-9 Months subject to extension\nLocation: 3 days a week working from Manhattan , NY and 2 days remote as of now.\n\nTrianz is looking for a Business Analyst to support our applications in the FinTech ecosystem (Wealth Management / Asset Management).\n\nWe are seeking an experienced Business Analyst to support our applications in the FinTech ecosystem (Wealth Management / Asset Management). This role will require skills in business analysis, systems analysis, documentation of business/functional requirements, customer relationships, solution recommendation, and decision making. Understanding mutual funds, life insurance and/or annuity products would be a plus.\n\nAbout the Role\n• This role requires skills in business analysis, systems analysis, documentation of business/functional requirements, customer relationships, solution recommendation, and decision making.\n• Understanding mutual funds, life insurance and/or annuity products would be a plus.\n\nJob Responsibilities\n• Interact with business, conduct analysis, and document business processes and requirements.\n• Serve as a liaison between the business and technology teams.\n• Ability to work with our technical partners to achieve an efficient and effective solution.\n• Verify that the implemented solution meets the requirements.\n• Analyze and interpret business requirements into functional requirements and specifications that have an appropriate level of detail suitable for use by the technology teams.\n• Solicit business requirements using walk-through, document analysis, storyboards, use case scenarios, business analysis, task and workflow analysis.\n• Write clear and concise requirements ensuring that requirement statements are complete, consistent, concise, comprehensible, feasible, unambiguous, traceable, and verifiable.\n• Support business and technology teams to ensure key deliverables are met in an accurate timely manner.\n• Assist in the troubleshooting of problems and issues; make recommendations and provide alternative solutions when it applies.\n• Determine operational objectives by studying business functions; gathering information; evaluating output requirements and formats.\n• Work closely with Agile and Waterfall teams across all phases of a project.\n\nRequired Skills\n• 12 plus years of Experience as Business Analyst.\n• Working experience in data analysis.\n• Working knowledge of Agile tools like JIRA and Rally (Agile Central).\n• Strong written, verbal and communication skills with the demonstrative ability to work with all levels within the organization\n• Strong analytical, decision-making, and problem-solving skills\n• Strong attention to accuracy and detail\n• Uses best practices and knowledge of internal or external business issues to improve services\n• Interprets business challenges, identifies trends and recommends best practices\n• Explains difficult or sensitive information; collaborates with others to build consensus\n• Makes decisions that have cross-functional impact\n• Must be team oriented in interacting with a diverse group\n• A proactive self-starter with the ability to work independently with limited supervision\n• Ability to work in a fast-paced environment and manage multiple simultaneous priorities\n\nTrianz is growing at a faster pace than the industry for the last five years. Read through some of the key industry recognitions we have received for our innovative execution and strategic client initiatives here.\n\nEqual Employment Opportunity\n\nTrianz is an Equal Opportunity Employer and does not discriminate on the basis of race, color, creed, national or ethnic origin, gender, religion, disability, age, political affiliation or belief, disabled veteran, veteran of the Vietnam Era, or citizenship status (except in those special circumstances permitted or mandated by law", "occupation": "business analyze"}, {"title": "Business Analyst", "company": "Tangle Systems LLC", "location": "New York, NY, USA", "via": "via OPTnation", "type": "Full-time and Contractor", "time": "none", "salary": "none", "links": ["https://www.optnation.com/business-analyst-job-in-new-york-ny-view-jobid-25041?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Description How you will make an impact\n\n- Test and implement new corrections and improvements working with development and QA teams...\n\n- Assess and review business technical and functional requirements\n\n- Craft comprehensive user stories and profiles\n\n- Assist with creating documentation for software solutions using a customer-focused approach\n\n- Create innovative and highly usable solutions for new product specifications\n\n- Partner with development team to invent and assess product requirements to meet business goals\n\n- Work with designers on wireframes interactions and user flows\n\nRequirements\n\n- Experience crafting documenting and testing APIs\n\n- Awareness of usability and application performance considerations\n\n- Strong familiarity with Data Management\n\n- Solid understanding of business requirement documentation\n\n- Command of Business Intelligence (BI)\n\n- Experience developing requirements and product specifications for new or existing applications\n\nTHANKS\n\nREGARDS\n\nTANGLE SYSTEMS", "occupation": "business analyze"}, {"title": "Business Analyst", "company": "Talon Professional Services", "location": "United States", "via": "via LinkedIn", "time": "2 days ago", "type": "Contractor", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/business-analyst-at-talon-professional-services-3765301899?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Title: Business Analyst\n\nTerms: 6 Months Contract to Hire...\n\nHybrid - Lawrenceville, NJ\n\nJob Summary: The Business Analyst will collaborate with various departments and stakeholders to gather, document, and analyze business requirements, processes, and workflows. They will translate these requirements into functional specifications for technology teams and work closely with project managers, developers, and testers to ensure successful project delivery. The Business Analyst will also be involved in identifying areas for process improvement and recommending solutions to enhance operational efficiency and effectiveness.\n\nRequirement Elicitation and Analysis\n• Work closely with business stakeholders to understand their needs, objectives, and challenges.\n• Elicit, document, and analyze business requirements, processes, and workflows.\n• Translate business requirements into clear and concise functional specifications for technical teams.\n\nStakeholder Communication\n• Serve as a liaison between business stakeholders and technology teams.\n• Communicate complex technical concepts to non-technical stakeholders.\n• Present findings, recommendations, and project updates to various audiences.\n\nDocumentation\n• Create detailed documentation including business requirements, process flows, use cases, and user stories.\n• Maintain accurate and up-to-date project documentation throughout the project lifecycle.\n\nQuality Assurance\n• Participate in system testing, user acceptance testing, and manual testing.\n• Ensure that delivered solutions meet the specified requirements and are of high quality.\n\nProcess Improvement\n• Identify areas for process optimization and efficiency enhancement.\n• Recommend process improvements and assist in their implementation.\n\nQualifications:\n• Bachelor's degree in Information Technology, or a related field (Master's degree is a plus).\n• Proven experience as a Business Analyst or in a related role.\n• Strong analytical, problem-solving, and critical-thinking skills.\n• Strong manual testing skills.\n• Proficiency in requirement gathering techniques, process modeling, and documentation.\n• Familiarity with project management methodologies and software development lifecycle.\n• Ability to collaborate effectively with cross-functional teams", "occupation": "business analyze"}, {"title": "Web Portal Business Analyst", "company": "Open Systems Technologies", "location": "New York, NY, USA", "via": "via SmartRecruiters Job Search", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://jobs.smartrecruiters.com/OpenSystemsTechnologies/79484225-web-portal-business-analyst?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company Description\n\nGlobal Investment Bank...\n\nJob Description\n\nThis role is responsible for the Business Analysis for portal-related projects and the firm’s Intranet portals. This role may also cover various portal services such as search, mobile, and content management projects.\n\nThis role will provide business analysis skills throughout the project life-cycle, i.e. analysis, design, development, testing, implementation and hand-over. The work includes requirements gathering, functional specification definition, data analysis, test use case planning and preparation, project planning, tracking and delivery. The role requires close interaction with business users; senior stakeholders, other development teams, support teams, infrastructure teams and project teams to ensure projects & services are delivered on schedule with high quality. The role will suit an experienced business analyst with a solid enterprise technical background and interest and/or experience in project management.\n\nMain Duties\n\nThis role will have the following major duties and responsibilities:\n• Work as a team player in a global development group participating in business requirements/functional specification definition, data analysis and design liaising with both Business and IT teams.\n• Support and coordinate system implementations through the project lifecycle (initiation, planning, analysis/design, development, implementation, testing, rollout, and hand-over) working with other teams on a local and global basis.\n• Elicit requirements using interviews, document analysis, requirements workshops, surveys, site visits, business process descriptions, use cases, scenarios, business analysis, and task and workflow analysis.\n• Critically evaluate information gathered from multiple sources, reconcile conflicts, decompose high-level information into details, abstract up from low-level information to a general understanding, and distinguish user requests from the underlying true needs.\n• Drive and challenge business units on their assumptions of how they will successfully execute their plans.\n• Strong analytic and product-management skills required, including a thorough understanding of how to interpret customer business needs and translate them into application and operational requirements.\n• Collaborate with developers and subject matter experts to establish technical vision and analyze tradeoffs between usability and performance needs.\n• Strong analytical skills, self-motivated and capable of working in a dynamic global environment that demands multi-tasking.\n• Ability to generate ideas and efficiently mock up proposals and orchestrate demos\n\nBasic Qualifications:\n• B.S. degree in computer science or related field with emphasis on technology\n• 5+ years of technical or development experience\n• 3+ years experience writing Business Requirement Documents and Functional Specification Documents\n\nPreferred Qualifications:\n• Working experience in financial industry, especially portal and enterprise technologies is a plus\n• Experience with Java/J2EE based application development projects\n• Proven delivery track record of managing business analysis within fast-paced corporate environment and agile methodologies\n• Project Management & Tracking skills a must, PM certification a plus.\n• Candidate should be able to diagnose problems quickly and independently\n• Sharp, quick, aggressive ability to deal with business and system problems\n• Strong communication skills (both verbal and written) with the ability to influence senior management level project sponsors and stakeholders\n• Capable of facilitating meetings\n• Strong skills in Microsoft Excel, Power Point, Word, Project, Visio and SQL or related software applications\n• Willingness to learn new technologies & applications a must!\n• Exceptional attention to detail\n• End-to-end lifecycle experience of systems development & implementation project\n• Can do attitude with willingness to accept challenges and develop innovative approaches\n• Ability to work with offshore delivery teams\n• Process-mapping experience\n• Development background in an object-oriented language\n• Experience using a structured modeling language, preferably UML and/or BPMN\n• Experience modeling data, processes, events, use cases, and objects\n• Experience facilitating client workshops/discussions\n• Ability to create & review technical documentation, specifications, and architecture\n• User Interface (UI) and User Experience (UX) design understanding\n• Experience with Enterprise Architect or other modeling tools\n• Ability to identify and escalate risks and issues as appropriate and identify potential solutions\n• Experience with web & database technologies: HTML, JavaScript, CSS, XML/XSD, Oracle, SQL", "occupation": "business analyze"}, {"title": "Remote Business Analysis Senior Analyst", "company": "Anthem, Inc", "location": "New York, NY, USA", "via": "via BeBee", "time": "7 days ago", "type": "Full-time", "salary": "none", "links": ["https://us.bebee.com/job/20231110-0a09244474e8a7a7fed34ed56753f0c4?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Business Information Analyst Senior - CarelonRx\nThis position is part of Elevance Health hybrid work model (remote and office\n...\nThe Business Information Analyst Senior - CarelonRx is responsible for analyzing, reporting and developing recommendations on data related to complex and varied business metrics.\nTypically provides technical assistance to lower-level staff.\nCreates and maintains databases to track business performance.\nAnalyzes data and summarizes performance using summary statistical procedures.\nDevelops and analyzes business performance reports (e.g. for claims data, provider data, utilization data) and provides notations of performance deviations and anomalies.\n\nMay require taking business issue and devising best way to develop appropriate diagnostic and/or tracking data that will translate business requirements into usable decision support tools.\nMay make recommendations based upon data analysis.\n\nRequires a BS/BA degree in related field and a minimum of 3 years data analysis or related experience; Minimum 3 years' experience with relational databases and knowledge of query tools and statistical software.\nMinimum 1 year experience with Tableau preferred.\nAbility to manipulate large sets of data is strongly preferred.\nKnowledge of SLQ and BI Tools\n\nFor candidates working in person or remotely in the below locations, the salary* range for this specific position is $109,080.In addition to your salary, Elevance Health offers benefits such as, a comprehensive benefits package, incentive and recognition programs, equity stock purchase and 401k contribution (all benefits are subject to eligibility requirements).\n\nThe company is fully committed to ensuring equal pay opportunities for equal work regardless of gender, race, or any other category protected by federal, state, and local pay equity laws .\n~ The salary range is the range Elevance Health in good faith believes is the range of possible compensation for this role at the time of this posting. This range may be modified in the future and actual compensation may vary from posting based on geographic location, work experience, education and/or skill level. Even within the range, the actual compensation will vary depending on the above factors as well as market/business considerations. No amount is considered to be wages or compensation until such amount is earned, vested, and determinable under the terms and conditions of the applicable policies and plans. Elevance Health is a health company dedicated to improving lives and communities – and making healthcare simpler. A Fortune 20 company with a longstanding history in the healthcare industry, we are looking for leaders at all levels of the organization who are passionate about making an impact on our members and the communities we serve. Do you want to be part of a larger purpose and an evolving, high-performance culture that empowers you to make an impact?\n\nWe offer a range of market-competitive total rewards that include merit increases, paid holidays, Paid Time Off, and incentive bonus programs (unless covered by a collective bargaining agreement), medical, dental, vision, short and long term disability benefits, 401(k) +match, stock purchase plan, life insurance, wellness programs and financial education resources, to name a few.\n\nUnless in a designated virtual-eligible role and specified as primarily virtual by the hiring manager, associates are required to work at an Elevance Health location at least once per week, and potentially several times per week.\nThe health of our associates and communities is a top priority for Elevance Health. We require all new candidates in certain patient/member-facing roles to become vaccinated against COVID-19.\n\nIf you are not vaccinated, your offer will be rescinded unless you provide – and Elevance Health approves – a valid religious or medical explanation as to why you are not able to get vaccinated that Elevance Health is able to reasonably accommodate.\nElevance Health will also follow all relevant federal, state and local laws.\n\nElevance Health has been named as a Fortune Great Place To Work in 2022, has been ranked for five years running as one of the 2023 World's Most Admired Companies by Fortune magazine, and is a growing Top 20 Fortune 500 Company.\n\nElevance Health is an Equal Employment Opportunity employer and all qualified applicants will receive consideration for employment without regard to age, citizenship status, color, creed, disability, ethnicity, genetic information, gender (including gender identity and gender expression), marital status, national origin, race, religion, sex, sexual orientation, veteran status or any other status or condition protected by applicable federal, state, or local laws.\nApplicants who require accommodation to participate in the job application process may contact ability@icareerhelp", "occupation": "business analyze"}, {"title": "Data Business Analyst", "company": "Open Systems Technologies", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Open-Systems-Technologies/Job/Data-Business-Analyst/-in-New-York,NY?jid=60d59d844087fd01&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company Description\n\nJob Description...\n\nThe role will be responsible for delivery of product releases and working with the Product Controllers, Financial Accounting, and IT. The position will report to the project manager.\n\nThe Candidate will have interaction with the business and with other teams throughout the organization. The candidate should therefore be a skilled communicator, have good understanding of project life cycle and be independent to run the testing and analysis of data.\n\nSome of the key deliverables and responsibilities for the candidate:\n\n- Help support and perform business analysis and testing\n\n- Support identification of business requirements from line controllers, both in the Product Control and Financial Control space.\n\n- Creating project plans, status reports and manage issues and risks.\n\n- Apply project management methodologies including project plans, risk mitigation, issue tracking and communication plans.\n\n- Establish effective working relationships and build partnerships with product controllers.\n\n- Participate in testing and analysis for the various phases of project\n\n- Write test cases and test scenarios for end users as they relate to the functionality that is being built or implemented\n\n- Execution of test cases during both system integration testing and user acceptance testing\n\n- Document and assist in training of end users with new functionality\n\n- Prepare documentation around controls and processes for Product Control to utilize post go-live\n\n- Document and track all issues, enhancements, deficiencies, etc within the firms structured tracking system\n\nSoft skills\n\nTraining / experience\n\nHighly motivated with excellent communication and interpersonal skills\n\nStrong problem solving skills\n\nVery detailed oriented and focused\n\nAdaptive - must be able to work/lead differing personalities to get a quality end product\n\nConfident - must be able to execute in QA role in a partnering, yet firm way\n\nProactive - continuously looking for process improvement/enhancements\n\nExperience and Skills Required:\n\nStrong ability to multi-task and be extremely detail oriented in a fast pace environment\n\nStrong ability to quickly understand content in order to carry on conversations with Business users\n\nPower user in the following Microsoft applications: MS Project, Excel, PowerPoint and knowledge of SQL queries\n\nStrong interpersonal & leadership skills\n\nStrong communications skills at all levels\n\nSubstantial ability working at a global company\n\n5+ years business analysis with a leading firm within financial services or an international investment bank\n\nTrack record in delivering major projects especially projects delivered in an investment bank or similar institution\n\nStrong knowledge of investment Banking business processes - front to back involvement in managing change\n\nKnowledge of investment banking product control and/or Operation processes\n\nExperience in achieving results in a project context using resources that do not report directly to you\n\nKnowledge of technical processes - must have interfaced with technology groups and IT implementations\n\nKnowledge of Project life cycle and associated methodologies and quality assurance techniques\n\nNumerate, able to work with spread sheets and perform financial analysis desired\n\nEducation\n\nBasic education: Bachelor degree\n\nFurther education / Degrees: Desired - Bachelor or above degree / PMP / Prince 2\n\nLanguage skills: n/a\n\nSpecial IT-Know-how: Expert in MS Office, particularly in MS Excel and MS Project\n\nOthers:\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "occupation": "business analyze"}, {"title": "Business Analyst", "company": "VisionPRO", "location": "New York, NY, USA", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.com/job/A5xppT3S0DaParH3emoPzZxuF2ypKuU7AstgOwD4N-mpq0YiGmJV6Q?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Description:\n• Support business development applications and strategies within Investment Banking\n...\nJob Description:\n• Looking for a business analyst with experience in Investment Banking; particularly, in business development domain\n• This role will require working directly with the Investment Banking group, to support the forming of a strategy that will improve the intelligence on current business activity and relationships, as well as combining various internal and external data sources to gain insight on future business activity\n• Incorporating CRM platforms and principles is a critical aspect of the strategy\n• Management of internal information sources, deemed as highly sensitive and confidential, requires responsibilities to extend to working with various IT teams such as Application Development, Storage, Information Security, and Desktop Engineering\n• Internal data sources may reside in applications developed by internal teams, Excel / PowerPoint documents embedded with VBA macros, linked to third-party market data sources, and the variety of documents supporting deal transactions\n• The individual will work with the business group, to identify the appropriate integrations between the various data sources, ensuring that information security is held intact\n\nRequirements:\n• Experience with CRM principles and platforms is required\n• Experience with Excel/VBA, a must\n• Experience with third-party market data sources, such as FactSet and Thomson Reuters\n• Experience with MIS and Business Intelligence modeling, as it pertains to linking internal deal models with third-party and public information services\n\nVisionPRO relentlessly delivers top talent to help our clients excel. We have been trusted for 20 years to align the right talent to the right opportunity, expertly solving unique business challenges. From small businesses to the Fortune 500, our clients appreciate our consultative approach, resourcefulness, and fast response to their individual needs.\n\nOur prospective candidates and existing consultants can count on VisionPRO to passionately help them maximize their career choices, while also supporting their growth opportunities. We serve our customers from around the world, helping them with their most critical hiring decisions and project needs.\n\nJob Types: Full-time, Contract\n\nExperience:\n• business analysis: 5 years (Required)\n\nLocation:\n• New York, NY (Required)\n\nWork authorization:\n• United States (Required", "occupation": "business analyze"}, {"title": "Business Intelligence Data Analyst", "company": "Loris.ai", "location": "New York, NY, USA", "via": "via Wellfound", "time": "4 days ago", "type": "Full-time", "salary": "none", "links": ["https://wellfound.com/jobs/1427739-business-intelligence-data-analyst?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ny.tarta.ai/j/EHTwsIoBcRajQcTjVJzr0923-business-intelligence-data-analyst-in-new-york-new-york-at-loris-ai?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "We’re looking for a Business Intelligence Data Analyst with strong communication skills to join our team at Loris.ai. This person will be critical to providing the Product and Business Development teams with data-based insights to inform strategic decisions.\n\nOur ideal candidate is highly inquisitive with a passion for uncovering business insights in large amounts of data. This is a... cross-functional Product role that will operate cross-functionally with Data Science, Engineering, CX, Sales, and external stakeholders.\n\nChallenges you’ll tackle:\n• Track, analyze, and visualize key metrics that highlight the health of our product and opportunities for improvement\n• Conduct insightful analysis using a multitude of data (e.g. user, revenue, product, market, industry) to drive business growth\n• Go beyond creating reporting dashboards -- identify, analyze, and interpret trends and patterns in complex data sets, then summarize key findings and propose action plans.\n• Support the CX team through customer Pilots and quarterly business reviews by analyzing client data and producing actionable, meaningful insights\n• Own database documentation and be a key influencer in how our data is managed\n• Explore large amounts of client data to uncover business insights\n• Regularly conduct statistical analysis on new and existing customer datasets to\n• Provide quality assurance of imported data\n\nQualities you embody:\n• Comfortable presenting to business stakeholders and able to explain complex, technical concepts to non-technical audiences\n• Self-starter who takes initiative\n• Can think strategically and operate tactically\n• Keen business sense with the uncanny ability to tell a story through data that is both statistically sound and resonates with executive stakeholders\n• Ability to thrive in a cross-functional environment driving alignment across stakeholders\n• Forward-thinking, well organized, and have an obsession for detail\n\nSkills you have:\n• BS or above in Math, Statistics, Economics, or a related field\n• 1-3 years of work experience in a quantitative or analytical role within a consulting or business organization\n• Expert in SQL, experience with Python also a plus\n• Proficiency in product analytics tools (Amplitude, Looker, Periscope, etc.)\n• Ability to work independently with minimal supervision\n• Excellent multitasking skills to manage multiple projects simultaneously and work with various cross functional stakeholders\n• Hands on experience with other BI tooling preferable\n• Successful outcomes producing slide decks and executive summaries to distill highly technical information into digestible insights\n\nCompany Overview:\n\nLoris is an AI company building NLP-based conversational intelligence software for CX teams to understand their customer needs in real time.\n\nLoris now works with fast-growing D2C and B2C brands across multiple industries including marketplace, fintech and delivery, and our novel dataset consists of millions of anonymized textual interactions between businesses and their customers.\n\nThe idea of Loris was born from Crisis Text Line, a nonprofit organization that provides free, text-based counseling. Everyone on our team believes language matters, and we are an empathy-first organization. We look forward to growing our team with like-minded, multidisciplinary individuals from diverse backgrounds. We're based in NYC and Tel Aviv and backed by top investors, including Vertex, Floodgate, and Jeff Weiner.\n\nLoris.ai focuses on Machine Learning, Artificial Intelligence, Natural Language Processing, and Customer Service. Their company has offices in New York City and Tel Aviv-Yafo. They have a small team that's between 11-50 employees. To date, Loris.ai has raised $2M of funding; their latest round was closed on February 2018.\n\nYou can view their website at http://loris.ai or find them on Twitter and LinkedIn", "occupation": "business analyze"}, {"title": "Business Analyst", "company": "Tech Smart Solutions LLC", "location": "New York, NY, USA", "via": "via OPTnation", "type": "Full-time and Part-time", "time": "none", "salary": "none", "links": ["https://www.optnation.com/business-analyst-job-in-new-york-view-jobid-34108?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.salary.com/job/eteam-inc/business-analyst/j202208180017426586855?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.careerbuilder.com/job/J3N7KW6V9C3Q100RJD6?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Title Business Analyst\n\nJob description...\n• Creating a detailed business analysis outlining problems opportunities and solutions for a business\n• Budgeting and forecasting\n• Planning and monitoring\n• Reporting\n• Defining business requirements and reporting them back to stakeholders\n\nResponsibilities\n• Assessing and identifying areas for improvement in the company’s present business processes\n• Modernizing systems by investigating and evaluating new IT developments and contemporary business practices\n• Presenting concepts and results at meetings\n• Developing ideas in accordance with the demands and needs of the business", "occupation": "business analyze"}, {"title": "Technical Business Analyst", "company": "TSR Consulting Services", "location": "New York, NY, USA", "via": "via TSR Consulting Services", "type": "Contractor", "time": "none", "salary": "none", "links": ["https://tsrconsulting.com/jobs/technical-business-analyst/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.ziprecruiter.com/c/Atlantic-Partners-Corporation/Job/Technical-Business-Analyst-Contract/-in-New-York,NY?jid=b821a3b24b4202ad&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.linkedin.com/jobs/view/business-analyst-1383-at-certec-inc-3694918291?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.indeed.com/viewjob?jk=aecad43ff17664e0&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.levels.fyi/jobs?jobId=105093873094533830&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://salutemyjob.com/jobs/business-analyst-1383-new-york/1142041370-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.bebee.com/job/20231101-7a59faf7ccc85600ba227e9dc337b2f8?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.wearegreenbay.com/jobs/business-analyst-1383-new-york/1142041370-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Our client, a leading financial services company, is hiring a Technical Business Analyst on a contract basis.\n\nWork Location: New York, NY (hybrid- 3 days a week onsite...\n\nTeam Profile:\n\nLegal Compliance & Corporate Governance (LCG) Technology provides operational controls and surveillance capabilities to enhance the firms resilience to threats and fraudulent behavior.\n\nOur support of critical business functions extends to archival & records management, business continuity planning and due diligence investigations.\n\nPosition Description:\n\nThis role is part of the Financial Advisor Monitoring and Registration Department, within LCG. This team supports the Risk and Compliance divisions with tools and applications to assist them with their task of monitoring Financial Advisors compliance with the Firms policies and procedures. As a Business Analyst, you will be responsible for providing business analysis, project management, and data analysis support for tool enhancements: eliciting and documenting business requirements, user acceptance testing, data analysis, and product support. The ideal candidate should have the skills listed below but in addition should be a self- driven, dedicated individual who works well in a team and thinks and acts strategically. When faced with a problem, the candidate should be able to ask questions and leverage the skills and expertise of those around them.\n\nKey Responsibilities:\n• Elicit, analyze, generate Business requirements documents (including Agile user stories, proof of concept models, and supporting documentation)\n• Analyze data sets to determine data gaps and work with cross functional teams to bridge the gap\n• Liaise with the development team to ensure the product is developed according to specifications\n• Conduct Behavior-Driven Development (BDD), write and execute User Acceptance Testing (UAT) test plan\n• Create and manage the overall project plan at the project level; and escalate delays to the program lead.\n\nSkills Required:\n• Bachelors Degree in Computer Science\n• Minimum 10 years of experience in global organizations as a Technical Business Analyst.\n• Proficiency in Data Analysis, with working experience in SQL and relational databases\n• Established technical knowledge in software development life cycle and agile methodologies.\n• Strong communication skills, both verbal and written; as well as work in an international team setting.\n• Collaborate effectively across a variety of IT and Business groups, across regions and roles.\n• Self-motivated individual and creative thinker who will take ownership of tasks assigned.\n• Ability to problem solve and have creative solutions in challenging environments\n• Able to thrive in a fast-paced, high energy, demanding and team-orientated environment\n• Manage and delegate workload through the team\n• Good customer service skills. Ability to deal with difficult situations gracefully.\n• Experience in trade lifecycles and asset classes, Equity, Fixed Income, Options, Futures\n• Understanding of Compliance surveillance platforms (Actimize, MANTAS, Sungard) and their models, Wash trades, Marking the Open/Close, Spoofing, Insider Trading, etc.\n\nSkills Desired:\n• IT Project Management and SDLC knowledge/experience (Waterfall, Agile/Scrum) and experience using BDD.\n• Experience working in medium to large-scale development projects.\n• Knowledge of trades data, positions data, reference data.\n• Experience in Nasdaq SMARTS platform\n\nPay Rate: $62- $77/hr", "occupation": "business analyze"}, {"title": "Busines", "company": "RIT Solutions, Inc.", "location": "New York, NY, USA", "via": "via Talent.com", "time": "5 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.talent.com/view?id=871e6202e821&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ny.tarta.ai/j/iT87m4oBcRajQcTjis1q0923-busines-in-new-york-new-york-at-rit-solutions-inc?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Technical Business Analyst role under Wealth Management AIDT practice area group for Generative AI Open AI CoE\n\nGenerative AI Technology...\n\nGenerative AI Technology team is a dynamic and fast-paced area within the Firm's WM Technology Division. We are responsible for creating Generative AI platform for the firm and working with partners such as OpenAI, Scale.\n\nAI and Kore.ai . This technology is disrupting way business in conducted. Team uses cutting edge innovative AI / NLP technology in building Virtual Assistants / co-pilots to support multiple business units like Wealth Management Operations and Wealth Management Research.\n\nIf you are an exceptional individual who is interested in solving complex problems and building sophisticated solutions in a dynamic team environment, Generative AI technology is the place for you.\n\nPosition Overview :\n\nTechnical and functional analysis of platforms / applications and documentation of current state and to-be state\n\nExtensive coordination and collaboration for gathering requirements and technical details with key stakeholder across different teams (development, architecture, QA and SMEs)\n\nRobust management and complete ownership of design documentation entailing functional specifications, technical & functional process flows, technical architecture, technical sequence and data flow, integration specifications\n\nCommunicate effectively - both verbally and written - to peers, business and technology partners to include strong questioning and listening skills and the ability to look beyond obvious answers to understand impacts.\n\nInterview business / other solution management counterparts to effectively draw out and articulate the business need / problem / opportunity to be addressed.\n\nProvide scaled options for implementation based on the business need.\n\nGather and analyze requirements. Organize and document business needs to enable design and development, including elicitation and documentation of current state and future state workflows, user stories, acceptance criteria, data mapping and UI wireframes.\n\nElicit and document processes and procedures, as well as partner in preparing training and adoption materials\n\nLead and influence cross-functional teams.\n\nExtensive follow-ups and proactive communications with team members to get the required details for ensuring on-time deliveries\n\nDeveloping technical solutions to business problems and requirements begins with defining, analyzing and documenting requirements.\n\nManaging requirements at the project level can help fulfill business needs\n\nBuild out of a knowledge repository detailing the entire business solution architecture and application ecosystem\n\nWorking in the GenAi CoE to set guardrails , policy, procedures.\n\nWorking on Gen Ai use cases, possibilities and implementations\n\nThe Right Candidate\n\n10+ years of demonstrated experience in a large complex banking organization or major consulting firm acting as a Sr. Business analyst or product owner capacity.\n\nDomain and system knowledge to turn customer needs into business requirements and technology business outcomes.\n\nCompetent and experienced in technology environments (e.g., platforms, applications, databases, organizational structure and culture, teams involved in the successful completion of technology initiatives, etc.).\n\nEffective partner management skills, expertise in facing senior business partners and ability to engage with functional specialists from other departments of the bank.\n\nThorough understanding of how to interpret customer business needs and translate them into application and operational requirements.\n\nSQL experience in data analysis and Outstanding analytical and problem solving skills\n\nUnderstanding the value of diversity in the workplace and is dedicated to fostering an iclusive culture in all aspects of working life so hat people from all the background receive equal treatment, realize there full potential and can bring their full authentic selves to work.\n\nGood communication, teamwork, and influencing skills; ability to communicate effectively with the team and key business representatives.\n\nOutstanding analytical and problem solving skills\n\nUnderstanding of requirements of large enterprise applications (security, entitlements, etc.)\n\nExperience with working in an Agile squad / chapter setup. Practiced understanding of Agile development methodologies and understanding of DevOps Integration\n\nStrong familiarity with Agile software / tools (e.g., JIRA) and DevOps processes and tools (e.g. Jenkins and TeamCity).\n\nEffective time management, Ability to work under pressure with different moving parts and deliver to tight deadlines\n\nProficient with MS Office applications : Excel, Visio, Word, and PowerPoint and usage of sharepoint, JIRA , etc.\n\nEffective listener, speaker, reader and writer - able to bridge business and technical domains, promote best practices, and enforce good governance within challenging timelines\n\nExperience in analyzing product level or large initiatives\n\nEducational Qualification :\n\n10+ years of experience working as Technical Business Analyst\n\nKnowledge of BFSI domain and Wealth Management business\n\nMinimum BE / BTech degree in Computer Science, IT Engineering or a related field., Information Management or other relevant field\n\nPrimary skills\n\no Knowledge of Wealth Management business and Client Onboarding & Account opening\n\no Understanding of chatbots / LLM / Client\n\no Experience in creating and working on policy , procedures, guardrails or CoE would be beneficial\n\no Understanding of design documentation Functional & Non-Functional specifications, Technical Architecture, Process flows, Technical and Data sequence flows, Integration specifications\n\no Experience in participating Production Support and Triaging discussions and ability to analyze the incidents / defects to identify failure / improvement areas\n\no Experience in MS office, MS Visio, SharePoint, Jira,\n\no Good understanding of technology stack and N-tier architecture, UX, UI, APIs / Web services, business workflow, MQ, database, SQL's and batch processing\n\no Understand business objectives. Working with users to formulate business & system requirements.\n\no Identifying, investigating, and analyzing business processes, procedures and work practices.\n\no Identifying and evaluating inefficiencies and recommending optimal business practices, and system functionality and behavior\n\no Good understand of synchronous, asynchronous business workflow and processing.\n\no Experience in agile, for planning, leading, organizing, and motivating agile project teams. Achieve a high level of performance and quality and deliver agile projects that provide exceptional business value to users.\n\nGood in user story writing and grouping\n\no Good verbal communication skills and presentation skills.\n\no Strong ability to take ownership and run stakeholder meetings\n\no Be excellent at time management\n\no Strong leadership skills\n\no Stakeholder management\n\nLast updated : 2023-11-12", "occupation": "business analyze"}, {"title": "Business Analyst", "company": "Armand Corporation", "location": "New York, NY, USA", "via": "via Salary.com", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.salary.com/job/armand-corporation/business-analyst/j202306200337022282112?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ny.tarta.ai/j/dq4cwokBcRajQcTjSCW50823-business-analyst-in-new-york-ny-at-armand-corporation?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Business Analyst\n\nJob Summary...\n\nArmand Corporation is seeking a Business Analyst to join our team. This role will be responsible for the analysis of financial data and financial reports, as well as the development of business plans and strategies. The Business Analyst will also be responsible for the development of strategic business plans, as well as working with external partners to develop and implement business strategies. The ideal candidate will have a background in finance, accounting, or other related fields and have the ability to quickly identify and drive the best possible solution when presented with a series of opportunities and constraints.\n\nResponsibilities:\n• Work with functional business leads and other business analysts to develop and transform requirements into systems design and implementation.\n• Collect, document, map, and analyze business process and system dependencies.\n• Gather, synthesize, and document business requirements.\n• Effectively communicate status, collaborate, and problem-solve with relevant stakeholders.\n• Collaborate with colleagues to identify recommendations for process improvements, overcoming constraints, and resolve difficult operational and technological issues.\n• Identify and report risks to management.\n• Document changes to the design and implementation of various systems which includes but not limited to: Salesforce, SharePoint O365, and PeopleSoft.\n• Manage ongoing support requests and research / document the needs behind those requests.\n• Work directly with and serve as the liaison between business units, technology teams, and support teams.\n• Assist in quality assurance and defining testing strategies and risks. Provide significant contributions in the testing and debugging of new functionality.\n• Assist in the development of training resources to support implementations.\n• Assist in the improvement and integration of automation and tools designed to support work and decision making.\n• Recommend leveraging existing functionality that might be available rather than building new.\n• Perform other duties as assigned to support the Strategic Operations team.\n\nSkills:\n• Bachelor’s degree in Business Administration or related field preferred.\n• Minimum of 3 years of experience in financial analysis required.\n• Proficient in Microsoft Office products (Word, Excel, PowerPoint) required.\n• Experience in SharePoint, PeopleSoft, Tableau, and Salesforce preferred.\n• Must be comfortable with learning new software programs as needed or added functionality is needed.\n• Experience in documenting requirements and specifications, and creating visual aids representing business processes using standard methods.\n• Experience with project management methods processes, standards, and tools.\n• Ability to elicit functional needs from business users and translates those needs to existing functionality to aviod customization.\n• Ability to help identify and drive the best possible solutions when presented with a series of opportunities and constraints.\n• Ability to interact professionally with a diverse group.\n• Ability to understand, define, and document business needs comprehensively.\n• Excellent verbal and written communication skills.\n• Customer-oriented, with active listening skills.\n\nJob Type: Full-time\n\nPay: $72,000.00 - $95,000.00 per year\n\nBenefits:\n• 401(k)\n• Dental insurance\n• Health insurance\n• Life insurance\n• Paid holidays\n• Paid sick time\n• Paid time off\n• Professional development assistance\n• Vision insurance\n• Work from home\n\nCompensation package:\n• Yearly pay\n\nExperience level:\n• 3 years\n\nSchedule:\n• 8 hour shift\n• Day shift\n\nPeople with a criminal record are encouraged to apply\n\nExperience:\n• Business Analysis: 3 years (Preferred)\n\nWork Location: Remote", "occupation": "business analyze"}, {"title": "Technical Business Analyst", "company": "Insight Global", "location": "New York, NY, USA", "via": "via LinkedIn", "time": "2 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/technical-business-analyst-at-insight-global-3758963865?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.nexxt.com/jobs/technical-business-analyst-junior-developer-new-york-ny-2620632679-job.html?aff=2ED44C72-8FD2-4B5D-BC54-2F623E88BE26&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Must-Haves:\n• Bachelor's degree strongly preferred\n• 5+ years of BA and development experience...\n• Excels in various programming languages and frameworks, including but not limited to C#, VB.NET, VBScript, PHP, ASP.NET Core, Python, WebAPI, and SOAP\n• Proficient in an array of web technologies, such as HTML, CSS, Bootstrap, React, AngularJS, Angular, NodeJS, JavaScript, including relevant frameworks\n• Skilled in SQL and database technologies and understanding of database concepts, data modeling, and data analysis\n• Competent in utilizing reporting tools such as Reporting Services and Excel, and proficient in data visualization tools like Tableau and PowerBI\n• Experience with source control systems, including Git, GitHub, TFS, and SVN\n• Exhibits adaptability and willingness to learn new skills and technologies\n\nDay-To-Day:\n\nInsight Global is seeking a Technical Business Analyst/ to join our client's team at a global law firm headquartered in New York City. The Business Analyst / Junior Developer is responsible for gathering, analyzing, and documenting business and technical requirements; conducting thorough application reviews and crafting functional documentation; leading quality assurance and testing efforts; performing data analysis and modeling; designing and developing applications; and contributing to software development projects. Typical responsibilities include:\n• Collaborate with business stakeholders to understand their needs and produce detailed business requirements for implementation by our development team\n• Analyze complex business processes, workflows, and data flows to identify opportunities for improvement and efficiency gains\n• Create clear and concise functional and technical documentation, including process diagrams, users stories, and use cases\n• Work closely with senior developers to assist in the design, development, and testing of software solutions.\n• Develop proficiency in programming languages, tools, and development methodologies.\n• Extract, transform, and analyze data to support business decision-making and identify trends or anomalies\n• Thoroughly test and validate software applications to ensure they align with business requirements, function correctly, and perform as expected\n• Evaluate and recommend software products while overseeing the design and testing processes", "occupation": "business analyze"}, {"title": "Technical Business Analyst", "company": "The Crox Group", "location": "New York, NY, USA", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.com/job/ykNNkb9HFndc_weOF4nBGoYL4WAhW8jooybZ3VKmrTzHmTWZbf6pvA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Role:- ESG (Environmental Social Governance) Technical Business Analyst\n\nLocation:- New York, NY (Hybrid...\n\nJob Description:-\n\nQualifications:\n• Prior experience as a business analyst working in collaboration with software development.\n• Affinity for technical writing and presenting ability to formally document requirements, reach agreements with others, and explain detailed requirements to others as needed.\n• Excellent communication skills including the ability to communicate effectively in both formal and informal contexts in a fashion tailored for the audience.\n• Practical understanding of relational database design and familiarity with SQL programming using T-SQL.\n• Strong problem-solving skills.\n• Able to work independently with minimal direction and guidance from manager. Highly skilled in incorporating successful interviewing, facilitation, and documentation techniques within a project.\n• Strong client service skills Ability to deliver under stress in a fast-paced environment Methodical and attention to details Strong understanding of Investment Data and Investment Management industry\n\nDesired Skills:\n• Knowledge of ESG business.\n• Experience in analyzing and interpreting investment data. Strong data and process analysis skills\n\nThanks\n\nJob Types: Contract, Full-time\n\nSalary: $80.00 - $90.00 per hour\n\nSchedule:\n• 8 hour shift\n• Overtime\n\nExperience:\n• ESG (Environment, social, Governance): 1 year (Preferred)\n\nWork Location: On the road", "occupation": "business analyze"}, {"title": "Business Analyst", "company": "Atechstar", "location": "New York, NY, USA", "via": "via OPTnation", "type": "Full-time, Part-time and Contractor", "time": "none", "salary": "none", "links": ["https://www.optnation.com/business-analyst-job-in-new-york-ny-view-jobid-32780?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Requirements Bachelor of Computer Science Software Engineering or equivalent Very good English communication skills. Good organisational & managerial skills. Knowledge of software development process especially software requirement analysis. Good listening and interviewing skills to understand a customer’s business environment and processes. Good Presentation and client relation skills. Have a... domain knowledge on social network e-commerce e-learning would be added advantage.\n\nKey Skills Analytical and Critical Thinking. Communication and Interpersonal Skills. Negotiation and Cost-Benefit Analysis. Programming Languages. Creation of Reports and Dashboards. Database and SQL", "occupation": "business analyze"}, {"title": "Business Analysis Manager", "company": "Wolters Kluwer N.V.", "location": "New York, NY, USA", "via": "via ZipRecruiter", "time": "9 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Wolters-Kluwer-N.V./Job/Business-Analysis-Manager/-in-New-York,NY?jid=5ee7f6c0771b7c83&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.prodivnet.com/job/business-analysis-manager-new-york-new-york-13181383?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.bebee.com/job/20231031-4a064a9fd87ce4d63635442fa19fbad7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://myjobsny.usnlx.com/new-york-ny/business-analysis-manager/D4EC41428B95460BA9166957972F2DF5/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.levels.fyi/jobs?jobId=121940843926823622&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.talent.com/view?id=b164ad8e3186&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.jobilize.com/job/us-ny-new-york-business-analysis-manager-wolters-kluwer-n-v-hiring?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://wolters-kluwer.talentify.io/job/business-analysis-manager-new-york-new-york-wolters-kluwer-r0036038?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Description\n\nThe BizOps & Strategy Group is at the heart of transformation of Global Business Services (GBS). You will play a leadership role both in shaping our team's strategy and operations projects, as well as leading cross-functional teams to deliver key results and insights. You will report to the Business Analysis Associate Director...\n\nThis is a hybrid position (3 days a week) in New York City. #LI-Hybrid\n\nYou Will:\n• Being a senior member of our team, driving program delivery, stakeholder management, career development of junior team members and influencing our future growth strategies\n• Take ownership of high priority projects / programs including business case development, implementation and change management plans\n• Support leadership teams in strategic organization planning and driving growth opportunities\n• Influence senior executives and leading cross-functional management teams\n• Lead projects from discovery and ideation to implementation\n• Analyze data and leading analysis to develop powerful data driven decisions\n• Present results to executive leadership and the broader organization\nYou Have:\n• BA or BS degree required; MBA preferred\n• 5+ years of relevant work experience in strategy and operations at a major corporation or management consulting firm\n\nRequirements\n• Experience leading complex operational and strategic initiatives\n• Experience managing cross-functional teams in a high growth environment\n• Ability to research, assess, interpret data\n• People management experience with direct and indirect reports\n• Advanced skills in PowerPoint and Excel (additional analytical tool knowledge is a plus)\n• Cross-cultural work experience\n\nBenefits:\n\nA comprehensive benefits package that begins your first day of employment. Additional Information: Wolters Kluwer offers great benefits and programs to help meet your needs and balance your work and personal life, including Medical, Dental, & Vision Plans, 401(k), FSA/HSA, Commuter Benefits, Tuition Assistance Plan, Vacation and Sick Time, and Paid Parental Leave. Full details of our benefits are available - https://www.mywolterskluwerbenefits.com/index.html\n\nDiversity Matters\n\nWolters Kluwer strives for an inclusive company culture in which we attract, develop, and retain diverse talent to achieve our strategy. As a global company, having a diverse workforce is of the utmost importance. We've been recognized by employees as a European Diversity Leader in the Financial Times, as one of Forbes America's Best Employers for Diversity in 2022, 2021 and 2020 and as one of Forbes America's Best Employers for Women in 2021, 2020, 2019 and 2018. In 2020, we placed third in the Female Board Index, and were recognized by the European Women on Boards Gender Diversity Index. Wolters Kluwer and all of our subsidiaries, divisions and customer/departments is an Equal Opportunity / Affirmative Action employer.\n\nCompensation:\nTarget salary range CA, CT, CO, NY, WA: $114,100-$159,900", "occupation": "business analyze"}, {"title": ".NET Business Analyst", "company": "NYSERDA", "location": "New York, NY, USA", "via": "via SimplyHired", "time": "14 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.simplyhired.com/job/1QwxkJg6Mi3zSdGsSXtGeWILO_mAqSykEQL4OyJeR_2sM0rl898qzA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.indeed.com/viewjob?jk=45f972e72e463345&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.glassdoor.com/job-listing/-net-business-analyst-nyserda-JV_IC1132348_KO0,21_KE22,29.htm?jl=1008960409913&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://careers.goadvancedenergy.com/companies/nyserda-2/jobs/31378815-net-business-analyst?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "New York is leading the nation in the fight on global climate change and the transition to a clean energy-powered economy. The Climate Leadership and Community Protection Act (Climate Act) has created the most aggressive climate change goals in the nation and requires an ambitious agenda that blends proven catalysts with innovative approaches while operating across a broader energy arena that is... rapidly evolving. New York State Energy Research & Development Authority (NYSERDA) is a driving force in realizing this agenda. NYSERDA works with stakeholders that span residents, business owners, developers, community leaders, local government officials, universities, utilities, investors, entrepreneurs, and more, to develop, invest, and foster conditions that:\n• Attract the private sector capital investment needed to expand New York’s clean energy economy.\n• Overcome barriers to using clean energy at a large-scale in New York.\n• Enable New York’s communities and residents to benefit equitably from energy efficiency and renewable energy.\n\nJob Overview\n\nNYSERDA seeks a .NET Business Analyst to join our highly agile team of professionals dedicated to delivering high quality project deliverables through thorough and thoughtful planning as well as consultation with a wide variety of users. The .Net Business Analyst is a key member of the team responsible for understanding, documenting, and mapping business processes to appropriate technology solutions based on .NET (C#) and Microsoft Azure. The .NET Business Analyst is also responsible for doing gap analysis on existing systems to determine where development is needed.\n\nPrimary Responsibilities\n• Identify business needs, elicit specifications and requirements, and collaborate with customers and other IT team members to develop innovative solutions\n• Prepare functional specifications, review with customer, and revise as needed, obtain sign off\n• Provide analysis for projects involving systems design or redesign\n• Serve as a customer liaison, represent the department as needed on project teams and working groups\n• Document system processes, configurations, and changes\n• Manage multiple projects and assignments concurrently; meet established deadlines\n• Communicate to management and end-users in meaningful and understandable terms\n• Facilitate communication and collaboration among diverse groups at all levels of the organization\n• Serve as a resource for other team members\n• Understand and adhere to NYSERDA’s policies and procedures.\n• Perform other responsibilities as assigned\n\nMinimum Qualifications\n• Bachelor’s degree in Information Systems or a related field, and two years experience in systems analysis work; or\n• Associates degree and five years of experience in systems analysis work;\n• Certificates from recognized programs that indicate mastery of tools and techniques relevant to the assignment may substitute for up to six months of experience.\n• Experience translating business needs into formal requirements\n• Experience creating functional and technical documentation\n• Ability to communicate technically complex concepts in easy-to-understand terms\n• Ability to communicate effectively and clearly with both technical and non-technical staff\n• Ability to focus on details to create a reliable and accurate work product\n• Experience with relational databases and complex data structures; ability to create basic SQL queries\n• Knowledge of end user data manipulation tools\n• Strong organizational and time management skills\n• Ability to facilitate internal end-user training on new or substantially modified systems.\n• Ability to facilitate User Acceptance Testing sessions\n• Experience triaging bug and enhancement tickets and helping to diagnose system problems\n• Knowledge of data security and encryption\n• Ability to keep up with technology advancements\n\nPreferred Qualifications\n• Relevant certifications in .NET, Microsoft Azure, or other cloud computing technologies\n• Experience with requirements decomposition\n• Experience with requirements traceability analysis\n• Experience with Agile development practices (e.g. Scrum)\n• Experience with systems analysis for software systems leveraging .NET and/or Microsoft Azure\n• Knowledge of report creation tools\n• Experience establishing, documenting, and maintaining procedures and processes\n\nPlease submit two files, one for your cover letter and another for a resume.\n\nNYSERDA is exclusively working with a recruitment partner who will be responsible for the initial screening of the resumes for this position.\n\n[IND123", "occupation": "business analyze"}, {"title": "Legacy Replacement Project Business Analysis Supervisor", "company": "City of New York", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/City-of-New-York/Job/Legacy-Replacement-Project-Business-Analysis-Supervisor/-in-New-York,NY?jid=ba3927acded74da7&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.smartrecruiters.com/CityOfNewYork/3743990002698466-legacy-replacement-project-business-analysis-supervisor?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.indeed.com/viewjob?jk=b4d43d502bf38d42&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company Description\n\nJob Description...\n\nPLEASE NOTE: Applicants must be serving as a permanent Computer Systems Manager, in order to apply.\n\nNYCERS is seeking an experienced professional to serve as a Legacy Replacement Project (LRP) Business Analysis (BA)Supervisor. Under managerial direction, with wide latitude for independent judgment and initiative, the LRP BA Supervisor will be responsible for assisting in leading and managing of others within the team.\n\nPrimary Responsibilities:\n-Manage team of Business Analysts working on NYCERS' Legacy Replacement Project\n-Assist in the Management of the day-to-day operational aspects of team\n-Act as a point of escalation for issues raised by those in the team (Troubleshoot problems identified, Initiate follow-up corrective actions)\n-Handle business and project issues proactively and escalates appropriately\n-Uphold team standards and operating procedures and facilitate effective team and project interaction\n-Manage LRP resources in accordance with project schedule\n-Lead and Facilitate User Acceptance Testing\n-Act as lead liaison between Vendor, IT and business teams\n-Assist in the facilitation of team and business meetings\n-Design process flows, write requirements, and test systems\n-Lead internal team tasks and mentor those with less experience in the team\n-Rate and evaluate job performance of subordinates through observations, record keeping\n-Product Quality Assurance: Ensure that all deliverables meet the organization's quality standards\n-Partner with the business units to identify, develop and implement process improvement initiatives facilitated by technology capabilities or process re-engineering.\n-Work with various business units to identify, propose, analyze and evaluate solutions that most effectively meet business and organizational needs and strategic/tactical goals\n-Participate in the evaluations of the As-Is process and the analysis and documentation of the To-Be process improvements in support of the Business Process Reengineering efforts.\n-Provide project teams with a clear understanding of business needs, requirements and specifications\n-Assist project managers with scoping, estimation, reporting, scheduling, risk management, and communication as required\n\nQualifications\n\n1. A master's degree in computer science from an accredited college or university and three (3) years of progressively more responsible, full-time, satisfactory experience in Information Technology (IT) including applications development, systems development, data communications and networking, database administration, data processing, or user services. At least eighteen (18) months of this experience must have been in an administrative, managerial or executive capacity in the areas of applications development, systems development, data communications and networking, database administration, data processing or in the supervision of staff performing these duties; or\n\n2. A baccalaureate degree from an accredited college or university and four (4) years of progressively more responsible, full-time, satisfactory experience as described in \"1\" above; or\n\n3. A four-year high school diploma or its educational equivalent, and six (6) years of progressively more responsible, full-time, satisfactory experience as described in \"1\" above; or\n\n4. A satisfactory combination of education and experience equivalent to \"1\", \"2\" or \"3\" above. However, all candidates must have at least a four-year high school diploma or its educational equivalent and must possess at least three (3) years of experience as described in \"1\" above, including the eighteen (18) months of administrative, managerial, executive or supervisory experience as described in \"1\" above.\n\nIn the absence of a baccalaureate degree, undergraduate credits may be substituted for a maximum of two (2) years of the required experience in IT on the basis of 30 semester credits for six (6) months of the required experience. Graduate credits in computer science may be substituted for a maximum of one (1) year of the required experience in IT on the basis of 30 graduate semester credits in computer science for one (1) year of the required IT experience. However, undergraduate and/or graduate credits may not be substituted for the eighteen (18) months of experience in an administrative, managerial, executive, or supervisory capacity as described in \"1\" above.\n\nAdditional Information\n\nThe City of New York is an inclusive equal opportunity employer committed to recruiting and retaining a diverse workforce and providing a work environment that is free from discrimination and harassment based upon any legally protected status or protected characteristic, including but not limited to an individual's sex, race, color, ethnicity, national origin, age, religion, disability, sexual orientation, veteran status, gender identity, or pregnancy", "occupation": "business analyze"}, {"title": "Product Development Business Analyst", "company": "Brown Brothers Harriman", "location": "New York, NY, USA", "via": "via LinkedIn", "time": "2 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/product-development-business-analyst-at-brown-brothers-harriman-3763908141?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.indeed.com/viewjob?jk=8662074a5ff0341d&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.simplyhired.com/job/DG51GEK6CDRnTNqu8ewXA6aJWqzd5lbr27ODXZZ0OPk4RNA7-S5kaw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.adzuna.com/details/4435803147?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "At BBH we value diverse backgrounds, so if your experience looks a little different from what we've outlined and you think you can bring value to the role, we will still welcome your application!\n\nWhat You Can Expect At BBH...\n\nIf you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.\n\nAs an FX Product Development Business Analyst, you will sit directly in Markets and be responsible for supporting our strategic InfoFX and emerging markets products. This includes leading InfoFX client onboards, supporting the implementation of new technology efforts, and providing day-to-day support internally to the Foreign Exchange trading desk and externally to our clients with respect to InfoFX and our Custody FX services.\n\nThis role partners directly with our New Business Development team as a subject matter expert on InfoFX and related matters during the sale process. Once a client is committed, the FX Product Development Business Analyst will assist with the onboarding of the client onto our products. This includes integration with the client’s systems, coordinating documentation with legal, and instructing our back office to open and setup accounts. Once the client is live, this analyst will remain involved in the relationship moving forward and will liaise with our FX desk to help participate in client meetings, provide day to day support and help manage their FX program.\n\nThe FX Product Development Business Analyst will also help lead and support our emerging markets InfoFX and Custody FX business. This includes researching and responding to emerging market FX related inquiries from our global client base and internal BBH teams. As well as participate in client or sales discussions and presentations as they pertain to our emerging market suite of FX products. The individual will help to support BBH FX’s relationships with our contacts in local markets (i.e. FX counterparties, subcustodians).\n\nSince this role will be expected to partner across many internal teams, (Relationship Management, Trading, Sales, Technology, Documentation, Investment Operations, Service Delivery and Custody), as well as supporting clients directly, we are searching for a candidate with strong communication and an interest in building relationships. The ideal candidate will also have a strong interest for Foreign Exchange and Technology.\n\nKey Responsibilities Include\n\nInfo FX Implementation, Onboarding:\n• Operate as the client’s FX subject matter expert during implementations.\n• Research and analyze the impact of market changes to BBH clients.\n• Assist in the identification of process improvements to lower costs and improve efficiencies.\n• Leverage expertise from other BBH lines of business\n• Document procedures, opportunities, best practices, project goals and workflows.\n\nClient Service/Relationship Management\n• Build and maintain relationships at all levels, both within and outside the organization\n• Assess and provide solutions for clients, acting as a key point of contact for enhancement requests and escalated onboarding and production issues.\n• Participate in relationship meetings to communicate InfoFX product strategy to clients.\n\nEmerging Markets\n• Research and respond to emerging market FX related inquiries from global client base and internal BBH teams.\n• Participate in client sales discussions and presentations as they pertain to our emerging market suite of FX products.\n• Utilize information from BBH FX relationship managers and FX clients to understand emerging market trading needs and changes in local market practices.\n• Design, create, and maintain detailed FX trading guides, including client case studies that highlight innovative and thoughtful trading solutions in restricted markets\n• Continually expand understanding of our industry concepts and market practices through responses to client queries, participation in departmental projects, and regular interaction with Operations, Treasury, Network and Trading functions.\n• Work with local market providers to support BBH FX’s operations in local markets.\n\nDesired Qualifications\n• Bachelor’s degree or equivalent work experience required\n• 5+ years of relevant work experience\n• Experience working in the financial services industry\n• Knowledge of BBH products, services and practices is a plus\n• General knowledge of the SWIFT platform and messaging is a plus\n• Strong business analysis skills, including business requirements, product proposals and business and technical workflows\n• Strong interpersonal and collaboration skills\n• Knowledge of international currency markets, including the impact of economic and political factors, a plus\n• Knowledge of foreign exchange trading instruments, a plus\n• Strong project management, problem solving and analytical skills\n• Strong organizational, consultative, and advisory skills\n• Knowledge of emerging trends in the industry\n• Ability to analyze and summarize complex business issues\n• Ability to manage multiple priorities simultaneously, while meeting deadlines\n• Strong written and verbal communication skills, including presentations.\n\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.\n\nSalary Range\n\n$110K - $125K\n\nBBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH's total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being", "occupation": "business analyze"}, {"title": "Senior Business Analyst -- IT", "company": "HireTalent", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Contractor and Temp work", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/HireTalent/Job/Senior-Business-Analyst--IT/-in-New-York,NY?jid=7ce514e0ecda3d85&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://hiretalent.talentify.io/job/senior-business-analyst-it-queens-new-york-hiretalent-18-05316?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Description: Senior Business Analyst -- IT Request\nJob Location: Queens, NY\nJob Duration: 6 Months...\n\nPosition Summary\nThis role will work directly with the Executive Director Finance, providing financial models and business analysis to support the Vice President, Global IT Partner Strategy's assessment of global sourcing opportunities for the Information Technology department.\n\nThis role sits under the Vice President, Global IT Partner Strategy team.\n\nRoles & Responsibilities\nPrimary Duties:\n• Support the analyses required by the ITO Cost program\n• Support the development and refinement of the Program's Business Case\n• Support the development of the ITO Financial Model\n- Mapping of invoice and time entry data records with application inventory\n- Calculation of costs allocated on a per unit basis and aggregated by category\n- \"What-if” modeling of various decision scenarios\n- ROI and payback period calculations\n• Support the development and assessment of the Pricing/ Cost and Service Level Agreements (SLA) for better affordability/pricing opportunities.\n• Support the financial assessment of the sourcing bidders' offers.\n- Comparative analyses of sourcing bidders' initial and negotiated price responses.\n- Comparative normalization of proposals\n- Analyses of the Total Cost of IT Ownership.\n- Analyses of the sourcing bidders' Best And Final Offers\n• Complete the development and negotiation of ITO Statement of Work and Master Service Agreement:\n- Coordinate SOW Services with the cost and pricing mechanisms for these Services\n- Assist in the development of financial and business terms and conditions:\n§ Financial Responsibility matrix\n§ Pricing Tables\n§ Rate Cards\n§ Termination for Convenience Fees\n• Assist in supporting the ITO Negotiating Strategy and ELC negotiating position.\n- Analyses of the Cost Term Sheet for the Finalist\n- Analyses of bidders' Final Rates and Price for Services\n• Support the development and assessment of the Pricing/ Financial ITO SOW Support Model\n• Support all other financial analyses as required by the ITO Cost program\n\nQualifications\nSkills & Requirements\nExperience Preferred:\n- 3-5 years' experience in business analysis (no CPAs!)\n- Microsoft Office Proficiency: expert in Excel (vlookups, pivot tables, data manipulation; proficient in PowerPoint; skilled in Access)\n- Excellent written and oral communication and presentation skills in American English\n- Experience working in a global environment\n- Ability to make decisions and find innovative solutions to complex problems with minimal supervision\n- Effective time management, prioritization, negotiating and organizational skills\n- Customer focused attitude\n- Vendor Management Skills\n- Prior IT Asset Management, Sourcing, or Leasing experience\n- Teamwork and Cooperation\n- Positively react to shifting priorities\n- Ability to communicate at various degrees of detail (peers, finance, management)\n- Analytical & good attention to detail\n- Experience/proficiency in ERM systems and software, such as SAP and Hyperion\n\nCore Competencies:\n1. Thinks Strategically: Takes a broad view of the business, industry, and consumer environment to anticipate and plan for the future. Identifies the focus and defines where to play, how to achieve, and how to negotiate successful agreements.\n2. Builds Collaborative Relationships: Builds relationships based on trust and respect within the organization and its supplier network. Promotes the inclusion of diverse knowledge, skills, and experiences to achieve results.\n3. Demonstrates Learning Agility: Ability to anticipate change, adapt to new priorities, face reality, draw conclusions, and swiftly mobilize to adapt to changing needs and demands", "occupation": "business analyze"}, {"title": "Business Analyst", "company": "Robert Half", "location": "Woodbridge Township, NJ, USA", "via": "via Robert Half", "time": "4 days ago", "type": "Full-time and Temp work", "salary": "none", "links": ["https://www.roberthalf.com/us/en/job/woodbridge-nj/business-analyst/02720-0012838267-usen?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.jobrapido.com/jobpreview/3085458007?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "As a business analyst, he/she will perform business and technical analysis related tasks, eliciting and developing userrequirements and translating them into business requirements specifications, and providing systems analysis of present stateand showing project future system state. The incumbent is also responsible for ensuring alignment with IT solutionteams, our infrastructure, and processes. The successful candidate will be responsible for business analysis, excelling inbusiness analysis.Critical to the success in this role, is the ability to understand and articulate internal user needs and innovations and developbusiness requirements for the development, deployment, and service management of tools, services, applications andproducts for operations and new product development for business units. The role reports to the IT Business RelationshipManager and manages [0] direct reports. This position works under consultative direction and is highly aligned to thesupporting business... and IT business units because the activities have an organization-wide impact. Key ResponsibilitiesBusiness analysis and development of functional and non-functional requirements;• Documentation of requirements, test case oversight and change management procedures from an businessowner perspective for existing mission critical systems & amp; applications ensuring change meets (or exceeds) businessobjectives• Alignment of change management processes with processes• Alignment of all technology services and quality management processes• Oversight of the design of applications and the mapping of functional business requirements into technicalrequirements/agile stories.Work as part of a team to IT team to provide solutions based on business objectives", "occupation": "business analyze"}, {"title": "Business Technical Analyst", "company": "Altice USA", "location": "Bethpage, NY, USA", "via": "via Altice USA Careers", "time": "6 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.alticeusacareers.com/job/Bethpage-Business-Technical-Analyst-NY-11714/1064076200/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.ziprecruiter.com/c/Altice-USA/Job/Business-Technical-Analyst/-in-Bethpage,NY?jid=9a82cc9de11809e8&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.linkedin.com/jobs/view/business-technical-analyst-at-optimum-3695807734?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.indeed.com/viewjob?jk=c91e3f369bf3ffe3&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.adzuna.com/details/4268165490?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.bebee.com/job/20231031-6f8d30d77afc943a2619d4c03b70c69f?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.glassdoor.com/job-listing/business-technical-analyst-optimum-JV_IC1132187_KO0,26_KE27,34.htm?jl=1008816906284&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.levels.fyi/jobs?jobId=77150453613109958&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Altice USA is a cutting-edge communications, media, and tech company. We connect people to what matters most to them; texting with friends, advertising that resonates, or binge watching their favorite show. Our differentiated approach centers around technologies that push the envelope and deliver the ultimate customer experience. We’re building a workforce that attracts and retains the best... talent, not only to meet the needs of our customers, but that also reflects the diverse communities we serve.\n\nJob Summary\n\nThe Business Technical Analyst is the go-to resource for providing multi-level support for the Contact Centers, addressing concerns raised via chats, emails, and phone that may have impact to the business operations. Their primary focus will be to ensure the highest level of IT stability for Contact Center functionality by analyzing data, identifying trends, and performing root cause analysis. They will collaborate with various business groups, manage outages and tickets, and serves as the key technical liaison with our business partners to deliver IT requirements that align with our business' needs. The Analyst will also conduct knowledge transfer sessions to other teams, keeping them updated on process enhancements and troubleshooting techniques.\n\nResponsibilities\n• Triage concerns brought about by the business and determine if concern is a technical issue or related to customer education.\n• Handle system-wide application issues and vendor outages by managing communications between IT, Contact Center management, and vendors.\n• Utilize ServiceNow ticketing system to manage incidents and requests in order of severity.\n• Monitor and ensure performance of IVR and Chat applications, Contact Center tools, and other Contact Center functionalities.\n• Manage Virtual Call Center opening and closing process based on business operation hours.\n• Develop reports and analyze the data to identify trends in the Contact Centers.\n• Ensures that system implementations conform to established company standards and/or industry best practices.\n• Develops documentation including operational manuals, run books, procedures, and problem resolutions.\n• Understand and can convey IVR and Chat flows to business and IT teams in a manner that is easily understood.\n• Analyze chat bot interactions, intents, and the associated customer journeys to identify, augment and implement appropriate solution(s).\n• Participates in an on-call rotation to support the business needs.\n• Optimize Chat flows to provide a seamless customer experience through the customer interactions.\n• Conducts meetings with various groups to drive to root cause and resolve outstanding issues.\n• Maintains and creates documentation around vendor contacts, design, and processes.\n• Aides and participates in the onboarding of new business partners.\n• Assists in decommissioning of vendors, processes, tools, and reclaiming of licenses.\n• Also performs other tasks as assigned.\n\n#LI-LP1\n\nQualifications\n• A Bachelor’s degree in Computer Science, or equivalent work experience is required\n• Knowledge of principles, theories, methods, materials, and equipment used in the design, installation, operation, and maintenance of telecommunications, LAN, and WAN technologies\n• Knowledge of databases and the ability to conduct basic data gathering queries\n• Ability to manage large quantities of data to produce usable business insight and to perform root cause analysis\n• Able to troubleshoot technical problems and critically think through issues with minimal supervision\n• Ability to organize, plan, and resolve incidents with minimal supervision\n• Ability to communicate clearly, concisely, and professionally in verbal and written responses\n• Strong interpersonal and teamwork skills\n• Ability to perform multiple tasks, and adjust priorities based on workload and direction from management\n\nAltice USA is an Equal Opportunity Employer committed to recruiting, hiring and promoting qualified people of all backgrounds regardless of gender, race, color, creed, national origin, religion, age, marital status, pregnancy, physical or mental disability, sexual orientation, gender identity, military or veteran status, or any other basis protected by federal, state, or local law.\n\nAltice USA, Inc. collects personal information about its applicants for employment that may include personal identifiers, professional or employment related information, photos, education information and/or protected classifications under federal and state law. This information is collected for employment purposes, including identification, work authorization, FCRA-compliant background screening, human resource administration and compliance with federal, state and local law.\n\nThis position is identified as being performed in/or reporting to company operations in New York State. Salary ranges are supplied in compliance with New York State law. Pay is competitive and based on a number of job-related factors, including skills and experience. The starting pay rate/range at time of hire for this position in the posted location is $59,758.00 - $95,613.00 /year. The rate/Range provided herein is the anticipated pay at the time of hire, and does not reflect future job opportunity.\n\nApplicants for employment with Altice will never be asked to provide money (even if reimbursable) as part of the job application or hiring process. Please review our Fraud FAQ for further details", "occupation": "business analyze"}, {"title": "Business Analyst", "company": "Teachers College", "location": "New York, NY, USA", "via": "via ZipRecruiter", "time": "20 hours ago", "type": "Full-time", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Teachers-College/Job/Business-Analyst/-in-New-York,NY?jid=3736f38b7406ccfc&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://main.hercjobs.org/jobs/18235096/business-analyst?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.indeed.com/viewjob?jk=9e171e3d293fdd3a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.bebee.com/job/20231109-b862c92d6b24efd4dd1291f0d74f1ea3?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.glassdoor.com/job-listing/business-analyst-columbia-university-JV_IC1132348_KO0,16_KE17,36.htm?jl=1008485902772&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ny.tarta.ai/j/IvMVfoYBH2nBUJTFHM-F0223-business-analyst-in-new-york-new-york-at-teachers-college-columbia-university?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Business Analyst\n\nApply now Job no: 511017...\nPosition type: Staff\nLocation: New York\nCategories: Information Systems/Technology\n\nPosting Summary:\n\nTeachers College IT seeks an enthusiastic, analytical thinker to support administrative and academic teams at the College as they explore and implement new technology.\n\nJob Summary/Basic Function:\n\nAbout TCIT\nTeachers College Information Technology (TCIT) provides technology infrastructure and services that advance teaching and learning, enable research, enrich the student experience, and effectively manage institutional information, in support of Teachers College as the premier graduate institution of education.\n\nTCIT's core values - respect, teamwork, transparency, reliability, and innovation - bind us as a team that is committed to excellence in service and project delivery while keeping Teachers College an exciting place to work, advance one's career, and maintain a healthy balance between work and home.\n\nAs a member of the TCIT, you will be empowered with trust, ownership, training, and support from your colleagues, who are here to help you succeed and grow. You will work on diverse projects with exposure to a wide array of technological building blocks, often partnering with stakeholders from across the College. If you are kind, creative, and professional, we'd love to hear from you.\n\nAbout this Position\nThe Business Analyst is a member of the TCIT Project Management Office (PMO). This individual is responsible for partnering with stakeholders in administrative and academic roles at the College to design solutions and initiatives that enhance the quality of IT products and services. The position reports to the Director of the Project Management Office.\n\nThis position manages the intake of project requests (demands) and connects with stakeholders to understand their needs and scope the project to align with the College's and Department's strategic objectives. This process can often require research of industry application offerings to support fit-gap analyses. They facilitate the demand review and application assessment processes required before a project can be approved and added to the roadmap. They liaise between business users and IT stakeholders to properly document requirements and specifications.\n\nBusiness Analysts also participate in the execution of projects - sometimes leading the effort, and sometimes supporting business or technical users in requirements definition, solution design, testing, training, and communications/rollout.\n\nCHARACTERISTIC DUTIES AND RESPONSIBILITIES:\n• Facilitate demand intake/review and application assessment processes.\n• Liaise between business and academic stakeholders and TCIT; facilitate cross-functional design and requirements processes.\n• Understand peer departments' business needs and strategic plans for growth.\n• Analyze technical systems, interfaces, and processes to optimize solution design.\n• Perform research using available data and industry information to support decision making and identify technological solutions for business needs.\n• Document requirements and functional specifications.\n• Structure application and interface testing efforts.\n• Prepare training materials and communications to support initiative rollout and strategic alignment.\n\nMinimum Qualifications:\n• 2-5 years experience in business analysis or product/application management.\n• Excellent problem-solving skills.\n• Analytical mindset.\n• Exceptional interpersonal skills and ability to present information to different audiences.\n• Excellent written and verbal communication skills.\n• Attention to detail.\n• Excellent planning, organizational, and time management skills.\n• Experience with requirements documentation, building detailed reports, and presentation design.\n• Interest in IT applications and solutions research.\n\nSalary Range:\n\n$72,000 - $90,000\n\nCompetitive Compensation and Benefits\n\nThe salary range reflects the College's good faith and reasonable estimate of the compensation for the position at the time of the job posting. Salary decisions are dependent on several factors including but not limited to market and organizational considerations, experience, and qualifications of a selected candidate as well as internal and external equity.\n\nOur benefits contribute significantly to the total compensation package that includes medical, dental, vision, and supplemental insurance plans; flexible and hybrid work schedules; tuition remission; life insurance; short and long-term disability insurance; an exceptional employer retirement matching program; health savings accounts (HSA), flexible spending accounts (FSA), Public Service Loan Forgiveness eligibility, and a robust Employee Assistance Program (EAP).\n\nIf you would like to request any disability related accommodations to complete the job application or to participate in the interview process, please email:oasid@tc.columbia.edu.\n\nHybrid/Remote\n\nTeachers College maintains a hybrid work environment, which provides employees with flexible work arrangements, while ensuring we preserve the important aspects of our unique in-person college-campus culture. Depending on role and business needs, colleagues will either work onsite or in a hybrid model (combination of in-office and virtual days). Employees are expected to live within a 150-mile radius of the College.\n\nWe will consider qualified candidates that reside beyond this radius based on the responsibilities and duties expected of the position. All qualified candidates are encouraged to apply.\n\nEqual Employment Opportunity\n\nTeachers College is committed to fostering a diverse and inclusive academic community and to providing equal opportunity in employment. All qualified applicants will receive consideration regardless of race, color, sex (including pregnancy, gender identity or gender expression), religion, creed, national origin, age, citizenship, disability, marital status, sexual orientation, veteran status, or any other legally protected status.\n\nAdvertised: Feb 21, 2023 Eastern Standard Time\nApplications close:\n\nBack to search results Apply now Refer a friend", "occupation": "business analyze"}, {"title": "Business Analyst", "company": "Garnet River", "location": "United States", "via": "via LinkedIn", "time": "7 days ago", "type": "Full-time and Contractor", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/business-analyst-at-garnet-river-3761906230?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Garnet River® is a full-service information technology company that customizes solutions for its clients. We solve challenges through staff augmentation, project-based teams and technical solutions. Our staffing division works as a recruiting arm for companies in the region and across the country. Clients turn to us to help them find professional talent.\n\nWe are currently seeking a Business... Analyst who will help client stakeholders identify a grants and scholarship management solution that will maximize the value delivered by the application development team. The business analyst will investigate business systems, elements of the organization structure, and document requirements using industry standard techniques. This position requires an onsite presence in Albany, New York. The office currently supports a hybrid work model but full-time onsite may be required later.\n\nAnnual salary range for this position is $85,000 - $130,000.\n\nJob Duties\n• Analyze existing system documentation and related artifacts to elicit detailed requirements.\n• Analyze and understand as-is business processes and systems sufficiently to establish to-be workflows and designs.\n• Liaise with relevant stakeholders, including subject matter experts (SMEs), executive teams, managers, program directors, and end users to meet the business needs of the project.\n• Conduct requirements gathering, validation, and rationalization processes.\n• Collaborate with the team on requirements definition to confirm that system requirements align with state and federal standards and strategy.\n• Evaluate project timelines and priorities.\n• Adhere to internal controls, guidelines, and procedures pertaining to the systems development life cycle.\n• Provide guidance to application development resource(s), through product backlogs, user stories, roadmaps, sprint plans, and related artifacts.\n• Ensure application development resource(s) understand the features and enhancements that need to be developed and deployed to meet the business needs of the project.\n• Support software validation through user acceptance and similar test strategies.\n• Develop test scenarios and test cases for system, integration and UAT using requirements, process flows and use cases/user stories. Test system functionality and document test result\n• Assist with change control and release planning for system bug fixes, enhancements and upgrades\n• Participate in data migration planning, analysis, and cleansing, working closely with DBA’s, vendor and Business owners.\n• Provide project management support as needed.\n\nRequired Qualifications\n• Bachelor’s Degree in Math, Sciences, Engineering, or Computer Science preferred.\n• 5 years of relevant experience\n• 60 months+ experience in performing requirements gathering and business analysis, producing written documentation of requirements; system design and implementation.\n• 60 months+ of requirements elicitation and documentation with participants.\n• 36 months+ working experience performing application testing, developing and executing written test scripts, documenting, tracking, communicating, and reporting defects utilizing testing tools such as Jira, quality center, or rationale.\n• 60 months+ of experience in developing business requirements by translating the needs, expectations, constraints and interfaces into a format understandable to both clients and technologists, using various methods (e.g., brainstorming, document analysis, facilitated meetings, focus groups, interface analysis, interviews, observation, prototyping, requirements workshops, reverse engineering, survey questionnaire by asking the right questions to surface essential requirements information).\n• 60 months+ experience working to establish criteria for evaluation and acceptance of requirements, manage requirements scope, obtains commitment to the requirements from the project participants. Identifies project work and requirements inconsistencies during defect / requirements management and communication.\n• 60 months+ of experience in requirement analysis and validation, analyzes requirements to ensure that they are complete, feasible, realizable and verifiable. Provide the capability to identify key requirements that have a strong influence on cost, schedule, functionality, risk or performance.\n• 60 months+ of experience to analyzes requirements and represent the requirements textually as well as via visual models or graphical form, in order to communicate the requirements effectively to the required audience.\n\nAt Garnet River, we care about our employees. We strongly believe in work/family balance. Our robust employee benefits package includes a competitive salary, PTO and health insurance (including dental and vision.\n\nGarnet River LLC is an Equal Employment opportunity/Affirmative Action (EEO/AA) employer. Minorities/Female/Disabled/Veteran (M/F/D/V", "occupation": "business analyze"}, {"title": "Operations and Analytics Associate", "company": "SquarePeg Hires", "location": "New York, NY, USA", "via": "via SquarePeg", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.squarepeghires.com/jobs/p9l25p/operations-and-analytics-associate?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.linkedin.com/jobs/view/operations-analytics-associate-at-tangerine-search-inc-3718264618?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.talent.com/view?id=aaff169e566d&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.bebee.com/job/20231028-37867bcbbed3874848ca50b90880bd60?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://salutemyjob.com/jobs/operations-analytics-associate-new-york/1158910049-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.levels.fyi/jobs?jobId=125929871441306310&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.wane.com/jobs/operations-analytics-associate-new-york/1158910049-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.khon2.com/jobs/operations-analytics-associate-new-york/1158910049-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Are you a driven and dynamic individual seeking an exciting opportunity to contribute to a thriving nationwide mobility marketplace? As an Operations & Analytics Associate, you will play a pivotal role in enhancing the growth and success of our platform. Your primary responsibility will be to strategize and execute initiatives aimed at enhancing engagement and user satisfaction.\n\nKey... Responsibilities:\n\nMarketplace Analysis: Conduct in-depth analysis of user behavior, preferences, and market trends to identify opportunities and issues.\n\nCampaign Planning and Execution: Develop and execute marketing campaigns and promotional activities to attract and engage users, collaborating closely with the marketing and creative teams.\n\nPricing Strategies: Analyze pricing structures and recommend adjustments based on demand patterns and market dynamics.\n\nData-Driven Decision Making: Utilize data analytics to make informed decisions, track performance, and optimize strategies accordingly.\n\nCross-Functional Collaboration: Collaborate with various teams, including product, engineering, marketing, and customer support, to align initiatives with broader company goals. Monitor and Report: Track key performance indicators (KPIs) and prepare regular reports for management to measure the success and impact of initiatives. Stay Updated: Keep abreast of industry trends, competitor activities, and regulatory changes that may affect market dynamics.\n\nQualifications:\n\nBachelor's degree Proven experience in operations or business analysis roles Strong analytical skills and proficiency in data analysis tools and Excel. Excellent communication and collaboration skills to work effectively across teams. Ability to thrive in a fast-paced, dynamic environment and adapt to changing priorities. Passion for the mobility industry and a genuine interest in understanding user behaviors.\n\nAs part of our Operations & Analytics team, you will play a crucial role at the intersection of technology and user experience. Serving as a local point of contact for our operations, you will take ownership of city-specific business outcomes and effectively connect our overall business strategy with market objectives. Your primary responsibility will be to champion and enhance the core product experience within our cities.\n\nWe need someone who possesses a mix of hands-on, process-driven, and detail-oriented expertise, coupled with an entrepreneurial spirit that's always ready to take on challenges and dive into the heart of the action. Being a data-driven decision-maker is key to your success, as you will be instrumental in using analytics to optimize processes and maximize efficiency.\n\nKey Responsibilities:\n• Spearhead the end-to-end management of user programs, encompassing various aspects of mobility.\n• Devise and execute a growth funnel strategy, in collaboration with Marketing, Product, and Data teams, to attract, onboard, activate, and retain users within our network.\n• Utilize data-driven insights to create and execute user-focused initiatives.\n• Champion the voice of the user, leading the identification and resolution of top user pain points.\n• Act as a bridge between product/engineering teams, providing valuable insights on product/process requirements and offering feedback on new features and operational processes.\n• Take ownership of successful partnerships with various stakeholders, ensuring adherence to internal KPIs and partner SLAs.\n• Establish strong partnerships with regional market owners, supporting the localized implementation of programs and problem-solving efforts.\nResponsibilities\n• Spearhead the end-to-end management of user programs, encompassing various aspects of mobility.\n• Devise and execute a growth funnel strategy, in collaboration with Marketing, Product, and Data teams, to attract, onboard, activate, and retain users within our network.\n• Utilize data-driven insights to create and execute user-focused initiatives.\n• Champion the voice of the user, leading the identification and resolution of top user pain points.\n• Act as a bridge between product/engineering teams, providing valuable insights on product/process requirements and offering feedback on new features and operational processes.\n• Take ownership of successful partnerships with various stakeholders, ensuring adherence to internal KPIs and partner SLAs.\n• Establish strong partnerships with regional market owners, supporting the localized implementation of programs and problem-solving efforts.\nRequirements\n• Bachelor's degree Proven experience in operations or business analysis roles Strong analytical skills and proficiency in data analysis tools and Excel. Excellent communication and collaboration skills to work effectively across teams. Ability to thrive in a fast-paced, dynamic environment and adapt to changing priorities. Passion for the mobility industry and a genuine interest in understanding user behaviors.\n• As part of our Operations & Analytics team, you will play a crucial role at the intersection of technology and user experience. Serving as a local point of contact for our operations, you will take ownership of city-specific business outcomes and effectively connect our overall business strategy with market objectives. Your primary responsibility will be to champion and enhance the core product experience within our cities.\n• We need someone who possesses a mix of hands-on, process-driven, and detail-oriented expertise, coupled with an entrepreneurial spirit that's always ready to take on challenges and dive into the heart of the action. Being a data-driven decision-maker is key to your success, as you will be instrumental in using analytics to optimize processes and maximize efficiency.\n• Minimum of 3 years of relevant experience in strategy, business operations, consulting, mobility, or a related field.\n• Proven experience in managing and optimizing recruitment, onboarding, and retention processes. Proficiency in data analysis and using insights to make data-driven decisions for user strategies and initiatives.\n• Excellent communication and interpersonal skills to build and maintain strong relationships with teams and stakeholders.\n• Ability to create and implement user engagement programs and incentives.\n• Problem-solving and decision-making skills to address user concerns and issues promptly and effectively.\n• Strong organizational skills to manage documentation, compliance, and performance evaluations.\n• Experience in collaborating with cross-functional teams to align operations with overall company objectives.\n• Ability to adapt to a fast-paced and dynamic environment, handling multiple tasks and priorities simultaneously.\n• Proactive mindset in identifying opportunities for process improvement and implementing operational efficiencies.\n• Passion for providing exceptional service and support to users.\nAdditional information\n• Ideal backgrounds include: Rideshare (lyft/uber), bike share (citi bike, bird), or dual-sided marketplace (etsy, thumbtack) companies\n• MUST BE work authorized (can not transfer or sponsor any visas)\n• Office is in Long Island City, Queens, NYC - must commute into the office ~4 days a week. 1 or maybe 2 days work from home\n• Strong in Excel, ideally also in SQL/Looker/Tableau/etc\n• MUST BE able to tell the story / executivei summary not just present the data to Directors, VPs, Founders.\n• MUST BE versed working cross functionally with: Marketing, Leadership, Customer support, etc", "occupation": "business analyze"}, {"title": "Data Analyst", "company": "William W. Pro Staff", "location": "New York, NY, USA", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.com/job/5T6Xf2_Ad8VO-Ku-Yo_eDHZa72i_L3dLDLxzmEvuj0tr62E96ck9GQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ny.tarta.ai/j/AzKitosBcRajQcTjYqNp1123-data-analyst-in-new-york-new-york-at-william-w-pro-staff?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "About the Position\n\nWilliam W. Pro Staff is looking for a Business Analyst to join our client's team in New York, NY. The Business Analyst will be responsible for providing support to our clients and partners by analyzing business trends, identifying opportunities for improvement, and recommending solutions...\n\nJob Description\n\nThe Business Analyst will play a key role in the successful implementation of the company project by contributing significantly to information gathered regarding existing business processes across legacy systems and analyzing how the existing functionality should be configured in the new system while ensuring no adverse impact to business operations. This analyst will also be responsible for coordinating with key stakeholder groups, gathering information and requirements from these groups, and being an advocate for this new platform.\n\nTasks:\n• Lead company effort to gather documentation and detailed requirements related existing business processes across legacy solutions\n• Translate problem statements and solution hypotheses into requirements, user stories, and customer journeys\n• Evaluate business processes to uncover areas for improvement and work with SI to optimally implement processes in the new solution\n• Articulate company needs in discovery sessions with the SI and support mapping out overall processes\n• Review and validate SI developed requirements for the system with company stakeholders and work with the SI to define how these requirements will be implemented in the new solution –coordinating with company business and technical SMEs as needed\n• Provide guidance on the prioritization of company requirements\n• During build phases – ensure the developed solution meets business needs and requirements by participating in quality assurance activities and facilitating co decision-making within regarding requirements configuration in the new platform through analyses and recommendations\n• Facilitate and perform User Acceptance Testing. Support analysis of testing results and prioritization of corrections\n• Consistently review and evaluate requests from stakeholders, performs research and analysis to understand the request and potential implementation impacts, and prioritizes based on urgency.\n• Prepare meetings with stakeholders with relevant agenda items and questions regarding requirements.\n• Analyze existing requirements and identifies any missing or weak requirements that need additional follow-up and analysis with IT teams and stakeholders.\n• Prepare demonstrations as needed to explain various configuration options to stakeholders\n\nAssociated deliverables:\n• Business requirements, user stories, and customer journey maps\n• As-is and To-be Process maps\n• Product backlog refinement and prioritization\n• Options Analyses and Recommendations\n• Stakeholder feedback\n• Presentations\n\nRequired Skills for Business Analyst\n• 6+ years of business analysis, data analysis, and/or project management experience on information technology projects, including but not limited to software development, network, security, and/or information systems projects.\n• Experience documenting business requirements, user stories, and acceptance criteria\n• Excellent interpersonal skills including, collaborating, team building, facilitation skills, negotiation skills, and conflict resolution skills\n• Exceptionally detail-oriented; able to analyze requirements and think outside the box to develop innovative solutions to meet business needs\n• Strong analytical, planning, and organizational skills\n• Excellent oral and written communication skills when interacting with both business and IT individuals at all levels\n• Knowledge of Agile principles and values and experience participating in or leading agile/scrum projects\n• Proficiency in Microsoft Office (Project, Excel, PowerPoint, and Word), SharePoint\n\nPreferred Skills\n\nProfessional/Certified Scrum Master or Certified Scrum Product Owner certification\n\nJob Types: Contract, Temporary\n\nSalary: $50.00 - $65.00 per hour\n\nJob Types: Contract, Temporary\n\nPay: $50.00 - $65.00 per hour\n\nBenefits:\n• 401(k)\n• Dental insurance\n• Health insurance\n\nExperience level:\n• 7 years\n\nSchedule:\n• 8 hour shift\n• Day shift\n• Monday to Friday\n\nAbility to commute/relocate:\n• New York, NY: Reliably commute or planning to relocate before starting work (Required)\n\nEducation:\n• Bachelor's (Preferred)\n\nExperience:\n• SQL: 1 year (Preferred)\n• Business Analyst: 6 years (Preferred)\n• data analysis: 7 years (Preferred)\n\nWork Location: In person", "occupation": "business analyze"}, {"title": "Business Analyst", "company": "Phaxis", "location": "New York, NY, USA", "via": "via LinkedIn", "type": "Contractor", "time": "none", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/business-analyst-at-phaxis-3733026498?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.simplyhired.com/job/bspRcLEc3MDrBshcdGBqQB6MRtMBG74Wmnc28AcoQ4091s3Xl-MEyA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.talent.com/view?id=04a4f30efb53&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Pay rate is $45 to $55 per hour\n\n100% remote position...\n\nMust Have Qualifications\n• Business Analysis\n• Gather and document business requirements from stakeholders\n• Familiarity with Agile and Waterfall methodologies\n• SDLC experience as a Business Analyst\n• Property and Casualty Insurance (P&C) industry experience\n\nDay-to-Day Responsibilities\n• Collaborate with stakeholders to elicit, analyze, and document detailed business requirements\n• Apply in-depth knowledge of Software Development Life Cycle (SDLC) methodologies\n• Document business requirements, user stories and process flows", "occupation": "business analyze"}, {"title": "Business Analysis Manager - Full-time / Part-time", "company": "Leukemia & Lymphoma Society", "location": "Port Chester, NY, USA", "via": "via Snagajob", "time": "2 days ago", "type": "Full-time and Part-time", "salary": "none", "links": ["https://www.snagajob.com/jobs/883374023?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "How many people can answer the question, \"What do you do for a living?\" with the answer, \"I help find cures for cancer.\" At LLS, employees take our mission seriously. Whether you work in one of our chapters, are an accountant at the national office or a specialist in our Information Resource Center, you work each day on making our mission a reality: Cure leukemia, lymphoma, Hodgkin's disease and... myeloma, and improve the quality of life of patients and their families. Join us and give new meaning to the word, \"job.\"\n\nAs the Business Analysis Manager at LLS, you will play a key leadership role responsible for overseeing a team of business analysts within the organization. This role plays a crucial part in facilitating the alignment of business processes, requirements, and strategies. The manager is tasked with guiding and supporting the business analyst team to drive business improvement and innovation. The Business Analysis Manager plays a pivotal role in driving the success of an organization by ensuring that business processes and strategies are effectively aligned with the goals and objectives of the company. This position requires a combination of technical expertise, leadership skills, and a deep understanding of business operations.\n\nAs a valued member of LLS, you are eligible for a comprehensive benefits package. Our offerings include medical, dental, and vision insurance; life insurance; flexible spending accounts; a 403b retirement plan along with generous paid time off. In addition, we observe federal paid holidays throughout the year, and offer a wellness program and an employee assistance pro\n\nWhile employees may be permitted to work remotely, travel to the assigned office, HUB or Satellite Offices may be required as determined by the employee's manager and the employee's Strategic Talent Partner.\n\nKey Responsibilities:\n• Team Leadership: Foster a collaborative and motivated work environment in addition to providing guidance and support to a team of business analysts.\n• Requirements Gathering: Collaborate with stakeholders to gather and document detailed business requirements for various projects and initiatives.\n• Data Analysis: Analyze data sets to identify trends, patterns, and insights that can inform business decisions and drive process improvements.\n• Process Mapping: Create process maps and workflows to visualize current and future business processes, highlighting areas for optimization.\n• Documentation: Prepare clear and concise business requirement documents, use cases, and user stories to guide development teams.\n• Stakeholder Communication: Facilitate effective communication between business and technical teams, ensuring alignment throughout project lifecycles.\n• Testing and Validation: Develop test plans, test cases, and participate in user acceptance testing to ensure solutions meet business requirements.\n• Risk Assessment: Identify and assess potential risks and issues related to projects and propose mitigation strategies.\n• Reporting and Metrics: Develop and maintain key performance indicators (KPIs) and dashboards to track project progress and business performance.\n• Continuous Improvement: Collaborate with teams to identify opportunities for process improvement and automation, making data-driven recommendations.\n• Process Development: Leverage experience to co-create foundational processes needed for Enterprise Business Architecture teams to scale and grow.\n• Perform other related duties as assigned.\n\nBasic Qualifications:\n• Minimum 10 years Business Analyst experience within the nonprofit industry and/or consulting space.\n• Strong leadership and project management skills.\n• Strong analytical and problem-solving skills to gather and interpret data, identify trends, and make informed recommendations.\n• Excellent written and verbal communication skills to effectively convey complex information to both technical and non-technical stakeholders.\n• Solid technical background with understanding and/or hands-on experience in software development and workflow processing including Agile and Waterfall Project Management methodologies.\n• Strong interpersonal skills to collaborate effectively with cross-functional teams and build relationships with stakeholders.\n• The ability to adapt to changing priorities, technologies, and business processes.\n\n#LI-Remote\n\nPhysical Demands & Work Environment:\n• Physical demands are minimal and typical of similar jobs in comparable organizations.\n• Work environment is representative and typical of similar jobs in comparable organizations.\n• Weekend & evening work required may be required at times.\n• Occasional travel may be required.\n• Average salary range is $77,000-$111,000. Open to further discussion based on geography.\n\nLLS is an equal employment opportunity employer committed to diversity and inclusion in its workplace. All qualified applicants will receive consideration for employment without regard to sex, gender, gender identity and expression (including transgender status), sexual orientation, pregnancy, age, race, color, creed, national origin/ancestry, citizenship, religion, genetic predisposition or information, physical or veteran status, or any other characteristic protected by law. LLS seeks such skilled and qualified individuals to share our mission and where they will join a cohort of others who have chosen to call LLS home. LLS complies with all applicable laws which prohibit discrimination and harassment in the workplace, and is committed to maintaining a diverse and inclusive environment supportive of all of our employees and the communities we serve", "occupation": "business analyze"}, {"title": "Specialist", "company": "LTIMindtree", "location": "Jersey City, NJ, USA", "via": "via Talent.com", "time": "3 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.talent.com/view?id=858aba760616&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://new-jersey.tarta.ai/j/o0wcdYoBcRajQcTjIE5M0823-specialist-in-jersey-city-new-jersey-at-ltimindtree?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Overall experience of about 7+ plus years\n\nStrong hold in Capital Markets / Investment banking ...\n\nData experience of about 5plus years in SQL ( basics + joins + sub queries ). Hands on experience in assessing feeds (upstream / downstream), analyzing data outliers, data management etc\n\nStrong documentation skills - ability to capture the requirements, use cases, testing scenarios elaborately and vividly as possible with clear mention of acceptance criteria, entry / exit strategies, identifying risks etc\n\nAbility to run the scrum calls as scrum master.\n\nHands on JIRA experience creating / managing stories , Story lifecycle management , Kanban board experience\n\nTo be able to multi task effectively\n\nAble to co-ordinate with Business users and write the BRD / FRD for the requirements.\n\nAble to understand the technicalities of the financial applications.\n\nCandidate to possess good communication and people handling skills.\n\nThe associate needs to pass the specific certification based on the skill set if needed.\n\nCertification required\n\nIIBA - Agile Analysis Certification\n\nNearest Major Market : New York City\n\nNearest Secondary Market : Newark\n\nLast updated : 2023-11-14", "occupation": "business analyze"}, {"title": "Business Analyst", "company": "Eclaro", "location": "New York, NY, USA", "via": "via LinkedIn", "time": "29 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/business-analyst-at-eclaro-3762199044?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.bebee.com/job/20231028-2ee43fe141fed88443a2b508e85fa987?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.careerbuilder.com/job/J3Q3836GWLFD5PXCGGK?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.careers-eclaro.com/job/976/business_analyst?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.jobrapido.com/jobpreview/2956613850?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.jobilize.com/job/us-ny-new-york-business-analyst-eclaro-hiring-now-job-immediately?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Number: 22-06722\n\nBank on a company that will help you reach your career goals. Eclaro is looking for a Business Analyst for our client in NYC, NY...\n\nEclaro’s client is one of the largest banking firms in the world, specializing in personal and commercial banking, wealth management and security and trade solutions. If you’re up to the challenge, take a chance at this rewarding opportunity!\n\nQualifications:\n• 10-15 years of relevant experience\n• Experience managing across multi-function and/or global business\n• Functional experience in marketing, credit, acquisitions, product development, or analytics\n• Bachelor's degree/University degree or equivalent experience\n• Master's degree preferred\n• Expertise on Data, Regulatory & Capital Markets with excellent communication and presentation skills\n• Expert in executing Data and regulatory firm wide programs by coordinating with cross asset classes\n• Experienced in defining, analyzing and implementing Governance of Data Quality and controls\n\nRequired Skills:\n• Ability to work under pressure and manage deadlines or unexpected changes in expectations\n• or requirements\n• Ability to work unsupervised and adjust priorities quickly as circumstances dictate\n• Consistently demonstrates clear and concise written and verbal communication\n• Demonstrated analytical skills\n• Demonstrated problem-solving and decision-making skills\n• Consistently demonstrates clear and concise written and verbal communication\n• Ability to work in a team-oriented environment\n• Skilled in program and stakeholder management - prepared program trackers & project plans, Decks and running the working group for market wide regulatory strategic implementations, system retirements and User/Data onboarding implementations.\n• Adept in providing senior management status updates, as well as Identification, Prioritization and escalation of risks and issues to technology management and proposing risk mitigations (Path to Green) in Agile environment.\n• Command over analyzing Business requirements, specifications and articulation of technical requirements, flow diagrams, use cases, Test strategies, and execution on large scale initiatives in offshore onshore model and across the asset classes by acting as a bridge between technology teams and Stakeholders.\n• Deep understanding of OTC Derivative products\n• Highly adept at developing and implementation of Test plans, test strategies, best practices and QA methodologies to support development and release large scale business critical applications in an onsite/off shore model.\n\nSalary: $160k - $170k/yr.\n\nIf interested, you may contact:\n\nHeckle Tulab\n\nheckle.tulab@eclaro.com\n\n2128047460\n\nHeckle Tulab | LinkedIn\n\nEqual Opportunity Employer: Eclaro values diversity and does not discriminate based on Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status", "occupation": "business analyze"}, {"title": "Manager, Global Development Solutions, Business Analysis", "company": "Regeneron Pharmaceuticals Inc.", "location": "Bernards, NJ, USA (+1 other)", "via": "via Regeneron Careers - Regeneron Pharmaceuticals", "time": "1 day ago", "type": "Full-time", "salary": "none", "links": ["https://careers.regeneron.com/en/jobs/r27726/manager-global-development-solutions-business-analysis/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.linkedin.com/jobs/view/manager-global-development-solutions-business-analysis-at-regeneron-3765042678?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.indeed.com/viewjob?jk=0fff277341e46fff&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "This is a hybrid role which requires the candidate to work on-site 2-3 days per week and the other days from home. Fully remote work is not an option for this position. For eligible candidates, we offer a rich relocation package.\n\nThe Business Analysis Manager will drive consistency across the Global Development Solutions (GDS) team & community. This position is responsible for setting standards... in the way GDS operates & supports Global Development domains including processes, templates & tools.\nIn a typical day you will:\n• Drive consistency across internal processes & requirements\n• Develop templates & guidance covering process aspects (e.g., deliverables, requirements, testing, metrics) for GDS team members & vendors to reference\n• Develop frameworks to gather accurate, measurable requirements that decide project outcomes\n• Create flexible process & framework documentation in support of traditional (e.g., waterfall) and hybrid (e.g., agile) delivery methods\n• Collect GDS operational metrics, analyze, identify & develop action plans for areas of improvement\n• Raise issues or risks, & bring together operating updates to GDS leadership\n• Partner across GDS teams (e.g., Delivery & Operations Product Owners, Project Managers, Solutions Architects, Validation Leads) and vendors to continuously improve ways of working\n• Collaborate with GDS partners such as Enterprise IT & Development Operations and Portfolio Management teams on processes, requirements & tools\nThis job may be for you if you have:\n• Strong business acumen & analysis experience\n• Project management experience including vendor management\n• Demonstrate an analytical and objective\n• Passion for leading change & continuous improvement\n• Self-starter & ability to work in ambiguity – structure, tackle & implement with minimal oversight\n• A track record of successful, on time and on budget delivery of projects\n• Familiarity with commercial Project and Portfolio Management (PPM) tools and reports\n• Experience with Waterfall/Hybrid/Agile project methodologies\n• Expertise in business analysis frameworks, requirement management, and user acceptance testing documentation\n\nTo be considered you must have a Bachelor's degree and 7+ years of related industry work experience.\n\n#GDDOPMJOBS\n\n#LI-Hybrid\n\nDoes this sound like you? Apply now to take your first steps toward living the Regeneron Way! We have an inclusive and diverse culture that provides comprehensive benefits including health and wellness programs, fitness centers and equity awards, annual bonuses, and paid time off for eligible employees at all levels!\nRegeneron is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion or belief (or lack thereof), sex, nationality, national or ethnic origin, civil status, age, citizenship status, membership of the Traveler community, sexual orientation, disability, genetic information, familial status, marital or registered civil partnership status, pregnancy or parental status, gender identity, gender reassignment, military or veteran status, or any other protected characteristic in accordance with applicable laws and regulations. We will ensure that individuals with disabilities are provided reasonable accommodations to participate in the job application process. Please contact us to discuss any accommodations you think you may need.\nThe salary ranges provided are shown in accordance with U.S. law and apply to U.S. based positions, where the hired candidate will be located in the U.S. If you are outside the U.S, please speak with your recruiter about salaries and benefits in your location.\n\nSalary Range (annually)\n\n$110,900.00 - $181,100.00", "occupation": "business analyze"}, {"title": "Associate Director, Business Analytics & Measurement", "company": "Wavemaker", "location": "New York, NY, USA", "via": "via LinkedIn", "time": "15 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/associate-director-business-analytics-measurement-at-wavemaker-3732082618?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.ziprecruiter.com/c/Wavemaker/Job/Senior-Associate,-Business-Analytics-&-Measurement/-in-New-York,NY?jid=fa13a8e830c7a3bb&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.indeed.com/viewjob?jk=017843147a17bc37&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.talent.com/view?id=14b6a6222fb7&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.adzuna.com/details/4370838192?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.glassdoor.com/job-listing/associate-director-business-analytics-and-measurement-wavemaker-JV_IC1132348_KO0,53_KE54,63.htm?jl=1008844409087&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.careerbuilder.com/job/J3S3Q165TF84BRZKXL9?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.theladders.com/job/associate-director-business-analytics-and-measurement-groupm-new-york-ny_65385132?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Role Context\n\nWe are looking for an Associate Director, Business Analytics and Measurement who will deliver campaign analysis to understand the efficiency and effectiveness of audience-driven strategies as well as monitor, suggest optimizations and capture learnings to refine audience-driven strategies and deliver support business outcomes. You will also identify a measurement framework to... implement as well as solutions and measurement partners leading to measuring the impact of media investments.\n\nCore Responsibilities\n• Extract and organize data from a multitude of sources to feed business-improving insights (campaign performance, social listening, competitive analysis …) and optimize business outcomes\n• Build thoughtful presentations/reports to deliver the right performance narrative to clients\n• Partner with internal teams across all functions to learn the most efficient and effective way to extract value from data and develop a story telling approach grounded in client business reality and brand objectives\n• Provide optimization recommendation to clients to support the most efficient and effective channels, partners, and tactics\n• Identify gaps/requirements from a measurement standpoint\n\nRequired Skills / Experience\n• Bachelor’s degree in Marketing, Advertising, Economics, Computer Science, Information Systems, Business Analytics, or related field with 3 years of work experience in measurement and analytics strategy applicable to marketing and/or media,\n• Comprehensive understanding of media metrics (e.g., impression, CTR, CPM GRP, CPV etc.), Measurement analytics, Quantitative business measures (LTV, ROI, Effectiveness, etc.), Statistics (Correlations, sample sizing, t-value VIF etc.),\n• Strong familiarity with statistical/data mining concepts and methods (e.g., OLS, Logit, time Series, etc.); ability to program in SQL,\n• Experience working with measurement partners for brand lift, conversion lift, MMM and MTA (e.g., Millward Brown, Nielsen, Lucid, Dynata, Neustar … and others),\n• Experience with Google Campaign Manager, Double Verify, DMPs, DSPs, Google Analytics required,\n• Knowledge of Digital Media, Marketing/Advertising industries highly preferred - Agency experience is a plus,\n• Ability and comfort with presenting work by phone or within small groups\n• Strong speaking and written professional communication skills,\n• Strong analytical, critical thinking, and problem-solving skills,\n• Proficiency in Microsoft Office software such as Word, PowerPoint, and Excel (ability to work with macros, advanced formulas, pivot tables),\n• The ability to thrive in a fast-paced and deadline-driven environment,\n• Strategic Thinker & Doer,\n• Curious and excited to learn,\n• High sense of accountability and ownership,\n• Collaborative with a partnership mindset.\n\nAbout Wavemaker\n\nWe believe there always is a better way to grow. We positively provoke growth for our clients by reshaping consumer decision-making and experiences through media, content and technology. The Wavemaker way is globally consistent. Fueled by the world’s most powerful consumer data, we understand where and how marketing can intervene decisively to help brands win more sales.\n\nOur name is our mission and our method. To make waves, you need to be provocative, even fearless. We do our best work for brave brands and people who want to be challenged to go further and faster. We know it’s not easy, but if it’s in you, we will get it out of you.\n\nOur 7,600 People Across 90 Markets Provoke Growth For Some Of The World’s Leading Brands And Businesses. Our Attitude Of Positive Provocation Is Enabled By\n• deep knowledge we have of our clients’ business\n• confidence to challenge what’s gone before\n• the support to go further than we thought possible\n\nWe are a part of GroupM, WPP’s global media investment management company. Discover more on wavemakerglobal.com, Twitter and LinkedIn\n\nThe base salary for this position at the time of this posting may range from $75,000 to $180,000. Individual compensation varies based on job-related factors, including business needs, experience, level of responsibility and qualifications. We offer a competitive benefits package, please visit https://www.wpp.com/people/wellbeing/benefits-at-wpp-in-the-us for more details.\n\nGroupM and all its affiliates embrace and celebrate diversity, inclusivity, and equal opportunity. We are committed to building a team that represents a variety of backgrounds, perspectives, and skills. We are a worldwide media agency network that represents global clients. The more inclusive we are, the more great work we can create together.\n\nReference ID: oChbofwc", "occupation": "business analyze"}, {"title": "Product Data Analyst", "company": "Matal", "location": "New York, NY, USA", "via": "via OPTnation", "time": "22 days ago", "type": "Full-time, Part-time and Contractor", "salary": "none", "links": ["https://www.optnation.com/product-data-analyst-job-in-new-york-ny-view-jobid-35192?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Qualifications Master’s degree in Data Analytics Economics Engineering Computer Science Management Information Systems or Statistics. Strong technical capability in some of the coding languages to be hands-on if needed and able to provide guidance to the team on best coding practices code optimization data review for correctness and design data solutions. Training or experience in some or all of... data/coding languages/tools like SQL Python SAS Tableau Power BI or others Strong data or analytics background Ability to apply critical thinking and problem-solving skills in all phases of product initiative life cycle from inception through implementation and beyond. Experience analyzing complex data to support development of clear narratives and presentations. Experience working in large data environments. Experience working with financial services data or related data. Ability to operate in agile environment and deliver. Ability to understand the business needs and translate them into data needs and solutions. Business acumen able to offer an additive perspective to partners as it defines and executes business strategies.\n\nKey Skills One or more years of experience in business analysis systems analysis or similar roles. Ability to conduct product analysis", "occupation": "business analyze"}, {"title": "Equity Finance: Post-Trade Business Analyst", "company": "Citi", "location": "New York, NY, USA", "via": "via Jobs And Careers At Citi", "time": "7 days ago", "type": "Full-time", "salary": "none", "links": ["https://jobs.citi.com/job/new-york/equity-finance-post-trade-business-analyst/287/54936109904?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.citi.cn/%E5%B7%A5%E4%BD%9C/-/equity-finance-post-trade-business-analyst/287/54936109904?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://carreira.citi.com.pt/vaga/nova-iorque/equity-finance-post-trade-business-analyst/287/54936109904?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.ziprecruiter.com/c/Citigroup,-Inc./Job/Equity-Finance:-Post-Trade-Business-Analyst/-in-New-York,NY?jid=e17a2b98a1f6b25b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.linkedin.com/jobs/view/equity-finance-post-trade-business-analyst-at-citi-3727344525?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.citi.tw/%E5%B7%A5%E4%BD%9C/-/equity-finance-post-trade-business-analyst/287/54936109904?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://empleos.citi.es/trabajo/nueva-york/equity-finance-post-trade-business-analyst/287/54936109904?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.salary.com/job/citi/equity-finance-post-trade-business-analyst/j202309261935581284406?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "The Equity Finance Technology team are seeking an experienced Business Analyst to support projects and work efforts within the Prime Finance business for Post Trade Securities Lending. The role requires facing off to senior stakeholders globally and liaising with technologists to exchange information in a concise, logical, and understandable way. The successful candidate must be able to manage... overall delivery whilst adopting an agile methodology and managing project timelines, risks and budget.\n\nResponsibilities:\n• Provide input during development and implementation phases, including formulation and definition of systems scope, objectives and necessary system enhancements for complex, high-impact projects\n• Identify and communicate risks and impacts and propose risk mitigation options, considering business implications of the application of technology to the current business environment\n• Consult with business clients to determine system functional specifications and partner with multiple management teams and other units to meet organizational objectives\n• Evaluate new IT developments and evolving business requirements and recommend appropriate systems alternatives and/or enhancements to current systems by analyzing business processes, systems and industry standards\n• Provide in-depth and sophisticated analyses with interpretive thinking to define problems, develop innovative solutions and influence strategic functional decisions\n• Supervise day-to-day staff management issues, including resource management, work allocation, mentoring/coaching and other duties and functions as assigned\n• Appropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.\n\nQualifications:\n• 6-10 years of experience\n• Proficiency in MS Office (Word, Excel, Visio, PowerPoint) with extensive experience using Excel for data analysis\n• Experience with all phases of Software Development Life Cycle\n• Comprehensive knowledge of the principles of business analysis\n\nEducation:\n• Bachelor's degree/University degree or equivalent experience\n• Master's degree preferred\n\n-------------------------------------------------\n\nJob Family Group:\nTechnology\n\n-------------------------------------------------\n\nJob Family:\nBusiness Analysis / Client Services\n\n------------------------------------------------------\n\nTime Type:\nFull time\n\n------------------------------------------------------\n\nPrimary Location:\nNew York New York United States\n\n------------------------------------------------------\n\nPrimary Location Salary Range:\n$129,840.00 - $194,760.00\n\n------------------------------------------------------\n\nCiti is an equal opportunity and affirmative action employer.\n\nQualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nCitigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.\n\nView the \"EEO is the Law\" poster. View the EEO is the Law Supplement.\n\nView the EEO Policy Statement.\n\nView the Pay Transparency Posting", "occupation": "business analyze"}, {"title": "Business Financial Analyst", "company": "Mini-Circuits", "location": "New York, NY, USA", "via": "via Jobvite", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://jobs.jobvite.com/mini-circuits/job/oksEofwy?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.ziprecruiter.com/c/Mini-Circuits/Job/Business-Financial-Analyst/-in-New-York,NY?jid=91ff764027883f4f&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Mini-Circuits designs, manufactures and distributes integrated circuits, modules, and sub-systems for high-performance radio frequency (RF) and microwave applications. With design, sales and manufacturing locations in over 30 countries, Mini-Circuits’ products are used in a range of wired and wireless communications applications. Our products are also used in detection, measurement and imaging... applications, including military communication, guidance and electronic countermeasure systems, commercial, scientific, military land, sea and aircraft; automotive systems, medical systems, and industrial test equipment.\n\nMini-Circuits’ sells its products to over 20,000 customers globally through our direct sales force, applications engineering staff, sales representatives, as well as through our extensive website.\n\nPosition Summary:\n\nThe Financial Business Analyst role is an intensive position that allows the employee to see across many different departments and entities at Mini-Circuits (MCL). You will work with people at all levels of MCL and learn how to navigate the corporate environment to understand how to provide Finance, Sales, and Engineering partners with the support they need to meet to better understand their business.\n\nYour primary responsibilities will be to support the Business Unit Financial Partner (BUFP), Director of Finance, and the Business Unit Cost Center Owners in performing analysis to better understand the current state of the business and improve the decision-making process and forecast quality.\n\nSalary Range: $76,000 - $114,000 per year\n\nJob Function:\n• Roles:\n• Support BUFP & collaborate with the Business Unit Leader, Engineering and Marketing teams.\n• Analyze sales and financial reports to derive trends.\n• Prepare monthly and quarterly Sales and financial presentations.\n• Tasks:\n• Business Analysis\n• Prepare and publish monthly and quarterly expense reports and analyses with a focus on goal achievement for each BU cost center owner.\n• Prepare, analyze, and publish monthly (KPIs) to identify causes of unexpected variances.\n• Assist in benchmarking financial KPI and ad-hoc analysis related to the current business.\n• Prepare variance analysis for sales, P&L, Headcount, and CapEx.\n• Prepare Gross margin analysis including impact from sales price variance, product mix, and volume.\n• Planning:\n• Assist the Cost Center Manager during the budgeting and forecasting cycle.\n• Assist Business unit Partners in meeting planning calendar deadlines.\n• Other:\n• Lead and support special projects, miscellaneous financial analysis, and other financial initiatives.\n\nQualifications:\n• Bachelor’s degree in finance or accounting.\n• 3 years of FP&A and 2-3 years of finance and accounting experience.\n• Strong MS Office skills, especially Excel (2 years of everyday experience).\n• Strong grasp of business finances.\n• Demonstrate good personal judgment, and effectively handle tasks under pressure.\n• Track records to develop strong relationships, influence thinking, and drive consensus among a wide range of stakeholders.\n• Excellent verbal and written communication skills needed Ability to operate comfortably, independently, and effectively in a fast-paced, highly cross-functional, rapidly changing environment.\n• Positive attitude and excitement to contribute and grow!\n• Familiarity with financial reporting and planning tools is strongly preferred.\n• Good analysis and problem-solving skills to address the differing issues presented by the customer as well as the business.\n• Discretion to deal with confidential information.\nPhysical Demands:\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee is regularly required to talk and hear. The employee frequently is required to stand, walk, sit, and use their hands to operate a computer keyboard. The employee is occasionally required to reach with hands and arms. The employee must occasionally lift and/or move up to 10 pounds. Specific vision abilities required by this job include close vision, and the ability to adjust focus. Reasonable accommodations may be made to enable individuals with disabilities to perform essential functions.\n\nAdditional Requirements/Skills:\n• Comply, understand, and support corporate safety initiatives to ensure a safe work environment.\n• Ability and willingness to abide by the Company’s Code of Conduct.\n• Occasional travel, some overnight, as required.\n\nDisclaimer: The listed qualifications and requirements for each position are intended as guidelines. Mini-Circuits reserves the right to hire outside of these guidelines at Management’s discretion.\nMini-Circuits is an Equal Opportunity Employer and does not discriminate on the basis of actual or perceived age, race, creed, color, national origin, sexual orientation, military status, sex, disability, predisposing genetic characteristics, marital status, familial status, gender identity, gender dysphoria, pregnancy-related condition, and domestic violence victim status or protected class characteristic, or any other protected characteristic as established by federal or state law", "occupation": "business analyze"}, {"title": "Business Analyst (Mid level)", "company": "Stellent IT", "location": "New York, NY, USA", "via": "via LinkedIn", "type": "Part-time", "time": "none", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/business-analyst-mid-level-at-stellent-it-3593512759?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Location is 52 Broadway, NYC. Onsite 5 days a week. Hours are 10am 6pm with 1 hour lunch Billable day is 7 hours.\n\nMust be Local candidate...\n\nTitle: Business Analyst (Mid level)\n\nObjectives\n• Drive awareness of requirements across business units and identify substandard systems processes through evaluation of real-time data\n• Serve as thought leader for technical business processes, developing systems prototypes that promote increased efficiency and productivity on multiple levels\n• Create and implement precise management plans for every project, with attention to transparent communication at all levels\n• Perform, evaluate, and communicate thorough quality assurance at every stage of systems development\n• Determine and develop user requirements for systems in production, to ensure maximum usability\n\nResponsibilities\n• Conduct meetings and gather requirements for projects and initiatives\n• Understand and document the current working process in detail (review, document and assess critical business processes)\n• Be analytical and detail oriented with the ability to multi-task and problem solve across multiple projects\n• Track the working process, evaluate its effectiveness, and capture lessons learned\n• Identify, communicate, and report significant deviations from known processes\n• Focus on driving measurable improvements by deploying process improvements to assigned problems\n• Partner with stakeholders across business units to develop analyses and documentation in a collaborative way, communicating effectively and efficiently with production, managerial, and executive teams\n\nRequired Skills And Qualifications\n• Bachelor's degree (or equivalent) in information technology or computer science\n• 3+ years relevant experience in analytics and systems development\n• Excellent communication skills, with an ability to translate data into actionable insights\n• Experience in generating process documentation and reports\n• Strong presentation skills\n• High proficiency with database queries (SQL, Showcase, Salesforce, SOQL or similar)\n\nPreferred Qualifications\n• Ability to create BPMN 2.0 models using LucidChart, or Visio\n• High proficiency in technical writing\n• Experience with Salesforce and/or iSeries is a plus", "occupation": "business analyze"}, {"title": "Technical Business Analyst (VP)", "company": "PRI Technology", "location": "New York, NY, USA", "via": "via LinkedIn", "time": "2 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/technical-business-analyst-vp-at-pri-technology-3750631329?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://salutemyjob.com/jobs/technical-business-analyst-avp-new-york/1148737046-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.khon2.com/jobs/technical-business-analyst-avp-new-york/1148737046-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.wearegreenbay.com/jobs/senior-technical-business-analyst-financial-industry-new-york/1156735983-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.wane.com/jobs/technical-business-analyst-avp-new-york/1148737046-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.mystateline.com/jobs/technical-business-analyst-avp-new-york/1148737046-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.wreg.com/jobs/technical-business-analyst-avp-new-york/1148737046-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.wavy.com/jobs/technical-business-analyst-avp-new-york/1148737046-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "I have a full time opportunity for a Technical Business Analyst to join one of our top tier investment organizations in Midtown Manhattan. The Technical Business Analyst will be responsible for helping to design, develop, and deploy business-facing technology solutions across the Firm. The role requires a solid understanding of business requirements documentation and software development... processes. This position will work closely with the business technology team in a highly collaborative manner to interface with the internal teams as well as key stakeholder groups.\n\nThis will be a hybrid opportunity, 3 days onsite, 2 days remote in Midtown.\n\nResponsibilities:\n• Be part of a business technology team responsible for owning and executing delivery of custom solutions that are uniquely tailored to the business' needs.\n• Engage with stakeholders at all levels to understand the business objectives and functional requirements necessary to perform their roles efficiently and effectively.\n• Elicit, capture and interpret business problems from multiple perspectives; present implications and recommendations with strategic perspective, influencing project parameters and outcomes.\n• Perform requirements gathering, solution design, functionality development, user acceptance testing, training, and deployment.\n• Develop requirements, write user stories, and design user interfaces of any new functionality that can be understood and built by the development team.\n• Understand the data model and architecture, and define data structures to enable new system functionality.\n• Evaluate the suitability of existing/potential tools to fulfill business needs.\n• Closely collaborate with Business Management, Information Technology, and outside vendors to develop and implement new applications and tools for use by the business.\n\nQualifications:\n• Strong knowledge of Business Analysis, Software Development, Project Management, and Data Management skillset.\n• Experience translating business needs into detailed technical specifications for application development.\n• High level understanding of code to collaborate with developers to design new solutions and provide support. First-hand knowledge of development is beneficial.\n• Familiar with data model management processes and best practices.\n• Experience with User Acceptance Testing and quality assurance.\n• Strong knowledge of software development and implementation/deployment lifecycle and best practices.\n• Excellent communication skills and demonstrated command of language, clarity of thought and orderliness of presentation.\n• Excellent organization and documentations skills, with the ability to design and facilitate a group process, elicit contributions, stimulate focused discussions and achieve a desired outcome; consensus builder.\n• Hands-on experience with on-premise and cloud-based enterprise systems; Knowledge of how to design, manage, and integrate these systems to support current and future business needs.\n• Successful candidates will be self-motivated with a strong desire to contribute to the success of the department and company.\n• Advisory investment banking technology relevant experience is a plus\n• Experience with Agile Development methodologies.\n• Bachelor's degree or Masters is preferred.\n\nLori Sklarski\n\nSenior Technical Recruiter\n\nPRI Technology\n\nP: 973.732.5454 x27\n\nC: 973.432.9968\n\nF: 973.732.5456\n\nLori.sklarski@pritechnology.com\n\nwww.pritechnology.com", "occupation": "business analyze"}, {"title": "Senior Manager - Business Analysis", "company": "Xoriant", "location": "Piscataway, NJ, USA", "via": "via LinkedIn", "time": "1 day ago", "type": "Contractor", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/senior-manager-business-analysis-at-xoriant-3766136776?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Location can be your interest Long Island City, NY or Bethpage, NY or Piscataway, NJ\n\nResponsibilities...\n• Supports the Business and Product Owners to define the business requirements at high-level using Jira Epics/Features from the customer lens with clear acceptance criteria and definition of “done”.\n• Partner closely with technology and cross-functional business teams to shape the product strategy, define and develop the vision, create a differentiated value proposition, and identify high-value growth scenarios that provide a catalyst for growth.\n• Partner closely with technology and cross-functional business teams to define the product development Capacity Management model. This includes tracking on bandwidth and capacity utilization through quarterly planning, prioritization, and impact/tradeoff analysis.\n• Support Business and Product Owners to build their Investment Justification (Business Case) for various product development projects and to track the post-launch benefit realized to measure the ROI attainment for every product development project.\n• Align with Business and Product Owners on the key performance indicators (KPI) for various business verticals and portfolios, and report on them through various information radiators (scorecards, dashboards, newsletters, … etc.)\n• Partner closely with technology and cross-functional business teams to estimate the Level Of Effort (LOE) for each product development project which supports the investment justification and capacity planning processes.\n• Provides guidance and coaching on tools to use to support the product development process and portfolio management (Clarity PPM, Jira, Power BI)\n\nSkills\n• 10+ years experience in the areas of Business Analysis, Portfolio Management, or Product Management preferably in telecommunications and technology domains\n• Expert in working in an Agile environment (Scrum, Kanban, SAFe, Tribes/Squads)\n• Experience with Customer Experience design methodologies such as Journey Mapping and A/B Testing along with CX metrics such as NPS and CSAT\n• Expert knowledge of business analysis tasks like analysis and documentation of business requirements and coordination of development efforts, maintaining knowledge of current tools, technology, and methodologies, executing data collection and interpretation, and providing analytical customer insights and advice\n• Experience in planning and prioritization of demand to support the organization\n• Excellent communication skills\n• Analytical mindset and ability to synthesize complex information, connect ideas with data and present in digestible, easy to understand format", "occupation": "business analyze"}, {"title": "Senior Specialist, Business/Tech. Analysis (Hybrid)", "company": "Merck", "location": "West Point, PA, USA (+1 other)", "via": "via Merck Careers", "time": "7 days ago", "type": "Full-time", "salary": "none", "links": ["https://jobs.merck.com/us/en/job/R267050/Senior-Specialist-Business-Tech-Analysis-Hybrid?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.ziprecruiter.com/c/Merck-&-Co.,-Inc./Job/Senior-Specialist,-Business-Tech.-Analysis-(Hybrid)/-in-West-Point,PA?jid=e12a548e9a5e515a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.linkedin.com/jobs/view/senior-specialist-business-tech-analysis-hybrid-at-merck-3762989301?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://hirelifescience.com/career/138547/Senior-Specialist-Business-Tech-Analysis-Hybrid-Pennsylvania-Pa-West-Point?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.indeed.com/viewjob?jk=0d68d44c7a49ed78&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.themuse.com/jobs/merck/senior-specialist-businesstech-analysis-hybrid-a81639?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.theladders.com/job/senior-specialist-business-tech-analysis-hybrid-merck-west-point-pa_65683719?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://getwork.com/details/856179e57cea7de09e5aaf5fda72c3a0?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Description\n\nOur IT team operates as a business partner proposing ideas and innovative solutions that enable new organizational capabilities. We collaborate internationally to deliver the services and solutions that help everyone to be more productive and enable innovation...\n\nThe Technical Analyst will be part of the Submission Authoring and Source Content Product Team working on content management solutions across regulatory IT in support of the Research and Development business area. Under the leadership of the product manager the incumbent will work closely with business partners to design and develop solutions for the defined business needs.\n\nKey tasks include:\n• Manage solution delivery of Vault Regulatory Information Management (VRIM) solutions across multiple configuration and Vendor releases.\n• Participate in software and systems design reviews to analyze regulatory processes and propose optimization of existing Veeva platform.\n• Oversee the product enhancements and defects and lead the weekly status meeting and compile a prioritized list of PE’s to send over to Veeva for annual analysis.\n• Provide technical review and approval assistance on all SDLC documentation for all VRIM releases (configuration + platform).\n• Organize priorities with integration team during bi-weekly integration status meetings.\n• Active member and/or participant on: CCB, weekly status meetings, Veeva CoP and weekend deployment activities.\n• Lead monthly meetings with the Veeva EAM.\n• Active participant in all VRIM configuration design reviews.\n• Working with the Robotic Process Automation (RPA) bot team to integrate with VRIM system to achieve process/technical efficiency.\n• Create and coordinate all Impact Assessment reviews for all of the Configuration releases.\n• Provide guidance to the AMS team during Veeva Platform releases.\n• Lead monthly meetings with Veeva EAM.\n• Primary point of contact with VRIM Veeva relationship and vendor management activities as capable.\n• Support the transition away from VRIM customizations.\n• Manage solution delivery of Vault Regulatory Information Management (VRIM) solutions across multiple configuration and Vendor releases\n• Participate in software and systems design reviews to analyze regulatory processes and propose optimization of existing Veeva platform\n• Oversee the product enhancements and defects and lead the weekly status meeting and compile a prioritized list of PE’s to send over to Veeva for annual analysis\n• Provide technical review and approval assistance on all SDLC documentation for all VRIM releases (configuration + platform)\n• Organize priorities with integration team during bi-weekly integration status meetings\n• Active participant in all VRIM configuration design reviews\n• Working with the Robotic Process Automation (RPA) bot team to integrate with VRIM system to achieve process/technical efficiency\n• Create and coordinate all Impact Assessment reviews for all of the Configuration releases\n• Provide guidance to the AMS team during Veeva Platform releases\n\nQualifications:\n\nEducation:\n• B.A./B.S. or equivalent experience in Computer Science, Engineering, MIS, and Science or in a related field.\n\nPrerequisites:\n• Minimum 5 years or equivalent with large scale validated scientific computer systems.\n• Minimum 5 years or experience with Veeva platform, especially in the Regulatory solutions\n• Minimum of 3 years of engineering and solution delivery with GxP systems.\n• Demonstrated ability to analyze and define business problems and identify appropriate technology solution(s).\n• Strong teamwork and partnership skills.\n• Drive for results augmented by strong planning and organization skills.\n• Deliver customer value - dedicated to understanding and meeting customer needs.\n• Partners effectively with and through others to achieve common goals.\n• Strong Communication skills for verbal, written, and technical presentations.\n• Demonstrates ethics and integrity.\n\nPreferred:\n• Has worked in Clinical, Regulatory, Quality, and/or Safety IT, and relevant business areas.\n• Has worked with architecture, integration, interfaces, portals, and/or analytics.\n• Experience with Veeva Vault RIM, workflow tools (Appian, TIBCO, Active Matrix, Uipath), and API frameworks (Apigee).\n• Experience with validated health authority regulatory (HAR) capabilities, SDLC, inspection and audits.\n• Experience working with on premise, Cloud capabilities, and software as a service (SaaS).\n• Experience with Agile Methodology.\n\nNOTICE FOR INTERNAL APPLICANTS\n\nIn accordance with Managers' Policy - Job Posting and Employee Placement, all employees subject to this policy are required to have a minimum of twelve (12) months of service in current position prior to applying for open positions.\n\nIf you have been offered a separation benefits package, but have not yet reached your separation date and are offered a position within the salary and geographical parameters as set forth in the Summary Plan Description (SPD) of your separation package, then you are no longer eligible for your separation benefits package. To discuss in more detail, please contact your HRBP or Talent Acquisition Advisor.\n\nEmployees working in roles that the Company determines require routine collaboration with external stakeholders, such as customer-facing commercial, or research-based roles, will be expected to comply not only with Company policy but also with policies established by such external stakeholders (for example, a requirement to be vaccinated against COVID-19 in order to access a facility or meet with stakeholders). Please understand that, as permitted by applicable law, if you have not been vaccinated against COVID-19 and an essential function of your job is to call on external stakeholders who require vaccination to enter their premises or engage in face-to-face meetings, then your employment may pose an undue burden to business operations, in which case you may not be offered employment, or your employment could be terminated. Please also note that, where permitted by applicable law, the Company reserves the right to require COVID-19 vaccinations for positions, such as in Global Employee Health, where the Company determines in its discretion that the nature of the role presents an increased risk of disease transmission.\n\nCurrent Employees apply HERE\n\nCurrent Contingent Workers apply HERE\n\nUS and Puerto Rico Residents Only:\n\nOur company is committed to inclusion, ensuring that candidates can engage in a hiring process that exhibits their true capabilities. Please click here if you need an accommodation during the application or hiring process.\n\nWe are an Equal Opportunity Employer, committed to fostering an inclusive and diverse workplace. All qualified applicants will receive consideration for employment without regard to race, color, age, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status, or other applicable legally protected characteristics. For more information about personal rights under the U.S. Equal Opportunity Employment laws, visit:\n\nEEOC Know Your Rights\n\nEEOC GINA Supplement​\n\nPay Transparency Nondiscrimination\n\nWe are proud to be a company that embraces the value of bringing diverse, talented, and committed people together. The fastest way to breakthrough innovation is when diverse ideas come together in an inclusive environment. We encourage our colleagues to respectfully challenge one another’s thinking and approach problems collectively.\n\nLearn more about your rights, including under California, Colorado and other US State Acts\n\nU.S. Hybrid Work Model\n\nEffective September 5, 2023, employees in office-based positions in the U.S. will be working a Hybrid work consisting of three total days on-site per week, generally Tuesday, Wednesday and either Monday or Thursday, although the specific days may vary by site or organization, with Friday designated as a remote-working day, unless business critical tasks require an on-site presence. This Hybrid work model does not apply to, and daily in-person attendance is required for, field-based positions; facility-based, manufacturing-based, or research-based positions where the work to be performed is located at a Company site; positions covered by a collective-bargaining agreement (unless the agreement provides for hybrid work); or any other position for which the Company has determined the job requirements cannot be reasonably met working remotely. Please note, this Hybrid work model guidance also does not apply to roles that have been designated as “remote”.\n\nUnder New York State, Colorado State, Washington State, and California State law, the Company is required to provide a reasonable estimate of the salary range for this job. Final determinations with respect to salary will take into account a number of factors, which may include, but not be limited to the primary work location and the chosen candidate’s relevant skills, experience, and education.\n\nExpected salary range:\n$107,600.00 - $169,400.00\n\nAvailable benefits include bonus eligibility, health care and other insurance benefits (for employee and family), retirement benefits, paid holidays, vacation, and sick days. For Washington State Jobs, a summary of benefits is listed here.\n\nSearch Firm Representatives Please Read Carefully\nMerck & Co., Inc., Rahway, NJ, USA, also known as Merck Sharp & Dohme LLC, Rahway, NJ, USA, does not accept unsolicited assistance from search firms for employment opportunities. All CVs / resumes submitted by search firms to any employee at our company without a valid written search agreement in place for this position will be deemed the sole property of our company. No fee will be paid in the event a candidate is hired by our company as a result of an agency referral where no pre-existing agreement is in place. Where agency agreements are in place, introductions are position specific. Please, no phone calls or emails.\n\nEmployee Status:\nRegular\n\nRelocation:\nNo relocation\n\nVISA Sponsorship:\nNo\n\nTravel Requirements:\n10%\n\nFlexible Work Arrangements:\nHybrid\n\nShift:\nNot Indicated\n\nValid Driving License:\nNo\n\nHazardous Material(s):\nna\n\nRequisition ID:R267050", "occupation": "business analyze"}, {"title": "Analyst, Marketing Acceleration", "company": "Saks", "location": "New York, NY, USA", "via": "via Careers At Saks", "time": "9 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.careersatsaks.com/us/en/job/R-103706/Analyst-Marketing-Acceleration?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.linkedin.com/jobs/view/analyst-marketing-acceleration-at-saks-3765248562?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.indeed.com/viewjob?jk=4ef9da1dc490349f&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.levels.fyi/jobs?jobId=96117502309737158&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.trabajo.org/job-835-20231112-b91bec80ff4ae4c15c18a01f516dfa1f?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://lazyapply.com/jobpreview/job_4ef9da1dc490349f?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://saks-fifth-avenue.talentify.io/job/analyst-marketing-acceleration-new-york-new-york-saks-fifth-avenue-r-103706?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ny.tarta.ai/j/bJbBwIsBcRajQcTjbexh1123-analyst-marketing-acceleration-in-new-york-new-york-at-saks?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Details\n\nJob Description...\nWho We Are:\n\nSaks is a world-renowned luxury ecommerce destination. The company’s unique approach combines a focus on the digital customer experience with a strong connection to a network of extraordinary stores that extends that seamless experience into the real world.\n\nOn its website and app, Saks offers an unparalleled selection of curated merchandise across fashion for women and men, beauty, jewelry, home décor and more. In addition to the shopping experience, customers come to Saks for inspiring editorial content, access to digital stylists, lifestyle experiences, and other world-class services. The company is currently in the midst of a dramatic expansion, driven by significant enhancements to its platforms and offerings, with the goal of becoming the preeminent destination for luxury internationally.\n\nRole Summary:\n\nSAKS.COM LLC seeks Analyst, Marketing Acceleration in New York, NY, to partner with media teams, media agencies, and marketing measurement teams to dissect campaign performance, identify optimization opportunities, and evaluate activation partners and tactics. Facilitate database management to analyze and maintain the audience strategy within the Customer Data Platform. Analyze the performance and business impact of the emerging media channels. Utilize clickstream, user behavior, and conversion patterns to identify how the channel is performing relative to its goals and determine optimizations opportunities. Analyze Marketing Mix Model outputs with the intention of developing hypotheses. Manage the marketing test and learn agenda. Apply statistical methods to analyze corporate data and hypothesize and develop testing frameworks based on those outputs. Use regression analysis to identify the relationship between spend and revenue in hypothesis building. Assist in designing the media testing plans to optimize media performance using a multitude of approaches including matched market analyses, time-based regressions, cookie-based split tests, and/or multivariate analysis. Catalog ongoing learnings as they arise to help establish internal benchmarks and keep stakeholders apprised of testing outcomes. Requirements: Bachelor’s degree or foreign equivalent in Business Administration, Marketing and Business Analytics, Economics, or related field and one (1) year of experience in the job offered or related occupation: Utilizing Analytics Platform database; analyzing campaign performance metrics and changes in performance trends over time, utilizing Customer Data Platform and customer segmentation tools to identify audiences being targeted across media channels; identifying audience opportunities per channel via advanced Excel functions; and analyzing marketing quarterly return on investment data and trends by channel and tactic for budget and development. Telecommuting and/or working from home may be permissible pursuant to company policies. When not telecommuting, must report to work site.  Offered salary is between $62,000.00 to $80,000.00 per year. Please indicate job code QY10162023PN.\n\nYour Life and Career at Saks:\n• Exposure to rewarding career advancement opportunities\n• A culture that promotes a healthy, fulfilling work/life balance\n• Benefits package for all eligible full-time employees (including medical, vision and dental).\n• An amazing employee discount\n\nThank you for your interest in Saks. We look forward to reviewing your application.\n\nSaks provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Saks complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n\nSaks welcomes all applicants for this position. Should you be individually selected to participate in an assessment or selection process, accommodations are available upon request in relation to the materials or processes to be used.\n\nSaks.com is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.\n• The above expected salary range may have some variability based upon factors including, but not limited to, a candidate’s overall experience, qualifications, and geographic location. If you are interested in the role, we encourage you to apply and, if selected to move forward in the interview process, you will have a chance to speak with our recruitment team regarding your specific salary expectations", "occupation": "business analyze"}, {"title": "Sr Analyst", "company": "ConEdison", "location": "Bronx, NY, USA", "via": "via Con Edison - Careers", "time": "2 days ago", "type": "Full-time", "salary": "none", "links": ["https://careers.coned.com/jobs/13595285-sr-analyst?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.linkedin.com/jobs/view/analyst-at-con-edison-3759570918?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://careers.conedtransmission.com/jobs/13595285-sr-analyst?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.salary.com/job/consolidated-edison-company-of-new-york-inc/analyst/8e6da50b-ce49-476c-b80e-a202b88aa3bc?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.indeed.com/viewjob?jk=c275371ead0dadde&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://careers.oru.com/jobs/13595285-sr-analyst?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://myjobsny.usnlx.com/bronx-ny/sr-analyst-gas-integrity-management/97D52A73E5D64610941C8D9212775E27/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.levels.fyi/jobs?jobId=131315229196722886&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Mission Statement\n• Consolidated Edison Company of New York, Inc. (Con Edison), Orange & Rockland Utilities (O&R), and Consolidated Edison Transmission (CET) employees are required to follow health, safety, and environmental policies, EEO, Standards of Business Conduct, and all other applicable company policy and procedures. We all share a responsibility to advance the company’s mission by... excelling at our three corporate priorities – safety of our people and the public, operational excellence in all that we do, and ensuring the best possible customer experience.\n\nCore Responsibilities\n• Plan, manage and implement Gas Engineering's Integrity Management programs. This includes working with the vendor to upgrade and improve the prioritization program and manage the various programs that interact with the risk model.\n• Prepare and continuously improve routine data reporting mechanisms for all four operating areas.\n• Support the department with accessing data for custom and ad-hoc reporting and will help analyze gas system performance through data analytics and trending.\n• Drive the continuous improvement cycle through feedback to data owners and the enterprise Data Governance Office on the effectiveness of Data Governance practice and related policy.\n• Own metadata management, ensuring data catalog, glossary, and quality rules are up to date and standards are followed when new assets are added.\n• Prepare engineering analysis and present to all levels of the organization.\n• Utilize prioritization software and various data sets to recommend modifications and improve gas system performance.\n• Perform engineering analysis for operating areas to help interpret statistical information.\n• Utilize the DIMP Risk Model to interpret system risk.\n• Collect, analyze, and prepare information for submittal to the PSC, NYC OEM, FDNY, Municipalities, etc. regarding engineering studies performed and requested.\n• Developing a proactive, customer-centric culture to foster trust and confidence of our customers and improve value for all our stakeholders.\n\nRequired Education/Experience\n• Bachelor's Degree Engineering, Computer Science and 3 years' experience Full-time industry experience in gas, electric, steam or data analysis.\n\nPreferred Education/Experience\n• Bachelor's Degree Engineering, Computer Science\n\nRelevant Work Experience\n• General working knowledge of geographic information system and/or mapping system(s). Required\n• Experience in statistical data trending and/or data analysis. Required\n• Experience creating Tableau and/or PowerBI Dashboards. Required\n• Familiarity with database structures. Preferred\n• Experience with SQL Preferred\n\nSkills & Ability\n• Must be proficient in Microsoft Office including Word, Excel, Outlook and PowerPoint, etc.\n• Well organized, detail oriented and flexible to handle multiple assignments\n• Demonstrates excellent judgment and decision making skills\n• Strong written and verbal communication skills\n\nLicenses & Certifications\n• Driver's License Required\n\nPhysical Demands\n• Must sit or stand to use a keyboard, mouse, and computer for entire shift\n\nOther Physical Demands\n• Must be able to respond to Company emergencies by performing a System Emergency Assignment to restore service to our customers.\n• Must be able and willing to travel within Company service territory, as needed.\n• Must be able to participate and travel to industry conferences, as needed.\n• Must be able to make fields visits and wear applicable personal protective equipment.\n\nTechnical Difficulty Statement\n• For technical issues, please contact us at careerconnect@coned.com\n\nEqual Opportunity Employer\n• Consolidated Edison Company of New York, Inc. (Con Edison), Orange & Rockland Utilities (O&R), and Consolidated Edison Transmission (CET) are equal opportunity employers. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of the individual’s actual or perceived disability, protected veteran status, race, color, creed, religion, sex, age, national origin, gender, gender identity, gender expression, genetic information, marital status, sexual orientation, citizenship, domestic violence victim status, or any other actual or perceived status protected by law", "occupation": "business analyze"}, {"title": "Data science analyst", "company": "Capgemini", "location": "New York, NY, USA", "via": "via Talent.com", "time": "1 day ago", "type": "Full-time", "salary": "none", "links": ["https://www.talent.com/view?id=d2c2964d3a31&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.trabajo.org/job-835-20231109-2390dbf675e7258009a23394142b5e3c?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.jobrapido.com/jobpreview/3052350466?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "About Capgemini Quaero360 Quaero360 provides a view into the patient experience as they move through the treatment lifecycle.\n\nProducing actionable insights allows our clients to remove barriers to patients getting on therapy and to measure if their actions are improving the patient experience...\n\nOur Insights Driven Approach (IDA) to tracking brand, patient, market and operations insights manages the intake, processing and delivery of data in a HIPAA compliant (de-identified) fashion and visualizes the insights leveraging our Quaero360 platform.\n\nSpecialty Channel Insights is an independently operated business line within the MALS market unit with 30 million in revenue.\n\nWe have seen year over year growth since the inception of the practice. About Capgemini Capgemini is a global leader in consulting, digital transformation, technology and engineering services.\n\nThe Group is at the forefront of innovation to address the entire breadth of clients’ opportunities in the evolving world of cloud, digital and platforms.\n\nBuilding on its strong 50-year heritage and deep industry-specific expertise, Capgemini enables organizations to realize their business ambitions through an array of services from strategy to operations.\n\nCapgemini is driven by the conviction that the business value of technology comes from and through people. Today, it is a multicultural company of 300,000 team members in over 50 countries.\n\nWith Altran, the Group reported 2019 combined revenues of €17billion. About Our Culture Capgemini is a dynamic company that looks for team members to grow with us.\n\nWe are committed to supporting you to GET THE FUTURE YOU WANT. That is our commitment to every employee. Capgemini offers a generous total rewards package, including flexible hours, autonomy, transparency, and a diverse and inclusive culture.\n\nWith 11 Employee Resource Groups, we are committed to supporting your causes and getting involved in your community to help make it better.\n\nWe have an electrical spirit and encourage professional development. No matter the location, or the role, every Capgemini employee shares one inspired mission : To be bold;\n\nto be YOU.Join us to get the future you want! Data Analyst - Life Sciences Group Responsibilities\n• Interpreting data, analyzing results using code and statistical techniques\n• Developing and implementing data analyses, data collection systems and other strategies that optimize statistical efficiency and quality\n• Analyzing data from primary or secondary data sources and maintaining databases\n• Coordinating with all stakeholder to review data discrepancies / issues, if any\n• Providing quality assurance of imported data, working with quality assurance analyst if necessary\n• Commissioning and decommissioning of data sets\n• Processing confidential data and information according to guidelines\n• Helping develop reports and analysis\n• Managing and designing the reporting environment, including data sources, security, and metadata\n• Supporting the data warehouse in identifying and revising reporting requirements\n• Supporting initiatives for data integrity and normalization\n• Assessing tests and implementing new or upgraded software and assisting with strategic decisions on new systems\n• Generating reports from single or multiple systems\n• Troubleshooting the reporting database environment and reports\n• Evaluating changes and updates to source production systems\n• Training end users on new reports and dashboards\n• Providing technical expertise on data storage structures, data mining, and data cleansing Skills Required :\n• Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy\n• The ability to analyze, model and interpret data\n• The ability to plan work and meet deadlines Preferred Skills :\n• Minimum of 2 years working experience in technical data analysis, data science, or data warehousing with proven business analysis experience Technical :\n• Hands on experience with oracle, PL / SQL, PostgreSQL, MySQL, Python\n• Adept at queries, report writing and presenting findings\n• Power BI and SQL Developer, Visual Studio, Qlik\n• Understanding of Entity-Relationship models, explore large datasets and prepare data\n• Should be able to write Complex SQL Queries\n• Understanding different data formats such as structured, un-structured and semi-structured Requirements :\n• Interpersonal skills\n• Teamworking skills\n• Written and verbal communication skillsCandidates should be flexible / willing to work across this delivery landscape which includes and not limited to Agile Applications Development, Support and Deployment.\n\nApplicants for employment in the US must have valid work authorization that does not now and / or will not in the future require sponsorship of a visa for employment authorization in the US by Capgemini.\n\nBusiness Analysts enable the transformation and performance improvement of an enterprise or its parts, with respect to people, process and technology, by providing relevant capabilities, assets (human and non-human), processes and tools.\n\nBusiness Analysts structure, analyze and visualize an enterprise’s current state. They design and visualize the future state.\n\nFunctional analysts can specialize in Business, ERP, Application Management or Custom Software Development (CSD).Required Skills and Experience : You are a self-reliant analyst who has mastered at least one methodology.\n\nYou are developing your knowledge in a business and / or industry domain and an ERP solution or a technical tool / programming language.\n\nPossible positions could include being a Business Process Consultant describing processes, Requirements Analyst describing business / functional requirements or Package configuration.\n• Qualification : 2 5 (1 year min relevant experience in the role), Bachelor’s Degree.\n• Certification : If possible seeking BA level 1.\n• Should have progressing skills in Business Analysis, Business Knowledge, Business Change Management, Functional Architecture Design & Project Financials, KPI s & Reporting\n• Should have baseline skills in Software Engineering, Architecture Knowledge & Testing. About Capgemini A global leader in consulting, technology, services, and digital transformation, Capgemini is at the forefront of innovation to address the entire breadth of client’s opportunities in the evolving world of cloud, digital, and platforms.\n\nBuilding on its strong 50-year heritage and deep industry-specific expertise, Capgemini enables organizations to realize their business ambitions through an array of services from strategy to operations.\n\nCapgemini is driven by the conviction that the business value of technology comes from and through people. It is a multicultural company of 300,000 team members in over 50 countries.\n\nWith Altran, the Group reported 2019 combined revenues of €17billion.Capgemini is an Equal Opportunity Employer encouraging diversity in the workplace.\n\nAll qualified applicants will receive consideration for employment without regard to race, national origin, gender identity / expression, age, religion, disability, sexual orientation, genetics, veteran status, marital status or any other characteristic protected by law.\n\nThis is a general description of the Duties, Responsibilities and Qualifications required for this position. Physical, mental, sensory or environmental demands may be referenced in an attempt to communicate the manner in which this position traditionally is performed.\n\nWhenever necessary to provide individuals with disabilities an equal employment opportunity, Capgemini will consider reasonable accommodations that might involve varying job requirements and / or changing the way this job is performed, provided that such accommodations do not pose an undue hardship.\n\nClick the following link for more information on your rights as an Applicant -apgemini.com / resources / equal-employment-opportunity-is-the-lawApplicants for employment in the US must have valid work authorization that does not now require sponsorship of a visa for employment authorization in the US by Capgemini.\n\nVisit us at?www.capgemini.com. People matter, results count. Job : Programmer / Analyst Organization : NA AS Title : Data Analyst - Life Sciences Location : NY-New York Requisition ID : 063448\n\nLast updated : 2023-11-16", "occupation": "business analyze"}, {"title": "Digital marketing analyst", "company": "Randstad", "location": "New York, NY, USA", "via": "via Talent.com", "time": "1 day ago", "type": "Full-time", "salary": "none", "links": ["https://www.talent.com/view?id=73a8faa16857&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.bebee.com/job/20231112-208a71531e0d90f8d20f2c684aaca5b8?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "senior business systems analyst digital marketing.+ new york , new york+ posted march 29, 2022 job details summary+ $135,000 - $170,000 per year+ permanent+ bachelor degree+ category computer and mathematical occupations+ reference915932job detailsjob summary : Our client has an excellent permanent opportunity for a Senior Business Analyst to define, scope, and manage high-impact projects and strategic initiatives.\n\nThis candidate will work with business partners to develop a robust digital client experience vision and other key business objectives.\n\nCandidates must have experience implementing and supporting websites and mobile apps, translating vision to requirements, defining and managing projects, and delivering results.\n\nlocation : New York, New Yorkjob type : Permanentsalary : $135,000 - 170,000 per yearwork hours : 8am to 4pmeducation : Bachelorsresponsibilities : Develop an understanding of our client's current digital offerings in order to enhance them.\n\nPerform competitive... analyses of peer and correlative digital offerings. Track evolution over time.Identify innovative solutions to unique requirements.\n\nTranslate vision to requirementsDetermine and document requirements based on client experience, business workflows, and data requirements.\n\nTranslate high-level information into technical details.Prototype to represent requirement information in various visual formats to accompany documentationCollaborate with the content, development and QA teams to design, implement, and test business requirementsCommunicate information effectively to IT colleagues, business partners and managementDevelop and maintain roadmap to deliver enhanced digital client experience over timeDefine, scope, and manage projects to deliver key enhancements.\n\nLead development of project estimates, plans and schedules.Serve as a key point of contact between the client digital program and delivery teams, the enterprise IT team, and business stakeholders on all items related to the digital program.\n\nFacilitate large meetings and design sessions. Evaluate information from multiple sources and determine appropriate priority / resolution.\n\nSupport transition from innovation to ongoing operationsDevelop training on supported productsDocument ongoing responsibilities and manage transition to enterprise technology and operations teamsVisual information designMapping / re-engineering business / process flowsBusiness requirement documentationUnderstanding of relational databases and working knowledge of SQLThorough knowledge of business analysis concepts necessary to work with development and quality assurance teams.\n\nstrong writing skills to create user stories, analysis, documentation, create presentations, business requirements and training materials.\n\nProficiency in presenting to colleagues, management as well as training on applications and business processes is also required.\n\nExperience designing measurement programs, defining data requirements, and analyzing resultsProject managementSuperior cross-organizational program and project management skills across preparation, planning, managing, and results measurement and spanning a range of work streams from design and experience to technical implementation, delivery, and rollout to transition to ongoing operationsBalances digital advocacy with excellent interpersonal skills.\n\nAble to develop effective working relationships to determine practical application and drive adoption of new technologies as appropriate.\n\nProven ability to influence professionals at all levels and to lead teams across functions.strong analytical and communication skills, including the ability to convey complex ideas clearly and concisely.\n\nAbility to manage multiple priorities effectively, collaboratively, and in a fast-paced environmentRelevant technology experience may includeCRM Platform : Salesforce, Oracle, or Equivalent CRMECM Platforms : OpenText, WordPress, SharePoint, or equivalent ECMSocial Business Collaboration : Jive, SharePoint, OpenText, or equivalent platforms for Intranet and Learning.\n\nMarketing Automation : Salesforce Marketing Cloud, Marketo, or EquivalentAnalytics Platforms : Google Analytics, Tableau, Qlik or equivalentGraphics : Adobe Photoshop, Illustrator or equivalentCoding Languages : HTML 5.\n\nJavascript and others Office Applications : MS Office Suite, Visio, Skype, Acrobat, and OutlookQualifications : Proven track record managing transformation initiativesBA / BS required - Business / Finance / Economics / Computer Science preferred15+ years of Business Analysis experiencesAdditional relevant qualifications include : Design Thinking, Scrum, Project Management, PMP, CCBA / CBAPqualifications : + Experience level : Experienced+ Minimum 10 years of experience+ Education : Bachelors (required)skills : + Business Analysis+ Digital Marketing+ Digital Marketing+ Digital Marketing+ Digital Marketing+ Digital Marketing+ Digital Marketing+ Requirement Analyst+ System Analyst+ BSA+ Marketing+ Digital Marketing+ Digital Marketing+ Digital Marketing+ Digital MarketingEqual Opportunity Employer : Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.\n\nFor certain assignments, Covid-19 vaccination and / or testing may be required by Randstad's client or applicable federal mandate, subject to approved medical or religious accommodations.\n\nCarefully review the job posting for details on vaccine / testing requirements or ask your Randstad representative for more information.\n\nrelated jobs. see all jobs business analyst client applications and communications + woodbridge, new jersey+ permanent+ $80,000 - $115,000 per yearposted april 4, 2022job summary : Our enterprise financial client has a permanent opening for an experienced Business Analyst to support the client digital communications team.\n\nhelp to manage banking and financial deliverables. Candidates will work independently on banking and financial enterprise projects as well as post deployment support and new inititatives.\n\nHybrid work environment and Bachelor's degree required. location : WOODBRIDGE, New Jersey job type : Permanent salary : $80,000 - 115,000 per year work hours : 8am to 4pm education : Bachelors responsibilities : Responsibilities : Partner with business leaders to design innovative client tools Perform business analysis, supporting client digital communications and projects Perform process redesign and data analysis Collaborate with application delivery and QA to implement solutions Develop an understanding of business models Develop an in-depth understanding of internal data structure Skills and Experience : Demonstrated detailed experience working on client digital solutions Requirement elicitation, documentation, communication, and implementation Ability to facilitate and guide teams to a viable solution Ability to communicate and document complex information concisely Lead meetings and presentations with senior management Ability to build and maintain partnerships at all levels of the organization.\n\nAbility to perform under pressure and manage multiple priorities Project / Product management and business acumen skills Understanding of software development methodologies and best practices Understanding of prototyping and UX concepts Required Bachelor's degree 3+ years of experience in business analysis or equivalent experience 3+ years of experience working directly with banking systems Financial services, retail bankin and client digital communications Nice to Have : Understanding of relational databases and knowledge of SQL Data analysis, Trust / Accounting, Banking Operations, Report design, client digital communications qualifications : Experience level : ExperiencedMinimum 2 years of experienceEducation : Bachelors (required) skills : Business AnalysisBusiness Systems AnalystRequirement AnalystTechnical AnalystSystem AnalystSBABSADocumentGatherMutual FundUser AcceptanceBrokerageEquitiesFundUATFixed Assets Equal Opportunity Employer : Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.\n\nFor certain assignments, Covid-19 vaccination and / or testing may be required by Randstad's client or applicable federal mandate, subject to approved medical or religious accommodations.\n\nCarefully review the job posting for details on vaccine / testing requirements or ask your Randstad representative for more information.\n\nCandidate will be responsible for leading an enterprise team in the financial services / private banking area. Will be responsible for driving solutions and implementing new initiatives as well as drive strategy.\n\nlocation : Woodbridge, New Jersey job type : Permanent salary : $175,000 - 250,000 per year work hours : 8am to 4pm education : Bachelors responsibilities : The Vice President of Business Analysis reports to the CTO and is responsible for overseeing teams of business analysts (BAs) that identify, define and document business processes and software requirements to solve complex business challenges.\n\nThis position is responsible for recruiting, developing and retaining talent, as well as ensuring the staff has the skills and capabilities to meet business needs.\n\nThe candidate will be responsible for championing best practices and ensuring initiatives achieve business outcomes. The BA team serves as the liaison between business and IT teams within a project by facilitating communication and determining software objectives that align with stated and unstated business needs.\n\nResponsibilities : Provide leadership, vision and direction for the business analysis organizationLead the business analysis organization to successful delivery of business outcomesBuild strong working relationships with business leaders to ensure teams meet expectations and contribute to achievement of business goalsCollaborate with IT and business leaders to develop short-term and long-term strategic plansSupport and facilitate the development of innovative solutionsManage personnel, vendors, and capital expenditures within allocated budget Develop and implement a workforce strategy to meet both current and future business needs through developing, hiring and / or sourcing talentManage resource allocation across BA teams to maximize business impact and ensure each team has the skills and capabilities needed to achieve business objectivesManage BA talent, playing a key role in performance management and diversity, equity, and inclusion initiativesPartner with Learning and Development to create a comprehensive professional development curriculum that supports business skills and domain knowledge Business Analysis Activities Implement and manage status reporting, metrics and benchmarksChampion the adoption of and adherence to best of breed tools and processesIdentify and implement solutions that adhere to industry requirements to ensure compliance with industry standards, best practices and applicable regulations.\n\nSkills and Experience Business analysis skillsProject management skillsBusiness acumen and ability to understand and drive business objectives.\n\nDemonstrated leadership skills and experience.Talent management skills including talent development, coaching, mentoring, and team motivation.\n\nAbility to build and maintain strong cross-functional partnerships at all levels of the organization.Demonstrated ability to communicate complex technical information in a condensed manner to various stakeholders verbally and in writing.\n\nOrganizational skills, including an ability to perform under pressure and manage multiple priorities with competing demands for resources.\n\nUnderstanding of software development methodologies and best practices.Understanding of relevant prototyping and issue tracking tools and platforms (e.\n\ng., Jira, Axure), with an eagerness to learn about new and unfamiliar technologies.Adaptability and ability to manage rapid change in business needs, processes, or technologies.\n\nQualifications Bachelor's degree is required; graduate degree is desirable10+ years of experience in business analysis10+ years of experience in talent management10+ years of experience in the financial services industry, with a focus on private bankingExperience leading large (15+ employee) teams qualifications : Experience level : DirectorMinimum 10 years of experienceEducation : Bachelors (required) skills : Business Systems AnalystBusiness AnalysisBusiness ObjectsStrategic PlanningSBABSARequirement Analyst Equal Opportunity Employer : Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.\n\nFor certain assignments, Covid-19 vaccination and / or testing may be required by Randstad's client or applicable federal mandate, subject to approved medical or religious accommodations.\n\nCarefully review the job posting for details on vaccine / testing requirements or ask your Randstad representative for more information.\n\nview job business analyst finance and banking systems + woodbridge, new jersey+ permanent+ $115,000 - $140,000 per yearposted march 21, 2022job summary : Our enterprise financial client has a permanent opening for an experienced Business Analyst to support the banking and treasury groups to manage banking and financial deliverables.\n\nCandidates will work independently on banking and financial enterprise projects as well as post deployment support and new inititatives.\n\nHybrid work environment and Bachelor's degree required. location : WOODBRIDGE, New Jersey job type : Permanent salary : $115,000 - 140,000 per year work hours : 8am to 4pm education : Bachelors responsibilities : Responsibilities : Partner with business leaders to design innovative banking solutions Perform business analysis, supporting banking and treasury functions Perform process redesign and data analysis Collaborate with application delivery and QA to implement banking solutions Develop an understanding of business models Develop an in-depth understanding of internal data structure Skills and Experience : Demonstrated detailed experience working on a banking platform Market understanding of check processing, ACH, and wire transfer Requirement elicitation, documentation, communication, and implementation Ability to facilitate and guide teams to a viable solution Ability to communicate and document complex information concisely Lead meetings and presentations with senior management Ability to build and maintain partnerships at all levels of the organization.\n\nAbility to perform under pressure and manage multiple priorities Project / Product management and business acumen skills Understanding of software development methodologies and best practices Understanding of prototyping and UX concepts Required Bachelor's degree 3+ years of experience in business analysis or equivalent experience 3+ years of experience working directly with banking systems Financial services, retail banking or credit union experience Nice to Have : Understanding of relational databases and knowledge of SQL Understanding of USA Patriot Act, Anti Money Laundering and Financial Crimes Risk Management Experience working with FIS, FISERV, or Jack Henry Banking Systems Data analysis, Trust / Accounting, Banking Operations, Report design qualifications : Experience level : ExperiencedMinimum 4 years of experienceEducation : Bachelors (required) skills : Business AnalysisBusiness Systems AnalystRequirement AnalystTechnical AnalystSystem AnalystSBABSADocumentGatherMutual FundUser AcceptanceBrokerageEquitiesFundUATFixed Assets Equal Opportunity Employer : Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.\n\nFor certain assignments, Covid-19 vaccination and / or testing may be required by Randstad's client or applicable federal mandate, subject to approved medical or religious accommodations.\n\nCarefully review the job posting for details on vaccine / testing requirements or ask your Randstad representative for more information.\n\nview job let similar jobs come to you We will keep you updated when we have similar job postings. your email address select frequency select frequencydailyweeklymonthly I consent to the use of my information for the purpose of sending me job alerts.\n\nLast updated : 2023-11-16", "occupation": "business analyze"}, {"title": "Technology analyst", "company": "Morgan Stanley", "location": "New York, NY, USA", "via": "via Talent.com", "time": "1 day ago", "type": "Full-time", "salary": "none", "links": ["https://www.talent.com/view?id=50e5530c61ac&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company Profile*At Morgan Stanley, we advise, originate, trade, manage and distribute capital for governments, institutions and individuals, and always do so with a standard of excellence.\n\nWe are a leading global financial services firm that conducts its business through three principal business segments Institutional Securities, Wealth Management (WM), and Investment Management...\n\nThe Firm's employees serve clients worldwide from more than 1,200 offices in 43 countries.Our WM business is one of the largest in the world with more than $2 trillion in client assets, $73 billion in lending balances, and nearly 16,000 Financial Advisors in 600 offices across the U.\n\nS. Our Financial Advisors focus on delivering timely, customized solutions and services that help clients meet their financial and life goals.\n\nOur offering includes brokerage and investment advisory services, financial and wealth planning, access to credit and lending, cash management, annuities and insurance, and retirement services.\n\nAs a market leader, the talent and passion of our people is critical to our success. Together, we share a common set of values rooted in integrity, excellence and strong team ethic.\n\nMorgan Stanley can provide a superior foundation for building a professional career - a place for people to learn, to achieve and grow.\n\nA philosophy that balances personal lifestyles, perspectives and needs is an important part of our culture.*Department Profile*Global Banking Technology (GBT) is a dynamic and fast-paced area within the Firm?\n\ns WM Technology Division. We are responsible for creating innovative technology solutions for the Private Banking Group (PBG), one of the strategic growth areas of the Firm, providing cash management and lending products and services to our WM clients.\n\nThis includes state-of-the-art technology for a nationwide network of Private Bankers and product specialists who work with Financial Advisors to provide access to products and services such as online banking, cards, deposit products, residential mortgages, securities based loans and tailored lending.\n\nIf you are an exceptional individual who is interested in solving complex problems and building sophisticated solutions in a dynamic team environment, GBT is the place for you.\n• Position Description Work as part of a Next Gen Money movement fleet, enabling various payment types and assist in the redesign & transformation of the money movement platform.\n• Analyze business processes, functions and procedures across multiple business units.* Work on and lead the data analysis, reporting and migration efforts as a part of the platform transformation.\n• Create user stories for business and functional requirements, including workflow, business rules, use cases, activity and sequence diagrams.\n• Design business intelligence tools and dashboards to show project KPIs.* Meet business unit objectives including cost estimates, date commitments and functionality* Act as liaison between business units and software development teams, management and users.\n• Become a subject matter expert for banking product data by taking on data research / analysis tasks and answering questions about the data.\n• Assist with QA / Testing to develop test plans and more detailed test cases.* Work with the project team and business to identify and resolve issues that arise during projects or as part of day-to-day business operations.\n• Actively contribute and participate in design and architecture discussions, daily stand-ups, and Agile Sprint planning sessions*Required Skills 8 years of hands on experience in a business analyst role.\n• Practiced understanding of system-to-system communication, contracts, and sequence diagrams.* Strong understanding of systems design such as service oriented and microservice architecture.\n• Self-motivated, innovative and can work independently as well as in a team environment* Ability to multitask across a number projects.\n• Proficient in JIRA* Proficient in MS Teams and MS Office applications : Excel, Visio, PowerPoint, Word and Project* Willingness to learn and grow.\n• Experience within an Agile framework.*Desired skills Experience in financial services field* Understand how to create user flows and UI mockups* Ability to understand and manipulate data for analysis* Basic knowledge of JSON, Swagger, Postman and internet browser developer tools Job : Business Analysis Title : *Technology Business Analyst Location : *New York-New York Requisition ID : *3203706*\n\nLast updated : 2023-11-16", "occupation": "business analyze"}, {"title": "Senior Specialist - Business Analysis - NYC, NY (3 Days...", "company": "TMS", "location": "New York, NY, USA", "via": "via LinkedIn", "type": "Contractor and Temp work", "time": "none", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/senior-specialist-business-analysis-nyc-ny-3-days-onsite-week-must-6%2B-months-c2h%C2%A0-at-tms-3656736612?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.bebee.com/job/20231105-33e3e8fb9c227bee09e319a425e13889?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://salutemyjob.com/jobs/senior-specialist-business-analysis-nyc-ny-3-days-onsite-week-must-6-months-c2h-new-york/1142023190-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.khon2.com/jobs/senior-specialist-business-analysis-nyc-ny-3-days-onsite-week-must-6-months-c2h-new-york/1142023190-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.wearegreenbay.com/jobs/senior-specialist-business-analysis-nyc-ny-3-days-onsite-week-must-6-months-c2h-new-york/1142023190-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.careerbuilder.com/job/J3Q7GG6YL7M86P1QHKY?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.wdtn.com/jobs/senior-specialist-business-analysis-nyc-ny-3-days-onsite-week-must-6-months-c2h-new-york/1142023190-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.talent.com/view?id=f05255256263&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Role: Senior Specialist - Business Analysis\n\nLocation: NYC, NY (3 Days onsite/week Must...\n\nDuration: 6+ Months C2H\n\nProgram Objective\n\nAs the client continues in their transformation journey on establishing a \"Digital Cards solution for their clients. As part of this initiative, the client is going to reconvert the Chase Paymentech and adopt World pay as a merchant processor supporting end clients from POS to Settlement (It is a C2B product). This will be a one shop stop for the end clients to make the payment across all type. Client will have the flexibility to receive payments thru Digital card across all treasury service products.\n\nJob Description\n• Candidate will provide techno functional leadership in Merchant Service provider business domain to bring in WorldPay as the MSP instead of Chase Paymentech.\n• Candidate will serve as a cross-program role to ensure quality of the deliverables within their areas of expertise and drives innovation and strategic solutions within global, mission-critical, large-scale programs.\n• Candidate will direct and assist team to elicit, challenge, and prioritize requirements, translate into functional design, and use case models. Manages the functional scope of project, objectives, constraints and assumptions for a large, strategic, multi-year program and will also provide guidance in development of the technical design, test plans, and user documentation. Candidate will lead implementation/conversion strategy planning and implementation and will manage scope and change throughout the initiative utilizing formal change control and requirements traceability.\n\nThis Business Analyst will be responsible for:\n• Eliciting, challenging, and prioritizing requirements\n• Creation of User Stories covering Business and Functional Requirements for projects large and small, ranging from small functional enhancements to large multi-year transformation projects.\n• Driving business architectural solutions focused on flexibility, time to market and re-usability\n• Working with business and technology partners to provide a seamless experience to users both internal and external when interacting with Chase Paymentech or World Pay MSP systems\n• Supporting testing of new or enhanced applications and/or systems and providing guidance to team members on complex testing tasks including case development, requirement traceability analysis, test preparation, script writing, and functional test execution\n• Working with business and technology teams to develop technology roadmap strategy\n\nPayment Domain Knowledge base:\n\nTechnical or Application Knowledge base:\n• A strong business and functional knowledge in disciplines surrounding Merchant service Provider.\n• An understanding of an end-to-end flow of various merchant service provided from Marchant onboarding to settlement and tracking.\n• Knowledge of migration enterprise from one MSP to another MSP\n• End to end understanding of acquiring book of world.\n• Merchant onboarding\n• Fee processing\n• Reporting, Statements\n• Knowledge of merchant products like tokenization\n• Clearing and settlement process\n• Merchant Service provider:\n• Chase Paymentech or World pay is preferred.\n• Knowledge of Development Lifecycles and Agile approach to project implementation and software used to support same: JIRA, Confluence\n• Account static data management\n• Payment tracking mechanisms such as GPI\n• User Interface design\n• Technical background with knowledge of SDLC, JSON, XML and ability to write SQL queries\n• Experience working with waterfall and agile development methodologies\n• Understanding of systems engineering concepts\n\nCore BA Skills:\n• Written and verbal communication skills, including technical writing skills\n• Ability to conduct cost/benefit analysis\n• Business case development\n• Modeling techniques and methods\n• Requirement Management including Requirement Elicitation, Requirement Packaging, Requirement Validation and Requirement Verification etc", "occupation": "business analyze"}, {"title": "Re-advertisement: Business Analysis Manager (Internal Control and...", "company": "United Nations Children's Fund", "location": "New York, NY, USA", "via": "via UNjobnet", "time": "7 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.unjobnet.org/jobs/detail/65102635?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://untalent.org/jobs/re-advertisement-business-analysis-manager-internal-control-and-oversight-coordination-p-4-dfam-nyhq?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.linkedin.com/jobs/view/re-advertisement-business-analysis-manager-internal-control-and-oversight-coordination-p-4-dfam-nyhq-%23113427-at-unicef-3761264012?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.monster.com/job-openings/re-advertisement-business-analysis-manager-internal-control-and-oversight-coordination-p4-new-york-city-ny--00afde5d-8f46-4859-aec4-2b7814b93c2d?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://unjoblink.org/job/details/180881/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.adzuna.com/details/4429457259?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.bebee.com/job/20231113-3da06228750b49a36f54a1b0ea6f3d50?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://getwork.com/details/f5e871dfdbbfe424f62b71ada150d3e4?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "UNICEF works in some of the world’s toughest places, to reach the world’s most disadvantaged children. To save their lives. To defend their rights. To help them fulfill their potential.\n\nAcross 190 countries and territories, we work for every child, everywhere, every day, to build a better world for everyone...\n\nAnd we never give up.\n\nFor every child, hope..\n\nThe Internal Control, Compliance and Oversight Coordination Unit (ICO) within the Office of the Comptroller contributes to the strengthening of the UNICEF internal Control Framework and Coordinates relationship management framework with the Office of Internal Audit and Investigations (OIAI), Advisory Committee on Administrative and Budgetary Questions (ACABQ), Joint Inspection Unit (JIU), United Nations Board of Auditors (UNBOA), the Fifth Committee of General Assembly on recommendations, ensure effective implementation and provides substantive advice to the Comptroller on related matters. The Unit also provides support and ensures full compliance with organizational policies and guidelines as well as highly visible and critical global fiduciary standards and regulatory systems.\n\nThe incumbent reports to the Chief – Internal Control and Oversight and will be responsible for providing substantive support to him/her and colleagues in the Division of Finance and Administrative Management (DFAM) including other offices (SD, GSSC, PFP, UNICEF Regional and Field offices), by executing a variety of professional and technical functions and processes, applying analytical skills, theoretical skills and thorough knowledge of organizational goals, objectives, rules, regulations, policies and procedures to complete the tasks, specific to oversight, audit coordination, donor verification exercise and internal control matters.\n\nIn addition to supporting corporate reporting on audit observations, this position will be responsible for supporting country offices, regional offices, GSSC and HQ divisions throughout UNICEF, in the implementation of recommendations from UNBOA and Office of Internal Audit and Investigation (OIAI) to ensure that UNICEF achieves the related key performance indicators on implementation of audit recommendations.\n\nHow can you make a difference?\n\nExternal and Internal Audit Coordination:\n• Lead the coordination of the audits as well as donor verification, assessments and ad-hoc verification requests.\n• Draft management letter and response to the observations, recommendations and reports of audits.\n• Review audit reports to identify recurring risk, issues and recommend policy, procedure or systemic solutions and risk mitigation actions.\n• Prepare quarterly analysis reports on recurring audit (UNBOA and OIAI) issues pertaining to financial management for review and discussion with UNICEF management and the relevant business process owner, with a view to implementing corrective actions.\n• Prepare quarterly status updates on the implementation of UNBOA and OIAI recommendations for the Comptroller and OED.\n• Support the drafting of briefing notes, presentations and background papers for Executive Management on audit and compliance issues, reports to the Executive Management and Oversight bodies, on initiatives for management improvement by capturing, institutionalizing and sharing best practices and lessons learned in the implementation of audit recommendations.\n\nInternal Controls and Compliance:\n• Work closely with all HQ divisions, Regional Offices, GSSC and country office to contribute to the development and continuous improvement of a holistic risk-based financial monitoring frameworks.\n• Recommend cost-effective solutions and frameworks to address systemic or recurring issues that could impact financial performance and achievement of objectives, including changes to policies, processes, procedures and/or systems.\n• Support capacity building on Internal Controls, Fraud Risk Management and compliance with organizational Internal Control Framework and Monitoring mechanisms; and.\n• Support Compliance Management and Strategy to manage the risks associated with compliance with regulations and global fiduciary standards such as Anti Money Laundering and Combating the Financing of Terrorism.\n• Keeps abreast of latest system, policy and procedure developments within the organization, liaises with UNICEF offices, ensuring appropriate internal controls and oversight are reflected and reported in line with agreed mechanisms for feedback.\n• Supports Chief, Internal Controls and Oversight, in coordination and responding to standard and ad-hoc donor due diligence and assessment initiatives.\n\nKnowledge and capacity building\n• Contributes towards a culture of compliance and to the enhancement of organizational compliance initiatives which includes recommend improvements in processes and procedures to enhance productivity and performance based on evidence from audit recommendations.\n• Draft and maintain guideline for preparing offices for audits, including audit management learning modules for all UNICEF offices.\n• Support the establishment and implementation of a communications strategy on implementation of audit recommendations.\n• Support Internal Control Framework, Policy and Procedures changes.\n• Establish and maintain a network of focal points across the organization to champion the implementation of audit recommendations in their offices/divisions.\n• Participates in work groups, meetings, conferences, consultations with other agencies and partners in internal controls and audit coordination related matters.\n• Performs other duties as required.\n\nTo qualify as a champion, for every child you will need to have…\n• Advanced University degree in Business Administration, Accounting, Finance, or Audit is required.\n• A professional accounting qualification an internationally recognized accountancy body (such as CA, CPA, ACCA, CIMA, CIPFA etc.); with current and active membership is required.\n• A minimum of eight (8) years of professional experience in financial management, accounting or auditing or audit coordination is required.\n• A specialized designation such as CIA, CISA, CFE is an added advantage.\n• Training in internal or external audit is highly desirable.\n• Advanced knowledge of Microsoft Office suite, especially Word and Excel is required.\n• Knowledge of and experience with International Public Accounting Standards (IPSAS) and/or International Financial Reporting Standards (IFRS) is highly desirable.\n• Previous work experience within an international organization and/or large corporation is highly desirable.\n• Prior knowledge and hands-on experience in database packages, web-based management systems (SharePoint) and an Enterprise Resource Planning system (ERP), i.e. SAP financial modules), is considered an asset.\n• Fluency in English (verbal and written) is required. Knowledge of another UN Language (French, Arabic, Chinese, Russian, Spanish) is considered an asset\n\nFor every Child, you demonstrate...\n\nUNICEF’s Core Values of Care, Respect, Integrity, Trust and Accountability (CRITA) underpin everything we do and how we do it. Get acquainted with Our Values Charter: https://uni.cf/UNICEFValues\n\nUNICEF competencies required for this post are…\n\n(1) Builds and maintains partnerships (2) Demonstrates self-awareness and ethical awareness (3) Drive to achieve results for impact (4) Innovates and embraces change (5) Manages ambiguity and complexity (6) Thinks and acts strategically (7) Works collaboratively with others (8) Nurtures, leads and manages people. During the recruitment process, we test candidates following the competency framework. Familiarize yourself with our competency framework and its different levels: competency framework here.\n\nUNICEF is committed to diversity and inclusion within its workforce, and encourages all candidates, irrespective of gender, nationality, religious and ethnic backgrounds, including persons living with disabilities, to apply to become a part of the organization.\n\nWe offer a wide range of benefits to our staff, including paid parental leave, breastfeeding breaks and reasonable accommodation for persons with disabilities. UNICEF strongly encourages the use of flexible working arrangements.\n\nUNICEF has a zero-tolerance policy on conduct that is incompatible with the aims and objectives of the United Nations and UNICEF, including sexual exploitation and abuse, sexual harassment, abuse of authority and discrimination. UNICEF also adheres to strict child safeguarding principles. All selected candidates will be expected to adhere to these standards and principles and will therefore undergo rigorous reference and background checks. Background checks will include the verification of academic credential(s) and employment history. Selected candidates may be required to provide additional information to conduct a background check.\n\nRemarks:\n\nMobility is a condition of international professional employment with UNICEF and an underlying premise of the international civil service.\n\nUNICEF appointments are subject to medical clearance. Issuance of a visa by the host country of the duty station, which will be facilitated by UNICEF, is required for IP positions. Appointments are also subject to inoculation (vaccination) requirements, including against SARS-CoV-2 (Covid). Government employees that are considered for employment with UNICEF are normally required to resign from their government before taking up an assignment with UNICEF. UNICEF reserves the right to withdraw an offer of appointment, without compensation, if a visa or medical clearance is not obtained, or necessary inoculation requirements are not met, within a reasonable period for any reason.\n\nOnly shortlisted candidates will be contacted and advance to the next stage of the selection process", "occupation": "business analyze"}]}