{"url": "https://www.google.com/search?q=C%2B%2B+in+Toronto&ibp=htl%3Bjobs&sa=X&hl=en", "jobs": [{"title": "C++ Developer, GFI Software (Remote) - $100,000/year USD", "company": "Crossover", "location": "Toronto, ON", "via": "via LinkedIn", "time": "20 hours ago", "type": "Full-time and Contractor", "salary": "none", "links": ["https://ca.linkedin.com/jobs/view/c%2B%2B-developer-gfi-software-remote-%24100-000-year-usd-at-crossover-3758769957?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Crossover is the world's #1 source of full-time remote jobs. Our clients offer top-tier pay for top-tier talent. We're recruiting this role for our client, GFI Software. Have you got what it takes?\n\nAre you a senior software engineer known for successfully delivering product releases? Do you thrive in challenging environments and possess the strategic mindset to guide teams toward success? If this resonates with you, GFI Software has an exceptional opportunity: step into a leadership role and spearhead transformative projects that redefine the frontiers of software engineering.\n\nThe industry often overlooks the dynamic and diverse SMB segment; at GFI, we're pioneering a different path. We focus exclusively on SMBs, offering tailored IT tools that provide tangible impacts, creating a stimulating and rewarding work environment.\n\nIn this role, you will be responsible for driving product releases and ensuring quality deliveries within time, budget, and defined scope. You will develop... cutting-edge networking and communications solutions and leverage your expertise in C++ to architect innovative software. Unlike typical managerial positions, you will actively participate in technical decision-making, as well as coaching, thriving on both hard and soft skills.\n\nAs part of a collaborative and dedicated team, you'll drive strategic execution, make data-driven impacts, and spark innovation by encouraging exploration of new tools and methods for improvement. This role is a gateway to continuous learning and growth, where you will learn advanced networking techniques and security-first software design.\n\nIf you're a senior engineer with the right mix of technical prowess, leadership, and passion for innovation, don't miss this chance to join us at GFI. Apply now and make your mark on the software engineering landscape!\n\nWhat You Will Be Doing\n• Organizing and ensuring the quality and timely delivery of product releases within defined scope and budget\n• Serving as the technical leader for GFI's engineering team, making critical decisions on software implementation\n• Coaching the C++ software engineers on both hard and soft skills, fostering professional growth and team cohesion\n\nWhat You Won’t Be Doing\n• Micro-managing - at GFI, you won't be bogged down with micromanaging but will instead focus on strategic leadership\n• Stagnating in technology - you won't be stuck working on outdated technologies; you'll drive cutting-edge solutions\n• Focusing on larger enterprises - we are dedicated to providing software solutions for small and medium-sized businesses\n\nC++ Developer key responsibilities\n\nBasic Requirements\n• 5+ years of professional experience in C++ development\n• 2+ years of experience in either the network communications or security domain\n• Demonstrated experience in leadership and mentoring\n• A grasp of AI, Large Language Models (LLMs), and prompt engineering, including Chain-of-Thought (CoT) prompting and Self-Consistency in CoT\n\nAbout GFI Software\n\nGFI Software develops essential applications for small and medium businesses. Over 80,000 customers choose GFI solutions for network management and performance, security, and collaboration applications. GFI Software available through thousands of channel partners dedicated to serving specific countries and regions worldwide.\n\nGFI has a fully remote, global workforce. GFI has partnered with Crossover to administer its hiring and global workforce management.\n\nThere is so much to cover for this exciting role, and space here is limited. Hit the Apply button if you found this interesting and want to learn more. We look forward to meeting you!\n\nWorking with Crossover\n\nThis is a full-time (40 hours per week), long-term position. The position is immediately available and requires entering into an independent contractor agreement with Crossover. The compensation level for this role is $50 USD/hour, which equates to $100,000 USD/year assuming 40 hours per week and 50 weeks per year. The payment period is weekly. Consult www.crossover.com/help-and-faqs for more details on this topic.\n\nWhat to expect next:\n• You will receive an email with a link to start your self-paced, online job application.\n• Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.\n\nImportant! If you do not receive an email from us:\n• First, emails may take up to 15 minutes to send, refresh and check again.\n• Second, check your spam and junk folders for an email from Crossover.com, mark as “Not Spam” since you will receive other emails as well.\n• Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.\n• If all else fails, just reset your password by visiting https://www.crossover.com/auth/password-recovery if you already applied using LinkedIn EasyApply.\n\nCrossover Job Code: LJ-5104-CA-Toronto-C++Developer.007", "occupation": "C++"}, {"title": "Principal C++ Software Engineer", "company": "Morningstar", "location": "Toronto, ON", "via": "via Morningstar Jobs", "time": "22 days ago", "type": "Full-time", "salary": "none", "links": ["https://careers.morningstar.com/us/en/job/REQ-040102/Principal-C-Software-Engineer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.workopolis.com/jobsearch/viewjob/i-H7Vgk3F07_er10iFVIJu7VM1pVwlNDv-0jzMogQUJg7M4tLtH1T5a8azj40RU3?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ca.bebee.com/job/20231022-e759c8e76a2a827c0bafd82068769035?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ca.linkedin.com/jobs/view/principal-c%2B%2B-software-engineer-at-morningstar-3709858031?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ca.talent.com/view?id=701a8af86b61&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.bwam.network/companies/morningstar/jobs/30569700-principal-software-engineer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.levels.fyi/jobs?jobId=110586750188823238&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.eluta.ca/spl/principal-software-engineer-d63ac8afb3e5f6f8404a4c56de8d74af?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "About the role:\n\nAt Morningstar, helping investors is what brings us together and drives our work. Data and Direct Products is looking for a smart and energetic Principal Software Engineer who thrives in a fast-paced environment to join the Direct Core Application team. In this role, you will collaborate with Data and Direct Products internal/external customers, senior managers, product owners, project managers, QA and other developers to design, develop and support technology solutions for Morningstar’s Direct Investment Analysis Platform using C# and Windows C++. You will build and support the existing application and systems, study their architecture and complexities. Design, develop and implement new solutions with modern software development practices. You should have a strong understanding of object-oriented principles and design patterns, familiarity with multiple programming languages, and exposure to a variety of architectures and AWS. You will grow with us, introduce us to... new ideas and develop products that empower our users. You will have product ownership and responsibility for ensuring process and quality adherence through peer reviews, code reviews, test coverage and best practices. You will act as the software guardian, owning non-functional requirements, architectural direction, and the quality of the code while addressing technical debt. Every day, you will work with team members across disciplines developing products for investors. You will interact daily with our product managers to understand our domain and create technical solutions that push us forward. We want to work with engineers who bring knowledge and excitement about our opportunities. This position is based in our downtown Toronto office.\n\nJob responsibilities:\n• Drive innovations.\n• Lead application development, develop and mentor other members of the development team.\n• Design and implement software solutions that meet product requirements and quality needs with respect to functionality, performance, scalability, reliability, timeline and adherence to team goals and principles.\n• Be a role model to the team to collaborate on good object-oriented designs & domain modeling, promote usability and coding best practices, reinforce good development practices.\n• Develop areas of continuous and automated deployment.\n• Introduce and follow good development practices, innovative frameworks and technology solutions that help business move faster.\n• Follow best practices like estimation, planning, reporting, and improvement brought to processes in everyday work.\n• Providing support for applications in production in terms of deployment, trouble shooting and incident management.\n• Take ownership of the success of the team with a \"gets things done\" attitude; the ability to understand and leverage new technologies, potentially wearing many hats including business analyst, engineer, QA, and project manager.\n• Help to shape product vision.\n• Stay up to date on emerging technologies.\n\nQualifications:\n• A bachelor's in Computer Science or related, plus 10+ years of experience leading software application development.\n• At least 8 years of object-oriented experience (C++ required, Python optional) in a commercial application or commercial service environment.\n• Wide experience in using AWS computing, storage, database and security technologies.\n• Experience in implementing AWS cloud first architecture like Lambdas, ECS, EC2/Fargate, S3, RDS DB, API gateway, Serverless, Redis Cache, SQS, ASG/LB/TG, Cloudwatch and Code Pipeline.\n• Minimum 5 years of hands-on experience in JavaScript/Node.js, C++, C#/.NET, or Java.\n• Solid understanding of computer science fundamentals: data structures, algorithms, design patterns.\n• Experience with Agile methodology and tools like JIRA.\n• Be organized and able to remain productive even when you have multiple deliveries.\n• Experience with Java, Linux, and Tomcat, as well as experience with full-stack web development.\n\nNice to have:\n• Experience with Visual C++, Win32, MFC.\n• Experience with .NET.\n• Familiarity with the financial services domain (accounts, portfolios, holdings, returns, performance streams, traded instruments, etc)\n• Experience scaling web-based software applications and services.\n• An understanding of how to protect applications and services from common security vulnerabilities.\n• Experience working on databases like MSSQL, Postgres or any other relational database.\n• Experience with Amazon Web Services technologies like CloudFront, S3, API gateway, ECS, Elastic Search, and ElastiCache.\n• Experience with Agile methodology and tools like JIRA.\n• AWS certified developer certification.\n\n100_MstarResCanad Morningstar Research, Inc. (Canada) Legal Entity\n\nMorningstar’s hybrid work environment gives you the opportunity to work remotely and collaborate in-person each week. We’ve found that we’re at our best when we’re purposely together on a regular basis, at least three days each week. A range of other benefits are also available to enhance flexibility as needs change. No matter where you are, you’ll have tools and resources to engage meaningfully with your global colleagues", "occupation": "C++"}, {"title": "C++ Developer", "company": "Continental Technology Solutions", "location": "Toronto, ON", "via": "via SmartRecruiters Job Search", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://jobs.smartrecruiters.com/ContinentalTechnologySolutions/743999658992410-c-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company Description\n\nContinental Technology Solutions is Our consulting and managed services deliver the resources and capabilities required to assess,design, build and manage an agile, flexible IT environment. You'll work with one dedicated team from strategy and assessment through design, implementation, management and optimization to reach a true end-to-end solution.\n\nJob Description\n\nC++ Roles @Toronto, ON\nJob description:\nTechnical Skills:\n-Strong knowledge in C++,XML ,\n-Thorough knowledge of the standard library, STL containers, and algorithms\n-Good understanding of memory management in non-garbage collected environments\n-Understanding of dynamic polymorphism and C++ specific notions, such as friend classes\n-Familiarity with templating in C++\n-Good knowledge of Linux/UNIX Scripting, PERL, ANT and or other shell scripting\n- Working knowledge code versioning using tools like CVS, SVN, GIT\n-Ability to write clear and concise technical documents\n- Ability and willingness to develop... documentation on technical architecture, system designs and hardware/software/application configurations and operations\n·Ability to effectively manage multiple activities of varying complexity while under time constraints\n·Ability to work independently with minimal supervision and also perform as part of a team\n·Ability to work well under pressure to meet deadlines\n\nAttributes:\n• 4 to 6 years of experience in C++, Linux and XML\n• Analytic/Systematic Thinking\n• Relationship Building\n• Teamwork & Partnering\n• Thorough\n• Interpersonal Relations\n• Leadership/ Leading Others\n• Problem Solving & Decision Making\n• Time & Self Management\n• Communication\n• Building Trust\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "occupation": "C++"}, {"title": "C++ Software Engineer", "company": "ION", "location": "Toronto, ON", "via": "via Workopolis", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.workopolis.com/jobsearch/viewjob/ag1I1BfncSDgi106CmXVEz08xqX6QB3VCHnDE4HPy62QA9aw1xLjiei1kK37YYY9?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "The Role\n\nSoftware Engineers/Server-Side develop state-of-the-art C++ applications for our groundbreaking automated foreign exchange platform. You will own (typically multiple months-long) development projects end-to-end, from conception through support and maintenance, including many fast-cycle version iterations. As part of our remarkably high-performing team of collaborative, talented engineers, you will have significant freedom and self-direction to tackle a wealth of interesting, challenging problems as we push the technological envelope.\n\nKey Responsibilities\n• Work in C++ and Python to design, implement, and release state-of-the-art components and applications for mission-critical, high-performance, globally distributed systems related to automated trading\n• Produce exemplary code and deliver completed projects on time\n• Create and track project plans and convey status, issues and risks effectively\n• Perform unit and system level testing on your application and all affected... systems\n• Work closely with customer-facing technical consultants to ensure that development efforts truly meet customer needs\n• Work closely with technical leads to ensure effective coordination and integration between interrelated projects\n• Play a key role in the development of best practices in software design, implementation, and coding standards\n• Lead and mentor junior engineers\n\nRequired Skills, Qualifications and Experience\n• Exceptional programming skills and grasp of software engineering principles with 5 or more years programming in C++\n• Demonstrated success managing development projects end-to-end with significant ownership over technical decision-making\n• Knowledge of at least one scripting language (Perl, Python, Ruby, JavaScript, etc.)\n• Familiarity with SQL and databases\n• Bachelor’s or advanced certificate in STEM field or equivalent experience\n\nPreferred\n• Experience with real-time distributed systems and fast-cycle iterations\n• Enterprise software experience or experience with financial software and/or financial trading\n• Experience with financial broker/exchange APIs (e.g. price feeds, order execution)\n\nAbout us\n\nWe’re a diverse group of visionary innovators who provide trading and workflow automation software, high-value analytics, and strategic consulting to corporations, central banks, financial institutions, and governments. Founded in 1999, we’ve achieved tremendous growth by bringing together some of the best and most successful financial technology companies in the world.\n\nOver 2,000 of the world’s leading corporations, including 50% of the Fortune 500 and 30% of the world’s central banks, trust ION solutions to manage their cash, in-house banking, commodity supply chain, trading and risk.\n\nOver 800 of the world’s leading banks and broker-dealers use our electronic trading platforms to operate the world’s financial market infrastructure.\n\nWith over 10,000 employees and offices in more than 40 cities around the globe, ION is a rapidly expanding and dynamic group.\n\nAt ION, we offer careers that provide many opportunities: To invent. To design. To collaborate. To build. To transform businesses and empower people around the world to do more, faster and better than before. Imagine what you can do and experience. This is where you can do your best work.\n\nION is committed to maintaining a supportive and inclusive environment for people with diverse backgrounds and experiences. We respect the varied identities, abilities, cultures, and traditions of the individuals who comprise our organization and recognize the value that different backgrounds and points of view bring to our business.\n\nION adheres to an equal employment opportunity policy that prohibits discriminatory practices or harassment against applicants or employees based on any legally impermissible factor", "occupation": "C++"}, {"title": "C++ Developer", "company": "Apple One", "location": "Toronto, ON", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.ca/job/3myStPjd7N8a5mUECnKMFKfBNNin68Nros0T3hB6TCxoUfjnxmjsIQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "C++ Developer/ Software Developer\n\nJob Ref: FC 568\n\nLocation: Etobicoke\nJob Type: Permanent\n\nCompensation: up to $ 90,000 + Bonus\n\nPerks: Medical, Dental & Vision benefits\nOpportunities for career advancement\nTransit Accessible Location\n\nDuties and Responsibilities:\n• Ability to collaborate with team members and external stakeholders to determine project requirements\n• Can research and recommend technologies that may improve product function\n• Design and Implement new features or products based on agreed requirements\n• High attention to detail when providing solutions\n• Excellent debugging and problem solving skills\n• Ability to identify and resolve deficiencies within various software components\n• Continuously learn and improve your own skills\n• Can manage time and task priority effectively\n• Work independently when required\n• Good English communications skills (oral and written)\n\nRequirements:\n• Proficient in C, C++/Visual C++ development\n• Symbols debugging experience\n• Knowledge... of MSI Installer technology is desirable\n• Proficiency in Java, C#, Visual Basic and web content development a plus\n• Understanding of Relational Database design and implementation\n• Experience in developing multi-threaded applications\n• Excellent analytical and problem solving skills\n• Excellent ability to learn new technologies quickly\n• Excellent written and verbal communication skills\n\nSalary: $90,000.00 per year\n\nExperience:\n• C++ OR Visual C++: 3 years (Required", "occupation": "C++"}, {"title": "C++ Developer", "company": "Techedin", "location": "Toronto, ON", "via": "via LinkedIn", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://ca.linkedin.com/jobs/view/c%2B%2B-developer-at-techedin-3688713217?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Looking for a C++ Developer.\n\nHere is the job description, please have a look at it.\n\nResponsibilities:-\n\nSDK Development\n• Collaborate with the engineering team to design, develop, and enhance the Licensing SDK.\n• Ensuring it meets the highest standards of quality, performance, and security.\n\nMulti-Platform Development\n• Utilize your expertise in C++ development to create.\n• Optimize SDK components for multiple platforms, including Windows, macOS, and Linux.\n\nFull Stack Contributions\n• Contribute to both front-end and back-end development tasks.\n• Assignments for various component upgrades, tests, and bug investigations to deliver.\n• Tthe highest possible quality for licensing integration needs.\n\nCICD Automation\n• Contribute to maintaining a robust, green CICD automation pipeline using Jenkins.\n\nQualifications:-\n\nBachelor's degree in Computer Science, Software Engineering, or a related field.\n\n7-8 years of professional experience as a C++ developer, with demonstrable expertise in... multi-platform development.\n\nGood hands on experience with Python and some experience in Licensing security.\n\nWorking experience with AWS.\n\nStrong experience with CI/CD automation tools, preferably Jenkins.\n\nProven proficiency in full stack development, including front-end and back-end technologies.\n\nFamiliarity with Scrum methodologies and Agile development practices.\n\nExcellent problem-solving and analytical skills with strong attention to detail", "occupation": "C++"}, {"title": "Software Developer - C++", "company": "CAST Group of Companies", "location": "Toronto, ON", "via": "via Indeed", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://emplois.ca.indeed.com/voir-emploi?jk=806c6a807b019888&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.workopolis.com/jobsearch/viewjob/G1NtbTTykp045F7WzqGBamKf7CR2jMV_3OAzEaeey57FXYHimq96NY7m6NsOS1Gi?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.glassdoor.ca/job-listing/software-developer-c-roots-group-of-companies-JV_IC2281069_KO0,20_KE21,45.htm?jl=1008048414270&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.simplyhired.ca/job/ly-BiVWYhXAOfc1Y0f4jvhw9OTAsJJAdJuD3URc4NZT0nkMI2jYBMg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "About CAST :\n\nCAST Software has been in business for over 25 years, and today we deliver the modelling, design and previsualization software tools of choice to professionals in the lighting design and events & entertainment production industries. We are driven by passion, creativity and technology and we love nothing more than to see the results of projects created with our software in theatre, concerts and other live entertainment productions, as well as TV and film. You will be part of the team which provides technical assistance to the customers who use our award winning products. wysiwyg, the first 3D lighting previsualization software ever developed, continues to be a leader in its market today and is used around the world. Vivien, our Event Planning software, offers planning and previsualization tools customized for event planning professionals. BlackTrax, a real-time 6D tracking system that tracks actors, objects, and props in order to control moving lights, media servers and... projection, spatial audio, robotic cameras, and more. You may have seen the results of our software’s contributions in productions like the Olympics Opening/Closing Ceremonies, the Super Bowl halftime shows, Eurovision Song Contests, Dancing with the Stars, various Cirque du Soleil and Disney shows, in concerts of bands & DJs such as U2, Muse, Goo Goo Dolls, The Chainsmokers and Dimitri Vegas & Like Mike, or even for the architectural lighting of Buckingham Palace for the Queen’s Diamond Jubilee in 2012 and in our own city for the Bloor Viaduct (for the Toronto 2015 Pan Am games), just to name a few.\n\nAbout the Position :\n\nAs a C++ Software Developer, you will work on different CAST products. You will report to the respective Development Team Lead and be assigned features and tasks as described in the current release. You will be part of a small team so you will have an opportunity to work on large features for the software.\n\nRequirements:\n• Familiarity with Object Oriented Programming Concepts\n• Familiarity with Data Structures and containers.\n• Skilled in object-oriented software design and development.\n• C++ development experience (Min 3 Yrs).\n• Knowledge of GUI development.\n\nBonus :\n• Knowledge of TCP/IP protocol and network programming\n• Familiarity with Visual Studio IDE and Qt\n• IRA, SVN, Git or other project management tools.\n• Exposure to STL, boost library or other C++ containers, and build automation\n• Some experience with Unicode, OpenGL or D3D to develop 3D graphics, and/or real-time programming, AutoCAD & other 3D CAD types\n• Firmware development experience for small hardware devices\n• Bonus marks for: MEMS sensor technology, 2.4 GHz wireless communication and/or RF communication\n\nSoft skills:\n• You’ll need to play well with others as one of an extremely dedicated team -- a small but solid group -- that will push you to grow.\n• You will need good verbal communications skills and be able to present and defend your ideas with the team, outside technology providers, and management\n• Continue to maintain strong expertise and knowledge of current and emerging technologies\n• Enthusiastic, dedicated and ready to conquer the challenging tasks with self study and research in adequate time.\n\nLocation :\n\nCAST is located at 35 Ripley Avenue, Suite 1 on the southwest side of Toronto, ON (tel: 416.597.2278). You can drive or take the TTC (Queen streetcar to South Kingsway and walk a block, or the subway to Runnymede and a short bus ride), or bike it in the summer.\n\nContact :\n\nPlease click the APPLY NOW button to submit your application. We will reply to you if you have been shortlisted", "occupation": "C++"}, {"title": "C++ Developer", "company": "MindPal", "location": "Toronto, ON", "via": "via LinkedIn", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://ca.linkedin.com/jobs/view/c%2B%2B-developer-at-mindpal-3707106396?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ca.bebee.com/job/20231029-739077fe3f4201781dc10cef23495293?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ca.trabajo.org/job-850-20231108-e50548767cf7c13b60443897baa7d060?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ca.talent.com/view?id=b8fcb94fd2c9&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "We are looking for C++ Developer\n\nResponsibilities\n\nThe duties of C++ Developer will include designing and implementing software solutions using C++, including designing and implementing algorithms, data structures, and programming interfaces. The programmer will also be responsible for testing and debugging code, as well as maintaining and developing existing software.\n\nRequirements\n• Experience in programming in C++ language\n• Knowledge of design patterns and good programming practices\n• Ability to work in a team and communicate effectively\n• English language proficiency enabling smooth communication\n\nNice To Have\n• Implementation of beacon signal detection functionality\n• Experience in programming in other object-oriented languages, such as Java or C#\n• Knowledge of version control systems, such as Git\n• Knowledge of libraries and frameworks, such as Boost or STL\n• Knowledge of operating systems, such as Linux or Windows\n\nWe Offer\n• B2B contract type\n• Full-time job\n• Remote and... flexible working hours", "occupation": "C++"}, {"title": "Senior C++ Developer", "company": "Yoush Consulting", "location": "Toronto, ON", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.ca/job/bkteTcE2bgYY-qoi85N3nRmaJE8cGI2Qsh-fHXziZkjBskWPiN__ag?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Summary\n\nOur client is looking for candidates who are sought to work on leading-edge geo-distributed data management system research and development for scalable high-performance, highly available, distributed database systems/file systems/storage system/cache system to support transactional and analytic applications in the cloud across data centers.\n\nThe ideal candidates must enjoy tackling technical challenges by creating innovative solutions, and should have significant knowledge and experiences in distributed systems, consensus algorithms, replication, database/file/storage/cache system internal structures, transaction processing, high availability, database storage engines etc. Other important attributes are versatility and a passion for building high-quality enterprise-class software systems.\n• Research and development of a geo-distributed, highly available, reliability data management system.\n• Analyze requirements, design and evaluate key technologies of distributed... transactions, replication, and consistency techniques to meet the requirements.\n• Work with a team of architects and engineers to develop proof-of-concept systems and components.\n• Write and maintain architecture and detailed design specifications.\n• Perform design, implementation and code reviews.\n• Review test specifications.\n\nRequired Education, Skills and Qualifications\n\nRequirements\n• Minimum 5 years of experience in research and development of distributed data management system (databases/file system/storage/cache system) with PhD in CS or a relevant field, or 8 years of experience with a Master's, or 10 years of experience with a Bachelor’s Degree.\n• Experience with distributed system is required.\n• Proficient in C and C++ programming is required.\n• Extensive experience with design and development of a distributed database, or storage system, or file system, or cache system is required.\n• Experience in Aws EFS/ Ceph/ HDFS/ GPFS/ Gluster/ pNFS/ Alluxio /Redis/ Memcached/ Ignite a plus.\n• Experience in Microsoft SQL Azure/ Aws RDS Aurora/ Google F1\n\nJob Type: Full-time", "occupation": "C++"}, {"title": "Junior - Senior C++ Programmer", "company": "WATERFRONT INTERNATIONAL LTD.", "location": "Toronto, ON", "via": "via Indeed", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://ca.indeed.com/viewjob?jk=3c817b5906523250&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Waterfront International is a Toronto-based financial consulting firm, specializing in developing computer based statistical trading strategies. Waterfront¿s selective hiring process considers only highly talented individuals with a history of exceptional professional and academic achievement, and solid real-world experience.\n\nPrimary Responsibilities:\n\nMaintain existing real time data processing servers\n\nDesign, code and test new applications ensuring correctness\n\nWork closely with analysts and other groups to provide software solutions\n\nMonitor performance of programs after implementation\n\nTroubleshoot and resolve application problems\n\nKey Technologies:\n\nUNIX, C/C++, Sybase, Tibco/Rv and other various third party solutions\n\nRequirements of the Candidate include:\n\n3+ years of professional C/C++ programming experience\n\nUniversity education with background in computer science or related field\n\nProven analytical and creative ability in developing business applications\n\nExcellent... programming skills in fast paced production environment\n\nExcellent analysis and problem solving skills\n\nDemonstrated ability to work independently under minimum supervision\n\nKeen desire for continuous learning\n\nExperience with multithreaded applications preferred but not required\n\nCandidates with limited to no experience can apply for the Jr C++/Unix Programmer position.\n\nWaterfront International\n\nEmail: recruiting@wil.com\n\nApply Via Email\n\nrecruiting@wil.com", "occupation": "C++"}, {"title": "C++ Developer (Storage Domain)", "company": "Q1 Technologies", "location": "Toronto, ON", "via": "via Workopolis", "type": "Full-time and Contractor", "time": "none", "salary": "none", "links": ["https://www.workopolis.com/jobsearch/viewjob/hrcNpCcC4VxU2btcMmf9VeB6CzoFx_22SwEmPYd2JRUIIvxCH-hPiVeSVJksqS8G?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Role: C/C++ Developer\n\nJob Location: Toronto, ON(Onsite)\n\nDuration: Contract\n\nInterview: Telephonic/Skype\n\nJob Description:\n\nSkills Needed -\n• 5+ years of experience in the industry working on an Enterprise product.\n• Experience in Storage Domain and Backup/Recovery technology\n• Any programming language experience is required. Preferably C or C++\n• Exposure to client, server concepts or Socket programming in any language.\n• Platform: Windows AND LINUX – hands-on experience in system commands and tools\n• Excellent communication skills – both verbal and written.\n• Education: Masters, Bachelors or relevant technical degree\n\nTools:\n• Wireshark for TCP dump analysis,\n• GDB/WinGDB for Core dump analysis\n• CVS / SVN / GIT – any of the version control tools.\n• Bug tracking tools (Bugzilla, JIRA or equivalent).\n• Experience in understanding of customer engineering and support functions.\n• Exposure in creating builds, debug binaries and using scripts for resolving customer issues\n\nJob Type... Full-time\n\nSalary: $55.00-$60.00 per hour\n\nSchedule:\n• On call\n• Weekend availability\n\nAbility to commute/relocate:\n• Toronto, ON: reliably commute or plan to relocate before starting work (required)\n\nExperience:\n• C++ Developer: 7 years (preferred)\n• Storage Domain/ backup: 6 years (preferred", "occupation": "C++"}, {"title": "C & C++ Language Online Training - India UK", "company": "Classifieds Home", "location": "Toronto, ON", "via": "via Learn4Good", "time": "2 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.learn4good.com/jobs/online_remote/teaching/2685540239/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Position: C & C++ Language Online Training - India, USA, UK\nLocation: Old Toronto\n\nPosted on:Tuesday, 24 October, 2023\nExpires On:Thursday, 23 November, 2023\nReply to:(Use contact form below)\n\nC & C++ Language Online Training One of the top providers of online IT training worldwide is VISWA Online Trainings. To assist beginners and working professionals in achieving their career objectives and taking advantage of our best services, we provide a wide range of courses and online training.\n\nThe foundation of your future profession in the C and C++ Online Course from India » is a quality training curriculum, and Viswa Online Trainings is aware of the importance of this. For both novices and experts, our Best C++ Training Hyderabad offers in-depth C and C++ Online Training » . You may quickly resolve your doubts and receive the precise assistance that is needed from C & C++ Online Training from India » because you have access to knowledgeable trainers and instructor-led training... sessions.\n\nKey Features:\nFlexible Timings Certified & Industry Experts Trainers Customize Course 24/7 Support Hands On Experience Best Practices / Example Case Studies Real Time Use Cases Job Assistance with Trainers Lab Facilities Video class recordings\n\nSo, let’s get started with us!\n\nRegister here For Free Demo >> » »\n\nRelated offered courses:\n\nJAVA, Dot Net, Oracle, Dell Boomi…. Etc.\n\nIt is ok to contact this poster with commercial interests.\n\nAttachment:\nThe following file types are not allowed: exe, com, bat, vbs, js, jar, scr, pif\nMaximum file size: 200KB\n#J-18808-Ljbffr", "occupation": "C++"}, {"title": "C & C++ Language Online Training - India, USA, UK, Canada", "company": "Classifieds Home", "location": "Toronto, ON", "via": "via Trabajo.org", "time": "2 days ago", "type": "Full-time", "salary": "none", "links": ["https://ca.trabajo.org/job-1262-20231106-67d0b747752c954ce12973a872d8e2dc?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ca.jooble.org/jdp/7022608867460656480/C-%26-C%2B%2B-Language-Online-Training-+-India%2C-USA%2C-UK%2C-Canada-Toronto%2C-ON?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Posted on: Tuesday, 24 October, 2023\nExpires On: Thursday, 23 November, 2023\nReply to: (Use contact form below)\n\nC & C++ Language Online TrainingOne of the top providers of online IT training worldwide is VISWA Online Trainings. To assist beginners and working professionals in achieving their career objectives and taking advantage of our best services, we provide a wide range of courses and online training.The foundation of your future profession in the C and C++ Online Course from India » is a quality training curriculum, and Viswa Online Trainings is aware of the importance of this. For both novices and experts, our Best C++ Training Hyderabad offers in-depth C and C++ Online Training » . You may quickly resolve your doubts and receive the precise assistance that is needed from C & C++ Online Training from India » because you have access to knowledgeable trainers and instructor-led training sessions.Key Features: Flexible Timings Certified & Industry Experts Trainers Customize... Course 24/7 Support Hands On Experience Best Practices / Example Case Studies Real Time Use Cases Job Assistance with Trainers Lab Facilities Video class recordingsSo, let’s get started with usRegister here For Free Demo >> » »\n\nRelated offered courses:JAVA, Dot Net, Oracle, Dell Boomi…. Etc.\n\nIt is ok to contact this poster with commercial interests.\n\nAttachment:\nThe following file types are not allowed: exe, com, bat, vbs, js, jar, scr, pif\nMaximum file size: 200KB\n#J-18808-Ljbffr", "occupation": "C++"}, {"title": "Senior C/C++ Developer", "company": "IQ Hunt Ltd.", "location": "Toronto, ON", "via": "via LinkedIn", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://ca.linkedin.com/jobs/view/senior-c-c%2B%2B-developer-at-iq-hunt-ltd-3650001706?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.workopolis.com/jobsearch/viewjob/0D62Q_obaOQ8-qoa05nXFSVixNJLyPRQgbQONHEmLc3go8OdxQ0bbC2syMEPKqUf?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Our Client is seeking an experienced Senior C/C++ Engineer to oversee the design and\n\nimplementation of code based on specific user requirements.\n• Writing high quality, performant, reliable and easy to maintain code.\n• Take ownership of projects, features and microservices from start to finish, including design, implementation, testing, and launch.\n• Modifying and/or contributing to existing open source projects to match the needs of the project\n• Collaborating with other developers in a team environment to develop applications.\n• Analyzing requirements to determine best approaches for implementing new features or fixing bugs.\n• Mentoring less experienced developers.\n• Understanding and advocating for the needs of the users.\n• Testing new features to ensure that they work as intended.\n• Recommending changes to existing code to improve its functionality.\n• Other duties, as assigned.\n\nRequirements:\n• Expert level experience writing clean, maintainable, and well-documented code with the... C/C++ programming language.\n• Proven success working with advanced data structures and algorithms.\n• Significant experience working with secure coding practices.\n• Highly detail-oriented mindset and willingness to learn.\n• Ability to be innovative, with excellent problem-solving skills, and the ability to turn ambiguous problems into clear solutions.\n\nPreferred Qualification:\n• Experience administering and configuring servers and virtual machines.\n• Knowledge of SQL and data store technologies\n• Multithreaded programming.\n• Sockets API programming.\n\nDesired Qualifications:\n• Experience in other programming languages such as Rust, PHP, Javascript, Java, Python\n• Ability to optimize heavy applications and have an understanding of the lower-level functionality that can contribute to the problem.\n• Understanding of the various problems that may exist when latency between servers is introduced, and writing code that is resilient to network latency and intermittency issues.\n• Experience with any of the following languages: Rust, PHP, Golang", "occupation": "C++"}, {"title": "Senior C++ Software Developer/Engineer", "company": "S&P Global", "location": "Toronto, ON", "via": "via Workopolis", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.workopolis.com/jobsearch/viewjob/hnELCdxT6rkoctmTHcc6UsOZaLSDKT3pPA5TQ2nqX24CGFLOoVv-Rv9psJp3XQKM?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "The Role: Senior Software Engineer (C++)\n\nThe Team: We are a cross-functional agile team that develops and maintains products that support realtime market data quoting. Providing value-added backend vendor data to our clients and Front-end teams.\n\nThe Impact: We are continually developing and improving our applications, which is where you come in. We are looking for creative, talented, and motivated developers who have a passion for solving difficult problems. We need software engineers who can help us develop and maintain systems that are always online and can handle hundreds of thousands of transactions per second. Much of our time is spent focusing on developing new capabilities or reworking and enhancing legacy capabilities, necessitating strong design skills which will lead to robust solutions.\n\nBasic Qualifications\n\nProficiency in Modern C++. We write code primarily in C++ using features from C++11/14/17/20.\n\nBachelor’s and/or master’s degree in computer science or related... technical discipline or demonstrated projects if self-taught.\n\nStrong knowledge of computer science fundamentals, algorithms, and data structures.\n\nExperience with SQL databases.\n\nPreferred Qualifications\n\nReal-time event processing background and high-throughput optimization skills.\n\nExperience with concurrent programming and distributed systems.\n\nBackground in the financial markets, economic theory, or statistics.\n\nExperience with technology systems among CMake, and Git\n\nExperience with CI/CD pipelines and building a large codebase using automation tools.\n\nThis role is limited to persons with indefinite right to work in the United States.\n\nWhy work with us\n\nHappy developers are productive developers. We understand your desire to have a good work and life balance.\n\nWe hold regular code reviews to ensure our software is of the highest quality and so that we can all learn from each other. We regularly collaborate via whiteboard design sessions and virtual sessions. We constantly challenge our own assumptions and never accept “because that is the way we’ve always done it” as a justification.\n\nFlexible Working (optional)\n\nWe pride ourselves on our agility and diversity, and we welcome requests to work flexibly. For most roles, flexible hours and/or an element of remote working are usually possible. Please talk to us at the interview about the type of arrangement that is best for you. We will always try to be adaptable wherever we can.\n\nThe Location: Boulder, CO, London, Ontario or 100% remote\n\nCompensation/Benefits Information:\n\nS&P Global states that the anticipated base salary range for this position is $80,000– $146,000 . Final base salary for this role will be based on the individual’s geographical location as well as experience and qualifications for the role.\n\nIn addition to base compensation, this role is eligible for an annual incentive plan. This role is not eligible for additional compensation such as an annual incentive bonus or sales commission plan.\n\nThis role is eligible to receive additional S&P Global benefits. For more information on the benefits, we provide to our employees, please click here .\n\nAbout Company Statement:\n\nS&P Global delivers essential intelligence that powers decision making. We provide the world’s leading organizations with the right data, connected technologies and expertise they need to move ahead. As part of our team, you will help solve complex challenges that equip businesses, governments, and individuals with the knowledge to adapt to a changing economic landscape.\n\nS&P Global Market Intelligence partners with customers to broaden their perspective and operate with confidence by bringing them leading data sources and technologies that embed insight in their daily work.\n\nS&P Global Ratings offers critical insights for credit, risk and sustainable finance solutions that are essential to translating complexity into clarity, so market participants can uncover opportunities.\n\nS&P Global Commodity Insights enables organizations to create long-term, sustainable value with data and insights for a complete view on the global energy and commodities markets.\n\nS&P Global Mobility turns invaluable insights captured from automotive data to help our clients understand today’s market, reach more customers, and shape the future of automotive mobility.\n\nS&P Dow Jones Indices provides iconic and innovative index solutions, bringing transparency to global capital markets.\n\nS&P Global Engineering Solutions solves tomorrow’s challenges today by transforming workflows and end-user experiences with data, insights, and technology.\n\n-----------------------------------------------------------\n\nEqual Opportunity Employer\n\nS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.\n\nIf you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nUS Candidates Only: The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.\n\n----------------------------------------------------------- 20 - Professional (EEO-2 Job Categories-United States of America), IFTECH202.1 - Middle Professional Tier I (EEO Job Group), SWP Priority – Ratings - (Strategic Workforce Planning)\n\nJob ID: 282660\n\nPosted On: 2023-04-19\n\nLocation: London, Ontario, Canada", "occupation": "C++"}, {"title": "Junior C++ Developer - 5312", "company": "ION Group", "location": "Toronto, ON", "via": "via Salary.com", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.salary.com/job/ion-group/junior-c-plus-plus-developer-5312/j202201130733189898143?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.workopolis.com/jobsearch/viewjob/sjMkJSdKjlZIBNvXCb9xMlm_dacXLHIKNCOjltvWAyCEUbt_yeCADfmHXDpUliB5?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "About Fidessa\n\nFidessa (an ION Group Company) provides exceptional trading, investment, and information solutions for the world's financial community. Our unrivalled set of mission-critical products serve both buy-side and sell-side global institutions and investment banks to boutique brokers and niche hedge funds with multi-asset trading and investment infrastructure, their market data and analysis, and their decision making and workflow technology.\n\nWhether you are a boutique broker or a global bank, Fidessa gives you everything you need for equities trading in one integrated solution.\nTo grow your business, you need advanced technology that can unify your operations, simplify your workflows, and boost your efficiency. Our award-winning equities solutions automate and simplify your trading on markets worldwide with proven technology that you can trust.\nThe Fidessa front office provides industry-leading trading functionality across a range of assets. Our team develops a sophisticated... system for order management, risk checking and market access, supporting workflows for trading across global markets.\n\nThe system is the cornerstone of a customer's front office, providing trading desks with the real-time trading information they need when they need it. Optimized views of order books and trading positions give traders precise oversight of all their trading activities. Multiple automations reduce trader workload, taking away mundane tasks allowing them to exploit new trading opportunities.\nSimplifying the complex trading environment for our users and keeping pace with changes in the finance industry makes for an exciting environment with lots to learn.\n\nThe Role\n\nWe are looking for entry-level software engineers with a can-do attitude who are passionate about solving complex problems to help us meet strong customer demand for new workflows. We are constantly looking for ways to do things faster, improving our software's time to market and throughput, and improving our own development approach.\n\nOur primary technology is C on RedHat Linux.\n\nYou will be involved in all aspects of the software process, designing and delivering trading solutions in a rapidly changing marketplace. Your software will form part of a world-leading suite offering rich functionality. You will also help us to improve our development approach.\n\nThis is an excellent opportunity to join a vibrant team of developers providing high performance solutions to global financial markets. Feel the reward of knowing that the ingenious solutions you are providing are empowering the world's premier financial institutions.\n\nFind out more about what we do at: https://iongroup.com/ion-markets/eq/fidessa\n\nMore About ION Group\n\nWe’re a diverse group of visionary innovators who provide trading and workflow automation software, high-value analytics, and strategic consulting to corporations, central banks, financial institutions, and governments. More than 40% of the world’s largest companies use our solutions. Founded in 1999, we’ve achieved tremendous growth by bringing together some of the best and most successful financial technology companies in the world.\n\nOver 2,000 of the world’s leading corporations, including 50% of the Fortune 500 and 30% of the world’s central banks, trust ION solutions to manage their cash, in-house banking, commodity supply chain, trading and risk.\n\nOver 800 of the world’s leading banks and broker-dealers use our electronic trading platforms to operate the world’s financial market infrastructure.\n\nWith 10,000 employees and offices in more than 40 cities around the globe, ION is a rapidly expanding and dynamic group.\n\nAt ION, we offer careers that provide many opportunities: To invent. To design. To collaborate. To build. To transform businesses and empower people around the world to do more, faster and better than before. Imagine what you can do and experience. This is where you can do your best work.\n\nLearn more at: https://iongroup.com", "occupation": "C++"}, {"title": "Java/Python Developer with C++", "company": "Lorven Technologies Inc.", "location": "Toronto, ON", "via": "via LinkedIn", "time": "19 days ago", "type": "Contractor and Temp work", "salary": "none", "links": ["https://ca.linkedin.com/jobs/view/java-python-developer-with-c%2B%2B-at-lorven-technologies-inc-3743470604?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://emplois.ca.indeed.com/viewjob?jk=41e0deafe138ec9b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ca.talent.com/view?id=86b339d221b4&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.glassdoor.ca/job-listing/java-developer-with-c-experience-kovan-technology-solutions-JV_IC2281069_KO0,32_KE33,59.htm?jl=1008937386058&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.eluta.ca/spl/java-python-developer-with-c%2B%2B-skills-f454c2ce9a9a6eacfc5f43765177b862?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ca.trabajo.org/job-850-20231108-91814561d2cbca67a543b880a57d7252?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ca.bebee.com/job/20231106-adb5930a4c2f5eafef99fe70bb34084a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.workopolis.com/jobsearch/viewjob/Nn_-D31tijhIjbyzzSYjxOeXk6_lsAoDj02Q7WYMYvk-9GK_s5Awwe8YihnyAC0Q?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Our client is looking Java/Python Developer with C++ for long term project in Toronto, CA Below is the detail requirement.\n\nJob Title: Java/Python Developer with C++\n\nLocation: Toronto, CA (HYBRID)\n\nDuration: 12+months\n\nNote: The client expects, that the Candidate will be visiting the office three days per week (Tuesday; Wednesday; Thursday).\n\nResponsibilities\n• Manage timelines/deliverables within the team towards the successful delivery of projects.\n• Design software solutions by interacting with portfolio managers, traders, operations staff and peers to understand requirements.\n• Develop solutions that are in line with the client's technology biases, deliver efficiency and scalability, and enable new trading activities.\n• Provide knowledge transfer to team members and support staff through application demos, walkthroughs, and documentation.\n\nSkills\n\nMust have\n• Experience in Java or Python (6+ years) in an enterprise environment, covering the whole development life cycle\n•... Knowledge and technical skills in C++\n• Must have good communication skills, strong client-facing skills and able to manage client's expectations\n• Good technical skills with AWS technologies such as Lambda, SNS, SQS, S3\n\nNice to have\n• Capital Markets domain experience", "occupation": "C++"}, {"title": "Software Engineer (C++ & Java)", "company": "Huntech Contracts Inc.", "location": "Toronto, ON", "via": "via Indeed", "time": "19 days ago", "type": "Full-time", "salary": "none", "links": ["https://ca.indeed.com/viewjob?jk=ec382cb37f2c3f8c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.workopolis.com/jobsearch/viewjob/51KlrF-L_qZtus-XMQaVW7RnE8uQKJMBEg_K_8BTJM6_IBeJnTjv-E3VaMqw5fzF?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.simplyhired.ca/job/0Fu7PBQbo31zMu9KPjLLyXgEj5YwrTptlPa89jGOAyKkD0C9wHRDnA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Our global customer is committed to providing the world's most complete, secure and advanced end-to-end open video delivery solution. Building on more than 30 years of expertise, the firm is the largest global provider of video solutions, trusted by over 200 top satellite DTH, cable, telco and OTT operators, content owners and broadcasters.As a member of a closely knit development team within their Video Network, you will become a key contributor to their Network control system, implementing features that will enable customers to augment their satellite delivery with new streaming technologies.We offer an opportunity to express your talent and enthusiasm without apology.Responsibilities:Develop products within an Agile and OOP environmentProduct development solutions utilizing Java/C++/CDevelopment of virtualized and software-based control systems & platformsDevelopment of controls systems for satellite and live streaming solutions based on HLS and MPEG-DASHPersonal Abilities and... Achievements:Demonstrated ability to work effectively within team environmentsUtilize superior verbal and written communication skillsDemonstrated ability to develop software products under tight deadlines with changing prioritiesDemonstrated ability to constrain creative ideas to product tolerable outcomesDesire to learn new technologies and integrate them into product developmentAbility to understand complex software architecturesOwn the customer experience. Think and act in a way that puts the customers firstRequirements:Bachelor's Degree in Computer Science, Computer/Software Engineering or equivalent2+ years recent experience in Java Core development, Spring Framework and HibernateProficient in C, C++14 (and newer),Familiarity in UI/GUI Design using Angular and/or MS Visual StudioExperience in Database coding with PostgreSQL and pSQL commandsExperience in Python, PERL, shell script and other programming/scripting languagesExperience with Linux development environments and associated toolsFamiliarity with development tools like: Eclipse IDE / GIT & GITHUB / Jenkins / Artifactory / MAVEN etc.Experience with MPEG/DVB standards an asset", "occupation": "C++"}, {"title": "Senior C++ Developer for a growing tech firm", "company": "ROSS Recruitment", "location": "Toronto, ON", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.ca/job/wdYPEgcHG218HQQT3WkUBVU64thPbnMJRY0e6zY_QSjmQtgbtjEl4Q?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Our client, a rapidly growing technology firm based in downtown Toronto has engaged ROSS to help them recruit a Senior C++ Software Engineer. ROSS is a team of People Specialists helping companies align their People Strategy with their business growth. We provide contingency recruitment in addition to remote or onsite HR and Recruitment solutions such as Recruitment Process Outsourcing (RPO) and Recruitment Augmentation\n\nSenior C++ Developer\n\nDESCRIPTION\n\nAs a senior real-time bidding C++ developer at our client, you'll design, build, test and support software applications specifically related to state-of-the-art real-time mobile advertising platforms.\n\nWe're a fast-paced office in a light-speed industry and we want people who thrive working on complex problems.\n\nREQUIREMENTS\n\nPrimary Skills: C++11 - gcc / gdb on linux, Boost, Object oriented, SQL (postgresql)\n\nSecondary Skills: Python, Bash / sed / AWK, GIT\n\nTertiary Skills: R, Gnuplot, Javascript + charting / visualization... libraries\n\nDemonstrated track record contributing to and shipping products in an agile team environment and experience with all aspects of complex real-time systems (ideal), including but not limited to:\n• Multithreading\n• Parallel / distributed systems\n• Real time systems\n• Scalability, high availability and redundancy\n• Unit testing\n• Monitoring, reporting and analysis\n• First and second level production support\n\nNice to have:\n• Experience with Splunk (for real-time operational intelligence)\n\nIf you're not interested, but know someone who is, please help a current or former colleague in their career development by referring them. In addition, we're happy to give you a $1,000 referral fee", "occupation": "C++"}, {"title": "Senior C++ Developer - Fixed Income", "company": "LSEG (London Stock Exchange Group)", "location": "Toronto, ON", "via": "via Workopolis", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.workopolis.com/jobsearch/viewjob/hV6eQMCol3wMj-DfgG0YWhR8Rxg1U-L0AMjuRpPE6lshhD0e5evprpJ0WnIa_D0T?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Responsibilities\n• Perform advanced software development and maintenance functions for PCBond and FTSE Russell Fixed Income Indices.\n\nResponsibilities include:\n• Design and develop software for the next generation of FTSE Russell Canada Fixed Income System and Custom Index Tools\n• Maintain and develop index production and analytics systems to improve efficiency and quality; apply analytics skill and fixed income knowledge to implement fixed income analytics and fixed income index calculation methodology.\n\nThis position requires and rewards candidates with strong personal initiative, work ethic, and the ability to develop expertise in both fixed income markets and the technology needed to deliver analytics capabilities for these markets.\n\nQualifications\n\nMaster’s degree in a quantitative field such as Computer Science, Engineering, Mathematics, Financial Engineering, or Operations Research or similar Bachelor’s degree with proven experience.\n\nRequired Skills\n• 5+ years of hands-on... C++ Development\n• Great experience in RESTful API and micro services.\n• Prior experience with Excel VBA is a big plus\n• Prior experience with relational and/or non-relational database such as MS SQL Server, Postgres, Snowflake is a big plus\n• Strong analytical abilities.\n• Good knowledge of UNIX/Linux environment, bash shell scripting, awk/sed scripting.\n• Knowledge/experience with fixed income and equities market data is a plus.\n\nAt LSEG, we believe that creating a diverse and inclusive organisation is fundamental to the way we deliver on our promise of creating essential partnerships and open opportunities. Our open culture is central to how we deliver our purpose – driving financial stability, empowering economies and enabling customers to create sustainable growth – in everything we do.\n\nWorking with us means that you will be part of a dynamic organisation of 25,000 people across 70 countries. However, we will value your individuality and enable you to bring your true self to work so you can help enrich our diverse workforce. You will be part of a collaborative and creative culture where we encourage new ideas and are committed to sustainability across our global business. You will experience the critical role we have in helping to re-engineer the financial ecosystem to support and drive sustainable economic growth. Together, we are aiming to achieve this growth by accelerating the just transition to net zero, enabling growth of the green economy and creating inclusive economic opportunity.\n\nLSEG offers a range of tailored benefits and support, including healthcare, retirement planning, paid volunteering days and wellbeing initiatives.\n\nWe are proud to be an equal opportunities employer. This means that we do not discriminate on the basis of anyone’s race, religion, colour, national origin, gender, sexual orientation, gender identity, gender expression, age, marital status, veteran status, pregnancy or disability, or any other basis protected under applicable law. Conforming with applicable law, we can reasonably accommodate applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.\n\nPlease take a moment to read this privacy notice\ncarefully, as it describes what personal information London Stock Exchange Group (LSEG) (we) may hold about you, what it’s used for, and how it’s obtained, your rights and how to contact us as a data subject\n.\n\nIf you are submitting as a Recruitment Agency Partner, it is essential and your responsibility to ensure that candidates applying to LSEG are aware of this privacy notice", "occupation": "C++"}, {"title": "C++ Developer (Windows Env)", "company": "Brillio LLC", "location": "Toronto, ON", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.ca/job/Gg4fzTKVVLymZHUp4cPX5h7icQdNocDnO_h48nW3lQOm11Nahl7zyA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Brillio is urgently lookig for a Strong C++ Consultant for one of our Clients in Canada. If you are interested please share resume at the earliest..\n\nJob Title: C++ Developer (Windows Environment)\nEmployment Type: Contract / Full Time\nLocation: REMOTE in Canada\n\nPreferred Skills:\n• 6 years of experience in product development including design, development, code review and defect investigation.\n• Develop and debug complex software in a Windows C/C++ environment.\n• Work with an experienced team to integrate new features from design to release using software development best practices.\n• Design and work with data to monitor and measure the success of new and existing features. Triage and resolve defects.\n• Participate in code reviews. Work as part of a scrum team, assisting in the creation of story backlog, task breakdowns and estimates.\n• Proficient in C, Multithreading, IPC and System Programming. Knowledge of debugging using tools such as Visual Studio and WinDBG.\n• Experience... developing shipping high-quality, high-performance software.\n• Familiar with performance analysis tools and writing performant code is a bonus. Love taking on difficult challenges and finding creative solutions.\n\nQualification:\n• Bachelor`s Degree or equivalent experience in IT.\n• Good communication skills and be able to work with multiple teams\n\nBrillio_Indeed\n\nJob Type: Full-time\n\nSalary: $50,714.00-$121,532.00 per year\n\nBenefits:\n• Dental care\n• Extended health care\n• Paid time off\n• Vision care\n\nSchedule:\n• 8 hour shift\n\nExperience:\n• C++: 5 years (required)\n• Windows: 4 years (required)\n• Debugging: 2 years (preferred", "occupation": "C++"}, {"title": "Sr Java / Python Developer with C++", "company": "CG Consulting Group", "location": "Toronto, ON", "via": "via C.G. Consulting Group", "time": "21 days ago", "type": "Contractor", "salary": "none", "links": ["https://www.cgconsultinggroup.com/jobs/?t=14&b=VMTVGZ43FISWPDKRUHY4QKGFLS6W6E5D44VDHPLQTJQMR73ZAI2F5NOJ2VSGNWR6BSZT3AEYR4MVT42RDHK24J6644PSCOY&action=detail&src&srcref&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ca.bebee.com/job/20231024-455b358d769951e77766b51aa8815429?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ca.trabajo.org/job-1769-20231104-edf57b2a6a3b6ceee31bc949caae4034?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.simplyhired.ca/job/wZAvn8wNPHVqgOVWBSrIBj6GeBUJZVtQPD1CabIZ2n9a74cvwaOW5w?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ca.jooble.org/jdp/5531951412490562607/Sr-Java-%2F-Python-Developer-with-C%2B-Toronto%2C-ON?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.learn4good.com/jobs/canada/software_development/2655119799/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Sr Java / Python Developer with C++\n\nThis is with a global IT services firm for a leading investment/wealth management services firm.\nHybrid work environment - 3 to 4 days / week in-office\nLocation is downtown Toronto Ont. near TTC and GO Train\nRole can be contract or perm / FT\n\nSr Java / Python Developer with C++\n\nJoin one of the most respected and fastest growing institutional investors in the world. Our client is a professional investment management organization that globally invests the funds to ensure long-term sustainability. Client attracts and selects high-calibre individuals from top-tier institutions around the globe. Join our team and look forward to:\n• Diverse and inspiring colleagues and approachable leaders\n• Stimulating work in a fast-paced, intellectually challenging environment\n• Accelerated exposure and responsibility\n• Global career development opportunities\n• Being motivated every day by important social purpose and unshakable principles\n• A deeply rooted culture... of Integrity, Partnership and High Performance\nIf you share a passion for performance, value a collegial and collaborative culture, and approach everything with the highest integrity, here's an opportunity.\nPreference will be given to candidates experienced both in Java and Python.\n\nResponsibilities\n• Manage timelines/deliverables within the team towards the successful delivery of projects.\n• Design software solutions by interacting with portfolio managers, traders, operations staff and peers to understand requirements.\n• Develop solutions that are in line with the client's technology biases, deliver efficiency and scalability, and enable new trading activities.\n• Provide knowledge transfer to team members and support staff through application demos, walkthroughs, and documentation.\n\nSkills\nMust have\n• 6+ years experience in Java 8+ or Python in an enterprise environment, covering the whole development life cycle\n• Knowledge and technical skills in C++\n• Must have good communication skills, strong client-facing skills and able to manage client's expectations\n• Good technical skills with AWS technologies such as Lambda, SNS, SQS, S3\n\nNice to have\nCapital Markets domain experience", "occupation": "C++"}, {"title": "Java/Python Developer with C+ skills", "company": "Luxoft", "location": "Toronto, ON", "via": "via Trabajo.org", "time": "2 days ago", "type": "Full-time", "salary": "none", "links": ["https://ca.trabajo.org/job-1262-20231107-6c02ad6858481d8a37dc8c18931f0ab9?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Java/Python Developer with C++ skills,\nOffice Address\nProject Description\nOur client is a professional investment management organization that globally invests the funds to ensure long-term sustainability.\nBeing motivated every day by important social purpose and unshakable principles\n• A deeply rooted culture of Integrity, Partnership and High Performance\nIf you share a passion for performance, value a collegial and collaborative culture, and approach everything with the highest integrity, here's an opportunity.\nManage timelines/deliverables within the team towards the successful delivery of projects.\n• Design software solutions by interacting with portfolio managers, traders, operations staff and peers to understand requirements.\n• Experience in Java or Python (6+ years) in an enterprise environment, covering the whole development life cycle\n• Knowledge and technical skills in C++\n• Good technical skills with AWS technologies such as Lambda, SNS, SQS, S3\nPreference will be given to... candidates experienced both in Java and Python", "occupation": "C++"}, {"title": "Software Development Engineer – C++", "company": "FireEye, Inc.", "location": "Toronto, ON", "via": "via Energy Jobline", "time": "24 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.energyjobline.com/job/software-development-engineer-c-17528855?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ca.trabajo.org/job-2401-20231105-d15055815033c0a8695cf2a4c43638d2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ca.bebee.com/job/20231104-5b6e046713ac4fc288680cf7a90ca78b?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Role Overview:As a Sr Engineer, you will be an integral part of the Trellix Endpoint Team developing and maintaining endpoint protection cross platform applications for Mac, Linux and Windows.In this position, you will be involved in all aspects of product development lifecycle – requirements discussion/analysis, design, scope, estimation, planning, implementation, code reviews and unit testing, documentation, POCs, deployment and continuous engineering. You will also be responsible for release deployment and supporting customers using the products in production. Ideal candidate will foster a culture of innovation while displaying exemplary technical expertise, ownership, and commitment to delivering high quality endpoint security solutions on a variety of platforms (Mac, Linux and Windows). For you to be successful in this role, you need excellent debugging and development skills in C/C++, understanding of Mac Internals, Linux Sub-System, & Windows system internals and experience in... building endpoint applications.About the Role: Design, implement, test, optimize and maintain features Continuously re-evaluate product features and services to improve architecture, user experience, performance, latency, and stability. Use knowledge of use cases and product context to propose and execute improvements and optimizations. Brainstorm ideas, contribute to designs of systems, and build collaboratively with members across multiple teams. Make well-reasoned design decisions and tradeoffs Relentlessly pursue quality by leveraging engineering best practices including -appropriate testing paradigms, effective peer code reviews, logging, monitoring, and resilient architecture patterns. Collaborate with cross-functional engineering teams to understand, triage and resolve existing customer issues. About You: Minimum of 6-8 years of experience of Cross Platform development experience in Mac, Linux and Windows. System programming experience using C++. Strong hold on object-oriented design, data structures and algorithms. Strong hold on Mac Internals, Linux Sub System, & Windows OS internals, API/UI development skills. Mac System Extension, Linux Kernel, & Windows driver development experience with knowledge on kernel debugging is a plus Experience with Agile development and rapid prototyping Understanding and participation in our continuous integration/continuous deployment pipelines Experience debugging memory corruption, process contention and system performance Excellent oral and written communication skills with the ability to deal with interoperability issues is a big plus. Company Benefits and Perks: We work hard to embrace diversity and inclusion and encourage everyone to bring their authentic selves to work every day. We offer a variety of social programs, flexible work hours and family-friendly benefits to all of our employees. Retirement PlansMedical, Dental and Vision CoveragePaid Time OffPaid Parental LeaveSupport for Community Involvement We're serious about our commitment to diversity which is why we prohibit discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status", "occupation": "C++"}, {"title": "C++ Software Developer", "company": "COREL CORPORATION USA", "location": "Toronto, ON", "via": "via Workopolis", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.workopolis.com/jobsearch/viewjob/oIdPqWUXxxjUbFNHzLMglfrlTmJyeu6kR1ifEYEJrekrOlKWtFVJI7KbJ2VFbDUR?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "C++ Software Developer - CorelDRAW\n\nPush the boundaries of tech. In your sweatpants.\n\nWe’re looking for Software Developers to help us change the way the world works, with next-generation creative software tools. Here, you’ll innovate and develop new features for our powerful vector illustration product, CorelDRAW.\n\nThe top creative and technical minds could work anywhere. So why are so many of them choosing Alludo? Here are three reasons:\n• This is the moment. It’s an exciting time at Alludo, with new leadership, a refreshed brand, and a whole new approach to changing the way the world works. We’re at the forefront of a movement, and we want you to ride this wave with us.\n• We want you to be you. Too often, companies tell you about their culture and then expect you to fit it. Our culture is built from the people who work here. We want you to feel safe to be who you are, take risks, and show us what you’ve got.\n• It’s your world. We know you have a life. We want to be part of it, but... not all of it. At Alludo, we’re serious about empowering people to work when, how, and where they want. Couch? Sweatpants? Cool with us. We believe that happy employees mean happy customers. That’s why we hire amazing people and get out of their way.\n\nSound good so far? Awesome. Let’s talk more about the Software Developer role and see if we’re destined to be together.\n\nAs a Software Developer, you will:\n• Innovate and develop new features for our powerful vector illustration product, CorelDRAW.\n• Stay current with new technologies.\n• Regularly scrum to plan and develop new features.\n• Peer review code to ensure excellence in code quality.\n• Develop, deploy, and debug secure cloud-based applications.\n• Implement best practices and solutions for cloud application support.\n• Support our engineering teams by troubleshooting and resolving software, pipeline, and infrastructure-related issues with an eye to automation.\n\nWhat YOU bring to the table:\n• Creative, innovative, and passionate about all things software development.\n• Team player motivated by technical challenges, a wizard when it comes to creative problem-solving, and obsessed with finding new ways to harness creativity and help people collaborate, connect, and achieve exceptional results.\n• Bachelor’s degree in Computer Science, Computer Engineering, Software Engineering, Mathematics, or a related field.\n• Experience in modern C++ and secure coding practices.\n• Someone who keeps pace with emerging technologies and practices.\n• Solid communication and interpersonal skills.\n• Great time-and-self-management.\n\nHere are a few things that aren’t required, though are definitely nice to have:\n• Hands-on experience with cloud infrastructure such as AWS, Azure, GCP.\n• Excellent understanding of Cloud, Infrastructure Services, and Software Development Services.\n• Experience with and working knowledge of agile development practices.\n• Knowledge of other web-based design applications.\n\nUS:\n• CorelDRAW Graphics Suite is an award-winning solution that powers graphic design on Mac, Windows, and the web.\n• We have millions of users and decades of innovation under our belts.\n• We offer a fully remote, work-from-anywhere workspace – and we mean it. There is no pressure to work in an office whatsoever.\n• We have flexible work arrangements and locations to suit your style.\n• Hours are flexible, too! You’ve worked hard to build your life, and we don’t want you to give it up for work.\n• Our team is growing fast, and there’s a ton of energy and a lot of really smart, motivated, fun people ready to welcome you in.\n\nWant to see what we’re all about? You can download free trials of CorelDRAW Graphics Suite here: http://www.coreldraw.com.\n\nWhat are you waiting for? Apply now! We can’t wait to meet you.\n\n(FYI, we’re lucky to have a lot of interest and we so appreciate your application, though please note that we’ll only contact you if you’ve been selected for an interview.)\n\nAbout Alludo\n\nAlludo is a beloved and trusted industry titan fueled by make-everything-easier flexibility. With a 30+ year legacy of innovation, we understand where you've been and we're uniquely equipped to get you where you want to be. Our comprehensive collection of creative, collaborative, and productivity solutions propel your teams on their journey. From meeting your deadlines to realizing your dreams, Alludo empowers all you do.\n\nOur products enable millions of connected knowledge workers around the world to do great work faster. Our success is driven by an unwavering commitment to deliver a broad portfolio of innovative applications – including CorelDRAW®, MindManager®, Parallels®, and WinZip® – to inspire users and help them achieve their goals.\n\nIt is our policy and practice to offer equal employment opportunities to all qualified applicants and employees without regard to race, color, age, religion, national origin, sex, political affiliation, sexual orientation, marital status, disability, veteran status, genetics, or any other protected characteristic.\n\nAlludo is committed to an inclusive, barrier-free recruitment and selection process and work environment. If you are contacted for a job opportunity, please advise us of any accommodations that are required. Appropriate accommodations will be provided upon request as required by Federal and Provincial regulations and Company Policy. Any information received relating to accommodations will be treated as confidential", "occupation": "C++"}, {"title": "Software Developer- C++", "company": "Stack IT recruitment", "location": "Toronto, ON", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.ca/job/vNg6azLYtr2YZi8f3YiEj0zGGr4cw3v_Qe2Ct4cIaDIr1UYKJEDpLg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Software Developer\n\nExperience- 5yrs+\n\nFull Time\n\nToronto\n\nDevelopment of the application includes code maintenance (bug fixes and speed improvements), as well as the development of new features and functionality.\n\nThe application is developed in Visual C++ or in C++ (the server module has one codebase that compiles and runs on Windows as well as on Linux, Solaris, Mac, HP-UX) with one of SQL Server, PostgreSQL, DB2 or Oracle as database back-end. GUIs are developed in Java or Visual C++.\n\nKey Responsibilities\n• Well versed in client-facing software development\n• Excellent sense of best practice\n• Demonstrated ability and success to work in project teams\n• Experience working on a full web stack\n• Requires a B.Eng., B.A. or B.S. degree in CS/CIS/IS\n\nQualifications\n• Operating Systems: Windows, Unix (good knowledge of one of Linux, Solaris, HP-UX, MAC)\n• Programming languages: C++, C#,\n• Databases: Microsoft SQL Server, PostgreSQL, Oracle, DB2, MySQL\n\nJob Type: Full-time\n\nExperience:\n•... C++: 5 years (Required)\n\nEducation:\n• Bachelor's (Required", "occupation": "C++"}, {"title": "C++ Team Lead", "company": "Rakuten Kobo", "location": "Toronto, ON", "via": "via Workopolis", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.workopolis.com/jobsearch/viewjob/aVjlbP2IEBVcC5EIbHdcOEgsXEohqeZIn_BTYwU1uQgxiTvoUIBXV9uTIKp9KZQ1?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Description:\n\nHere at Rakuten Kobo Inc. we offer a casual working start-up environment and a group of friendly and talented individuals. Our employees rank us highly in terms of commitment to work/life balance. We realize that for our people to be innovative, creative and passionate they need to feel valued and supported. We believe in rewarding all our employees with competitive salaries, performance based annual bonuses, stock options and training opportunities.\n\nIf you’re looking for a company that inspires passion, personal, and professional growth – join Kobo and come help us make reading lives better.\n\nThe Role:\n\nWe are looking for a C++ Team Lead to join our eReader team in Kobo. This person will lead the development team who are responsible for building our award winning eReader devices which are sold globally. We are looking for a curious, collaborative person who is willing to learn and ready to take up new exciting endeavours. We want someone who challenges the norm, is... customer oriented and can work seamlessly with product, ux and the business teams to make sure our devices remain the market leaders.\n\nHere are some of the things we do and strongly believe in:\n• Every member on the team has a voice and is able to contribute to planning and designing. No ivory towers here\n• We follow an Agile development process and teams are encouraged to try new things in an effort to constantly improve\n• New initiatives are preceded by a design session or design sprint where a small team including devs/QAs participates in problem solving, prototype building and user testing\n• We’re dedicated to crafting high quality, peer reviewed code. Refactoring isn’t a curse word to us and we include it as an integral part of our planning\n• QA is embedded on our development teams and are involved in projects from day one\n• We host bi-weekly learning sessions on various engineering topics hosted by members of the team\n• Software wellness days are run once per quarter to give us a chance to do some regular spring cleaning of our code, our test cases or our tooling\n\nRequirements:\n• You're well versed in C++11 and modern development practices\n• Excellent object-oriented design, development, and coding skills are essential\n• A deep understanding of SOLID principles, can always be trusted to apply them appropriately\n• You have tons of experience writing graphical user interfaces in C++ using Qt or another similar library\n• You have at least 5 years’ experience as a developer in an agile development environment\n• You have extensive experience reviewing other people’s code and providing helpful feedback\n• Excellent analytical skills utilizing Computer Science fundamentals (Data Structures / Algorithms / Design Patterns (e.g. MVC))\n• You enjoy working on a dynamic, loosely structured and highly collaborative team\n• You're able to take a high level requirement and break it into smaller, more manageable pieces\n• You’re a excellent communicator, message is always well suited to target audience, clear and concise\n• You can identify flaws or weaknesses in existing code and improve it\n• You take business requirements into consideration when discussing development risks and opportunities\n• Extensive experience writing multi-threaded applications\n• Familiar with HTTP, web services and web technologies (JavaScript/CSS/HTML)\n\nBonus points:\n• Degree in Computer or Electrical engineering, knowledge of hardware design\n• You’ve worked with databases such as SQLlite and know how to optimize database design and SQL queries for performance\n• You have tinkered with and coded for embedded Linux platforms\n• You’re no stranger to a soldering iron\n• Experience with GCC, ARM toolchains, shell scripting, Linux kernel, drivers\n• You're able to write and maintain meaningful Unit tests, along with experience with dependency injection and data mocking frameworks\n• Experience writing and maintaining automated UI tests\n• Familiarity with the EPUB format or working with any modern browser engine\n• You have a keen eye for design\n\nThe Perks:\n• Flexible hours and remote working environment\n• Full benefits starting from your first day\n• Monthly commuting allowance and internet allowance\n• Flexible health spending account\n• Talent and development training budget\n• Free Kobo device + free weekly e-book or audiobook\n• Weekly Kobo Tech University sessions\n• Maternity/paternity leave top up\n\nAbout Rakuten Kobo Inc.\n\nOwned by Tokyo-based Rakuten and headquartered in Toronto, Rakuten Kobo Inc. is one of the most advanced global e-commerce companies, with the world’s most innovative eReading services offering more than 6 million eBooks and audiobooks to 30 million + customers in 190 countries. Kobo delivers the best digital reading experience through creative innovation, award-winning eReaders, and top-ranking mobile apps. Kobo is a part of the Rakuten group of companies.\n\nRakuten Kobo Inc. is an equal opportunity employer. Accessibility accommodations for candidates with disabilities participating in the selection process are available on request. Any information received related to accommodation needs of applicants will be addressed confidentially. Rakuten Kobo would like to thank all applicants for their interest", "occupation": "C++"}, {"title": "Software Engineer - Remote (C++)", "company": "Moody's", "location": "Toronto, ON", "via": "via Workopolis", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.workopolis.com/jobsearch/viewjob/SZLIUbcf6EaDzrPVomLTXxTx_ZvNPITkn4n8alcU0HKryVE6RCbog8i3W5SA5TJR?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "• A Software Engineer fulfils the following responsibilities with little to moderate guidance of more senior team members.\n• Take ownership of stories and interpret business requirements for these stories with the assistance of project managers.\n• Design and implement new features in product and improve existing features as required.\n• Provide feedback on requirements from a technical perspective, and provide estimates for user stories and tasks.\n• Provide input into technical design, at the story and/or module level.\n• Comply with coding standards.\n• Collaborate with quality assurance engineers to fix defects.\n• Collaborate with build and release engineers to prepare packages and solve environment issues.\n• Investigate and find the root cause for software problems reported by clients.\n• Maintain technical documents.\n• Review code of other team members.\n• Mentor Associate Software Engineers.\n• Minimum Bachelor’s degree in Computer Science or related major from top institutions... Master’s degree is a plus.\n• 3+ years of professional software development experience on multi-tiered enterprise applications.\n• Deep understanding of Object-Oriented design and development.\n• Experience with relational databases.\n• Willing to learn new technologies; capable of self-directed learning.\n• Ability to handle multiple assignments concurrently and independently manage time.\n• Works well in a fast-paced team environment; able to work under pressure to meet tight deadlines.\n• Very good verbal and written communication skills.\n• Has superb analytical skills and persistence in problem solving.\n\nMust-Have Technical Skills:\n• Experienced in Programming Languages: Visual C++ (with MFC), Visual C#, Visual Basic, etc.\n• Experienced in MS SQL Server, MS Access, etc.\n• Experienced in Development tools: Visual Studio.\n• Experienced in Development Platforms: Microsoft Windows.\n\nNice-to-Have Technical Skills:\n• Experienced in Others: TFS, Git, etc.\n• Experienced in Cloud Services: Microsoft Azure, Amazon AWS, Google Cloud Platform.\n\nAble to work well within the constructs of an agile development process, including SCRUM, Unit Testing, Continuous Build and Integration, etc\n\nOur team’s approach stands out from our competitors. We take our expertise and find ways to package it into a product which offers our customers standardized solutions. The core of our business today is delivering actuarial modelling to insurers. We provide timely insight with control and consistency, enabling effective decision-making, and reducing operational risk and cost. Our diverse team of actuaries, software engineers and product managers are committed to maintaining high-quality customer engagement.\n\nMoody’s is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, place of origin, disability, marital or familial status, sexual orientation, gender expression, gender identity or any other characteristic protected by law. We encourage applications from Aboriginal persons, members of a visible minority group, persons with a disability, members of the LGBTQ+ community, and women.\n\nMoody’s is committed to maintaining an inclusive, diverse and accessible workplace. To this end, reasonable accommodations are available on request, and will take into account the particular accommodation needs of individual candidates. If you are selected and require accommodation during any stage of the recruitment process, you may send your request to AODA@moodys.com. Information provided during the accommodation process will be treated as confidential, and will be shared only to the extent required to properly evaluate accommodation requests.\n\nMoody’s is a developmental culture where we value candidates who are willing to grow. So, if you are excited about this opportunity but don’t meet every single requirement, please apply! You may be a perfect fit for this role or other open roles.\n\nMoody's is a global integrated risk assessment firm that empowers organizations to make better decisions.\n\nAt Moody’s, we’re taking action. We’re hiring diverse talent and providing underrepresented groups with equitable opportunities in their careers. We’re educating, empowering and elevating our people, and creating a workplace where each person can be their true selves, reach their full potential and thrive on every level. Learn more about our DE&I initiatives, employee development programs and view our annual DE&I Report at moodys.com/diversity", "occupation": "C++"}, {"title": "C / C++ Developer - Linux Kernel", "company": "Arista Networks", "location": "Toronto, ON", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.ca/job/qT2bB8IX8PNMrEFm8Te6qEMd4d5reb2F8QfhNXNcsYiReA3vtZcgpw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "We are looking for the top tech talent from all over Eastern Canada that have an interest in relocating to beautiful Vancouver! Positions are located at our Vancouver R&D Office: Suite 350, 3605 Gilmore WayBurnaby, British ColumbiaCanada V5G 4X5R&D Office. Job description Across all parts of the engineering team, we put a premium on building and using tools that make everyone super-productive. We automate whenever we can. Why test things manually when you can develop a lab full of automated servers to do it for you 24/7. (To date, we've run 1.5 million automated tests!) This translates into getting new features and products (and revenue!) quicker and with a smaller team.Our engineers are empowered with full responsibility for their projects. Our management structure is flat and lightweight -- you are in charge of delivering your work from design to code to test to customer shipment.We value openness -- no part of the company is off-limits, meaning that our engineers have the chance to... work directly with customers, participate in sales meetings, go to trade shows, recruit on campus, and deliver an amazing product.The core responsibility for Software Engineering is to deliver product features. A major part of this is writing the code that drives our products. But the role of a software engineer is much bigger than just being a coding machine. Software engineers work on the whole development process, including:\n• deciding what features to build\n• driving the design\n• writing the code (of course)\n• pushing testing\n• documenting the feature\n• supporting customers in the field\n\nAlong the way, you might:\n• extend and improve the test infrastructure\n• hack on our engineering tools, including p4, django, python, rpm, ...\n• work with sales and business development\n• improve the content on our website :)\n\nIf you...\n• love to program\n• enjoy building things and shipping them, truly making them work\n• find satisfaction in creating a really well-written piece of code\n• care about keeping the code maintainable and preserving its integrity\n• look for a better way, and strive to make it real\n• care about the business too\n• enjoy working with others who feel the same\n• learn how things work, just for fun or out of curiosity\n\n... then this job is for you.Desired Skills and Experience\n• BSCS/CE or equivalent technical discipline. MS/Ph.D is a plus.\n• A strong background in linux, C++, TCP/IP, python, hardware, drivers, compilers, or assembly language is a plus\n• College Graduates or 1 to 3 years relevant experience.\n• Experience and/or knowledge of Networking technologies, Software Define Networking/routers/switches is a plus.\n\nAbout this company Arista Networks was founded to deliver software defined cloud networking solutions for large data center and compute environments. Arista’s award-winning best-of-breed Ethernet switches redefine scalability, robustness, and price/performance. At the core of Arista's platform is EOS, the world’s most advanced network operating system. Arista Networks markets its products worldwide through distribution partners, systems integrators and resellers.Additional information and resources can be found at:http://www.aristanetworks.comhttp://www.twitter.com/aristanetworkshttps://www.facebook.com/AristaNWJob\n\nJob Type: Full-time\n\nExperience:\n• C Development: 1 year (Required", "occupation": "C++"}, {"title": "Software Engineer: C++, Low Latency Exp, FIX protocol", "company": "TD Bank", "location": "Toronto, ON", "via": "via Workopolis", "time": "29 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.workopolis.com/jobsearch/viewjob/VyxwlICUiF99A9KKZPVzl-qQBLdqDD3jXYmTjNgs9flwxwMdB-wrtol39FBma8vS?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.levels.fyi/jobs?jobId=103374397835748038&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.simplyhired.ca/job/4OQxAFS-sYILkZ6pyYRJl24Q-41zH1XXZvOsnxP5hDp9nnuotheskQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "421710BR\n\nTechnology Solutions\n\nToronto, ON\n\nOctober 10, 2023\n\nHours\n\n37.5\n\nWorkplace Model\n\nHybrid\n\nPay Details\n\nWe’re committed to providing fair and equitable compensation to all our colleagues. As a candidate, we encourage you to have an open dialogue with your recruiter and ask compensation related questions, including pay details for this role.\n\nDepartment Overview\n\nBuilding a World-Class, Diverse and Inclusive Technology Team at TD\n\nTD Securities offers a wide range of capital markets products and services to corporate, government, and institutional clients who choose us for our innovation, execution, and experience.\n\nWith more than 6,500 professionals operating out of 40 cities across the globe, we help clients meet their needs today and prepare for tomorrow. Our services include underwriting and distributing new issues, providing trusted advice and industry-leading insight, extending access to global markets, and delivering integrated transaction banking solutions. In 2023... we acquired Cowen Inc., offering our clients access to a premier U.S. equities business and highly-diverse equity research franchise, while growing our strong, diversified investment bank.\n\nWe are growth-oriented, people-focused, and community-minded. As a team, we work to deliver value for our clients every day.\n\nEquity Trading System Development in TD Securities\n\nThe TDS Equity Trading Systems team is responsible for the design, development and maintenance of the TDS Canadian Equities algorithmic trading platform. This platform is composed of in-house and vendor technologies providing trading and routing algos, market-connectivity, market-data processing and distribution, securities pricing, and risk management. We work closely with the front-office teams to expand their businesses by enabling and implementing new trading strategies and additional market access. The team is currently involved in large initiatives working to modernize and increase the capacity of our infrastructure and is expanding to allow us to leverage these improvements by building out our next generation of trading technology\n\nThere’s room to grow in all of it.\n\nJob Details\n\nAbout This Role\n\nWe are looking for someone armed with a strong tool-kit to develop and maintain technical solutions that adhere to engineering and architectural design principles while meeting business requirements. You’ll also provide technical expertise with a focus on efficiency, reliability, scalability, and security. This mandate includes planning, evaluating, recommending, designing, operationalizing, and supporting solutions in compliance with enterprise and industry standards. At TD, we hope you’ll be inspired both by the work we do and the people who make it all happen.\n\nMeaningful work is fueled by meaningful performance and career development conversations with your manager. Here’s some of what you may be asked to perform:\n• Maintain and enhance components of the existing real-time trading and order routing system\n• Participate in the design and implementation of a replacement order routing and management system using modern messaging technologies\n• Provide third level support for the trading systems\n• Properly document and test changes and follow the mandated project and development processes\n• Work with business representatives to clarify and finalize business requirements and provide input to the overall technical direction of the application\n• Work to improve the supportability and maintainability of the applications\n\nJob Requirements\n\nWhat can you bring to TD? Share your credentials, but your relevant experience and knowledge can be just as likely to get our attention. It helps if you have:\n• University or Post-Graduate Degree.\n• 3 years+ experience in server-side C++ development on Linux\n• Experience developing real-time, multi-threaded, distributed applications\n• Experience using Solace or similar messaging infrastructure for creating distributed applications\n• Excellent troubleshooting skills with an ability to react quickly and manage priorities in a fast-paced environment\n• Strong Unix scripting and SQL skills\n• Good understanding of real-time trading systems and experience with the FIX protocol\n• Good understanding of and experience with market-data processing, such as: experience consuming data from Exegy feed handlers, using MAMA APIs for market-data processing, or exchange-native data feeds.\n• Strong communications skills, both verbal and written\n• Experience with C#/.Net real-time GUI/web development would be an asset\n\nAdditional Information\n\nJoin in on what others in TD Technology Solutions are doing:\n• Inspire a positive work environment and help champion quality, innovation, teamwork and service to the business.\n• Learn voraciously, stretch your thinking, share your knowledge and educate others.\n• Communicate and collaborate with both technical and non-technical professionals.\n• Cultivate winning relationships by building trust with business and technology partners.\n• Share our commitment to productivity, effectiveness and operational efficiency.\n\nCompany Overview\n\nOur Values\n\nAt TD we’re guided by our purpose is to enrich the lives of our customers, communities and colleagues, and share a set of values that shape our culture and guide our behavior. In exchange for how our colleagues show up to help TD succeed, we are committed to delivering a colleague experience grounded in Impact, Growth and a Culture of Care. No matter where you work across TD, we empower you to make an impact at work and in your community, explore and grow your career and be part of our caring and inclusive culture.\n\nMaking Your Well-being a Priority\n\nA caring and supportive culture that promotes colleague well-being is core to who we are. At TD, we focus on total well-being with extensive programs to help colleagues assess, manage, and improve their well-being across four core pillars — physical, financial, social and mental/emotional. In addition, we champion a safe, inclusive and supportive work environment to help colleagues feel a sense of belonging, and supported in their personal and professional growth. Through our focus on total well-being, we know that we can help our colleagues thrive, contribute to our culture of care, and support better business outcomes … because when colleagues feel their best, they’re more likely to do their best.\n\nOur Total Rewards Package\n\nOur Total Rewards package reflects the investment we make in our colleagues to help them, and their families achieve their well-being goals. Total Rewards at TD includes a base salary, variable compensation, and several other key plans such as health and well-being benefits including medical, dental, vision & mental health coverage, savings and retirement programs, paid time off, banking benefits and discounts, career development, and reward and recognition programs.\n\nHow We Work\n\nAt TD, we believe in-person connections fuel collaboration and collective creativity. Our workplace experience empowers colleagues to do great work side-by-side at TD locations, while offering flexibility to work remotely where it makes sense for the work and team. Our teams work in one of three workplace models: hybrid, onsite and primarily remote. Wherever our colleagues are working, they’ll always have access to the TD community and experience our culture of care.\n\nWho We Are\n\nTD is one of the world’s leading global financial institutions and is the fifth largest bank in North America by branches. Every day, we deliver legendary customer experiences to over 27 million households and businesses in Canada, the United States and around the world. More than 95,000 TD colleagues bring their skills, talent, and creativity to the Bank, those we serve, and the economies we support. We are guided by our vision to Be the Better Bank and our purpose to enrich the lives of our customers, communities and colleagues. TD is a customer obsessed organization, and we are deeply committed to being a leader in customer experience, that is why we believe that all colleagues, no matter where they work, are customer facing. As we build our business and deliver on our strategy, we are innovating to enhance the customer experience and build capabilities to shape the future of banking. Whether you’ve got years of banking experience or are just starting your career in financial services, we can help you realize your potential. Through regular leadership and development conversations to mentorship and training programs, we’re here to support you towards your goals. As an organization, we keep growing – and so will you.\n\nInclusiveness\n\nOur Commitment to Diversity, Equity, and Inclusion\n\nAt TD, we’re committed to fostering an environment where all colleagues are encouraged to bring their authentic selves to work, experience equitable opportunities, and feel respected and supported. We’re dedicated to building an inclusive workforce that reflects the diversity of the customers and the communities in which we live and serve.\n\nHow We’re Helping Make an Impact in Communities\n\nTD has a long-standing commitment to help drive progress towards a more inclusive and sustainable future. That’s why we launched the TD Ready Commitment in 2018, now a multi-year North American initiative. Under the TD Ready Commitment, we are targeting a total of $1 billion by 2030 in community giving four key, interconnected drivers of change: Financial Security, Vibrant Planet, Connected Communities, and Better Health. It’s our goal to help support change, nurture progress, and contribute to making the world a better, more inclusive place for our customers, colleagues, and communities.\n\nAccommodation\n\nYour accessibility is important to us. Please let us know if you’d like accommodations (including accessible meeting rooms, captioning for virtual interviews, etc.) to help us remove barriers so that you can participate throughout the interview process.\n\nWe look forward to hearing from you", "occupation": "C++"}, {"title": "C++ Developer - Regina", "company": "Veritaaq IT Consulting", "location": "Toronto, ON", "via": "via SimplyHired", "type": "Contractor", "time": "none", "salary": "none", "links": ["https://www.simplyhired.ca/job/h-PK9IxGd3-tBCGcYxR2bHuvxFyyOjJSSL_VvYDdYGVQLhPptkL8aw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "C++ developer:\n\nStart date: asap\nLocation: Regina, Saskatchewan\n\nSkills and Experience:\n• C++ Expertise\n• Knowledge of Code Warrior IDE\n• Knowledge of Web Service Integration with webMethods\n• Knowledge of MQ Series Integration using EDI format\n• Understanding of Mainframe integration\n• Understanding of MAC OS (OSX 10.4.1)\n\nResponsibilities:\n• Performs program design, coding, testing, documentation, implementation, configuration, and support for computer based systems. These tasks are applicable to new systems development, system enhancement and external software packages.\n• Prepares system design specifications, development plans, updates corporate models, and develops backup and recovery procedures.\n• Tracks and monitors the performance of current and/or new systems and corrects operational problems when they occur with production systems software.\n• Maintains close liaison with client departments to keep abreast of the changing business environment which affects the ultimate design... of new systems and enhancements to current production systems.\n• Assists in the retrieval of information, as requested by clients.\n• Maintains current knowledge of technological advancements as they relate to application development and participates in the research and development of new tools, techniques, and processes\n\nJob Type: Contract\n\nLocation:\n• Toronto, ON (Required", "occupation": "C++"}, {"title": "Senior C/C++ Developer", "company": "DesAcc", "location": "Ontario", "via": "via Workopolis", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.workopolis.com/jobsearch/viewjob/mWQj19161NAmfG06g7z0_60ULUIhtnLk5EuLUUi82Ob1VDFrnsNWhurjbGXfMBlZ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.simplyhired.ca/job/rWqtaLAO-tA0fwz09AhrxlucMWUKK_iXo3QHHLwZZsqyMbGBJSoHXQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "At DesAcc, our mission is to achieve a healthier humanity by unlocking and delivering imaging, phenotypic and genomics health data at scale. To do so, we develop and deliver software solutions for enabling healthcare data access to machine learning algorithms and other health data consumers. We believe that today’s data contains the answers to global health challenges and unlocking data silos is essential to creating and inspiring cures. At DesAcc we love unlocking, understanding, integrating and delivering data, we are 'DataVores' at heart and in mind.\n\nRole Summary:\n\nAs a Senior C/C ++ Developer, you will be responsible for refactoring, identifying and resolving software bugs and issues within\n\nDesAcc software. Your expertise will contribute to ensuring the smooth operation and reliability of our software applications.\n\nWhat you will do\n• Utilize your strong C/C++ coding skills to refactor and debug issues across various versions of C and C++.\n• Provide general code maintenance and... work on improving stability, reliability and performance of the codebase.\n• Contribute to the modernization program by utilizing your familiarity with refactoring techniques and actively participating in codebase improvements.\n• Identify and categorize bugs based on their impact and priority, ensuring efficient bug tracking and resolution processes.\n• Independently fix bugs wherever possible, employing your expertise in debugging techniques and code analysis and escalating more serious issues to the Product Development team\n• Collaborate with the Product Development team to escalate and address more serious or complex issues.\n• Able to undertake unplanned work in response to larger business requirements\n• Work closely with the Product team to categorize crash reports and identify patterns in support tickets, enabling efficient issue resolution.\n• Respond promptly and effectively to unplanned work in alignment with larger business requirements.\n• Foster effective communication and teamwork, collaborating with cross-functional teams to share knowledge, coordinate bug fixes, and deliver high-quality software.\n• Apply your Help Desk knowledge to assist in setting up and optimizing software support processes.\n\nWhat you will need (Required Qualifications)\n\nFormal education or equivalent\n• Bachelor's degree in computer science, Software Engineering, or a related field.\n\nYears of experience\n• Should have at least 10 years of relevant work experience\n\nCompetencies\n• Self-management\n• Teamwork\n• Responsibility\n• Problem Analysis\n• Problem Solving\n• Creative Thinking\n• Decision Making\n• Communication\n\nSpecialized skills, knowledge or certifications unique to this role\n• Experience in the Healthcare Industry is desirable.\n• Strong C/C++ coding, refactoring and debugging skills\n• Good working knowledge of Software Development and Help Desk solutions like JIRA, Backlog, Tuleap or similar.\n• Working knowledge of Windows and Linux Server and Networking.\n• Ability to work remotely and effectively in a fast-paced, agile development environment, and experience with DevOps practices and tools such as GITEA, and Jenkins.\n\nWhy you will love DesAcc:\n\nWe are a scaleup, now expanded into North America. At DesAcc we are committed to providing a mutually respectful work environment. We believe diversity and equal employment opportunities among our teammates are critical to our success as a global business. We provide a collaborative work environment and seek to recruit, develop and retain the most talented professionals from a diverse candidate pool across the globe. At DesAcc everyone is an owner, bringing their unique perspective to our team and products. Your voice is important, and we take having a culture based on feedback seriously. We openly share our thoughts to keep decisions decentralized and ensure all team members contribute. You will learn, grow, and be celebrated for your hard work and great attitude!\n• Competitive salary\n• Paid Holiday entitlement\n• Health & Wellness days\n• Dental/Vision/Health insurance - No waiting period (FT)\n• Laptop and monitor(s) (other equipment to support this as required)\n• Professional Development Stipend\n• Paid social events\n• Remote with occasional meetings in the UK or in the Toronto office.\n\nAt DesAcc, we believe diversity and inclusion is a strength we cultivate. We are proud to be an equal-opportunity employer and we do not discriminate based on race, gender, ethnicity, citizenship, national origin, religion, sexual orientation, age, marital status, disability, veteran status or any other legally protected status.\n\nOur work environment welcomes equity, inclusiveness, and diversity by providing accommodations throughout the recruitment process and during your employment here. If you require accommodation, please let us know and we will work with you to meet your needs. Please contact us at hr@desacc.com", "occupation": "C++"}, {"title": "C++ Integrator", "company": "Beachhead", "location": "Toronto, ON", "via": "via SimplyHired", "type": "Full-time, Contractor and Temp work", "time": "none", "salary": "none", "links": ["https://www.simplyhired.ca/job/4L1GTxiQ5onNtZeYehCMeKeiRbowy4cA2bmYVrPhppW8oPXe_T2ypw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Title: C++ Integrator\nJob Type: Contract\nJob Duration: 6 Months\nJob Location: Downtown\n\nWorking with one of our top financial clients, this role calls for an experienced consultant who can work independently, drive delivery and execute on hands-on tasks. This role will be working extensively with XML/C++ code to integrate a new vendor OLTP system into the bank. As the majority of the coding for the system has been completed by the vendor, this role will be focusing on customization work to ensure that the application connects properly and functions to specification. Candidates with experience in payments or e-commerce systems will be given strong preference. Experience with C++, XML and SOA systems are mandatory however any experience with .Net is a nice-to-have. This is a 6 month contract to start, however the work stream is a 3 year integration and as such there is a strong likelihood for extension or option to move to a full-time role.\n\nDesired Skill-Set:\n10+ Years of... experience working through enterprise level SDLC projects\n7+ Years of experience with hands-on C++ (development, integration or customization)\n7+ years of experience with XML along with some experience with XSLT\n5+ Years of experience working on SOA-based systems\n5+ Years of experience with OLTP, E-Commerce or Payments experience\n2+ Years of .Net (development, integration or integration)\n\nExperience:\n• C++: 1 year (Required)\n\nLocation:\n• Toronto, ON (Required", "occupation": "C++"}, {"title": "Query Engine Sr. Staff Developer, Backend, C++", "company": "Kinaxis", "location": "Toronto, ON", "via": "via Workopolis", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.workopolis.com/jobsearch/viewjob/vK54AYeqKPIGvGi7IHdfKJd9DSZjWfT3eUnu_zRLKqox22UJBfiMo5rFYs_aHODB?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "At Kinaxis, who we are is grounded in our common belief that people matter. Each one of us plays an important part in accomplishing our work, building our culture and making a global impact.\n\nEvery day, we're empowered to work together to help our customers make fast, confident planning decisions. This is how we create a better planet – for each other, for our customers and for generations to come. Our cloud-based platform RapidResponse ensures that the products we need – everything from medicine and cars, to day-to-day items like toothpaste – make it to market and into our hands when we need them with minimal ecological footprint.\n\nWe make the world better, and you can too.\n\nQuery Engine Sr. Staff Developer, Backend, C++\n\nJob location: Ottawa, Ontario- Hybrid; Other Canadian locations - Remote\n\nThis is a permanent full-time position.\n\nAbout the team\n\nOur team is all about speed and scale. Through parallel processing, optimum memory usage and exploitation of the capabilities of the... hardware, we are running more queries faster than ever before. Recent advances in CPU architecture and storage technology only add to the opportunities here. We use C++ because it gives us precise control over what happens at the hardware level, and we're applying modern C++ language-standard features to maximize our code's efficiency and expressiveness. Our code runs with high reliability on the biggest servers available. Development is supported by an extensive suite of automated tests that help us get our excellent reliability. We keep an eye on cloud computing concepts, services, and technologies to inform our technical vision and future development plans.\n\nIf you love performance and scale, challenging software engineering problems, and want to help the world's supply chains function more smoothly, this is the job for you!\n\nWhat You Will Do\n• Balance complexity, execution time, and memory footprint to deliver performant solutions\n• Design algorithms and data structures that minimize memory footprint and perform efficiently\n• Enable scalable and performant operations of our multi-threaded query engine\n• Harness the power of our automated test infrastructure and the creative energy of our testers to ensure your code keeps working correctly\n• Advance your knowledge and application of modern C++ to optimize the code to achieve the above goals\n• Collaborate closely with your Agile team members and other stakeholders\n\nTechnologies We Use\n• C++ for core development\n• C# for some infrastructure and testing\n\nWhat We Are Looking For\n• Someone with 8+ years of industry software development experience, with evidence of increasing technical responsibility, on enterprise-scale products\n• Good communication and collaboration skills\n• Experience writing efficient code for optimal memory/CPU usage, preferably in C++\n• Multi-threaded C++ development experience, preferably on Windows\n• Understanding of what's going on \"behind the scenes\" at the CPU, memory, and system level for algorithms you write\n• Experience profiling execution performance using Intel vTune or other performance analysis tools\n• Ability to create and communicate high-level designs, then implement them with attention to details\n• Drive to find best solutions – via innovation, collaboration, and/or use of existing proven frameworks/algorithms/patterns\n• A desire to make a difference in the world!\n\nAre you passionate about this area? Please apply!\n\nThings That Would Definitely Help:\n• Experience using C++ STL containers and algorithms\n• Experience with Design Patterns\n• Experience working in agile methodologies such as Kanban\n• Background in, or understanding of, supply chain management\n\nWhat we have to offer\n• Challenging Work - We love solving highly complex problems. And as the global leaders in our industry, we never stop innovating—our work is never \"done. That's because across our teams and in all roles, every employee is empowered to bring their best ideas forward and to jump in and solve the problems they're passionate about.\n• Great People - We take our work seriously, but we don't take ourselves too seriously! It's in our DNA to celebrate, laugh, and have fun. We are stronger, together, when we are open, honest, and above all, real. Every person is valued here and plays an important role in our shared success.\n• Global Impact - As a global team spanning continents, boundaries, and cultures, every day we are inspired by the impact our work has on our colleagues, our customers, our communities, and the world at large.\n• Diversity, Equity and Inclusion - Diversity, equity and inclusion are more than words to us. They are the guiding principles for building a culture where we celebrate each others' differences, continuously strive for equality and recognize that inclusion makes us stronger as individuals, a company and a global citizen.\n\nFor more information, visit the Kinaxis web site at www.kinaxis.com or the company's blog at http://blog.kinaxis.com/.\n\nKinaxis strongly encourages diverse candidates to apply to our welcoming community. We strive to make our website and application process accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact us at recruitmentprograms@kinaxis.com. This contact information is for accessibility requests only and cannot be used to inquire about the status of applications", "occupation": "C++"}, {"title": "Experienced C++ Unreal Developer", "company": "Blue Isle Studios", "location": "Toronto, ON", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.ca/job/Fp-Aa_sGg14Ep7iMVRIemvBjI0mk_X4xMxY4sTvEJrre-blr4roDbg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Blue Isle Studios is hiring!\nWe are looking for a skilled programmer to help us out with our brand new project; a multiplayer action game featuring beautiful environments and fast paced first-person gameplay. The ideal candidate is able to work closely with design to develop high quality experiences for players on all kinds of platforms ranging from PC to consoles. Most importantly, we are looking for someone who is genuinely passionate and excited to create amazing video game experiences.\n\nThis is a full-time employment position working from our office located in downtown Toronto. We are not looking for remote contract work at this time.\nThe role will consist of design and implementation of various gameplay systems in a multiplayer action title. More specifically, you will be involved in every stage of development; from building the initial prototype to shipping the final build. Experience working with Unreal Engine is a requirement. Excellent communication skills are important; your... role will require you to serve as a knowledge base as the team gears up for Unreal Engine development. Our ideal candidate has a minimum of three years’ experience and has shipped at least one PC or console game in the past.\n\nFrom a technical standpoint, we’re looking for someone that can work within the constraints and tools provided; this means that the right candidate can create major systems in Unreal without relying on external plugins, assets or middleware. The right candidate would have experience with various systems such as networking, AI/pathing, gameplay scripting, FX and database management. Intimate knowledge of C++ and strong mathematics skills including trigonometry and linear algebra are a must. Additional assets that are not requirements include C/C# programming, experience with multithreaded code, knowledge of CG/HLSL and knowledge of Linux/SSH/PHP/HTML or other web technologies.\n\nBeing a small independent studio, this position means that you will have the opportunity to work closely with our small development team of nine, and help us shape an incredible gameplay experience. If you are interested in working with us, we’d love to hear from you.\n\nPlease submit your application with a resume and portfolio.\nIf you’d like more information on Blue Isle Studios, who we are, and what we do, have a look right here: http://blueislestudios.com/about-2/\n\nJob Type: Full-time\n\nPay: $70,000.00 per year\n\nExperience:\n• Unreal Engine: 2 years (Required)\n\nEducation:\n• Diploma/Certificate (Required)\n\nLocation:\n• Toronto, ON (Required", "occupation": "C++"}, {"title": "C++ Developer", "company": "Alltech Consulting Services", "location": "Toronto, ON", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.ca/job/arVjK8S6BGDR2gw00Qc2thAz4hW15QruETq27MfjmcTuUAcBTSlM3A?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.jobs-cast.com/job/idfw8hqs/c-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Description\n\nLevel 5\n\nWhat We Do:\n\nThe Listed Sales and Trading team is a diverse and inclusive technology team. We are responsible to build and manage some of the most critical trading platforms. Our engineers are creative in solving operating problems, understand the big picture, build and integrate tools to automate sales and trading flows. We are working directly with our institutional clients (sales and trading desks, external clients) to help manage and transfer their risk.Our massively scalable software and systems cover a wide-range of asset classes, from traditional equities cash, derivatives, ETF, FX, to large part of Fixed Income, commodities, bonds, swaps and cross-asset instruments. We support fully automated low-latency order handling up to highly complex manual and customised workflow required by some of our advanced users. We develop cutting-edge systems that are transforming our key business and enable transactions to occur in microseconds.While our infrastructure... is mostly written in C++ and Python, we are also building services in Java, .NET, C, KDB and Typescript. We are open-minded about our technology choices, leverage and contribute to open-source technologies.\n\nQualifications\n\n#Experience in customer-facing, highly-optimised C++ and Python applications\n\n#Strong OS Computing Fundamentals\n\n#Experience in software development, including a clear understanding of data structures, algorithms, software design and core programming concepts\n\n#Excellent communication skills including experience speaking to technical and business audiences and working globally\n\n#Analytical skills to perform functional and technical analysis\n\n#Interest in designing, analyzing and troubleshooting large-scale distributed systems.\n\n#Systematic problem-solving approach, coupled with a sense of ownership and drive\n\n#Knowledge of continuous integration tools, software orchestration and distribution\n\nJob Overview\n• Job ID\n\nA4963\n• Date Posted\n\nApril 29, 2022\n• Location\n\nToronto - ON - Canada\n• Experience\n\n10+ Years\n• Qualification\n\nBachelor Degree\n\nJob Skills\n\n.NET C/C++ Python Typescript", "occupation": "C++"}, {"title": "C++ Developer $75K", "company": "Robert Half Technology", "location": "Toronto, ON", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://fr.simplyhired.ca/job/zsFNc0TXWNzBv64Hd_kctIKK1D4lAGhaH2k35FHr0g_d-d35OrAgHg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "THE POSITION\nThis position is for an intermediate developer. The candidate will work on a variety of development tasks in a growing organization and focus on our client-server transit workforce solutions. This includes our employee bidding, dispatch, workforce management, timekeeping and self-service modules.\nEDUCATION and/or EXPERIENCE\nThe successful candidate must possess a College or University degree in Mathematics, Computer Science, Engineering Science or equivalent.\n5+ years of C++ in Windows environment and Object Oriented Analysis and Design. Experience in developing GUI with Visual C++ and MFC is preferred.\n5+ years of Programming experience with relational databases (MS SQL, Oracle)\n1+ years of Web development with experience in HTML, DHTML, JavaScript, and Custom Style Sheets\nGUI design experience is an asset\nExperience with thin-client and service-oriented architectures is an asset\nKnowledge of transit, human resources and finance applications would be considered an... asset\n\nPay: $75,000.00 per year\n\nExperience:\n• C++ Developer: 3 years (Required", "occupation": "C++"}, {"title": "Developer- VB, C++ and Java", "company": "Enterprising Solution", "location": "Toronto, ON", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.ca/job/UyBO5L_1kBNbCiFE-fWiglOP1ExQjP-PAf71KK0cHB0anYVBL4nKGg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Enterprising Solution is a Toronto based Data Management, Process Improvements and Quality Improvements firm that caters to the production, marketing, project management, and accounting and management needs of leading firms across Ontario. We have the expertise to solve industry's problems, be they in data management, production, document management, quality, accounting, marketing or strategic planning.\n\nJOB SUMMARY:\nWe are currently looking an ambitious Java, C, C++, C#, VB, VB.Net developer for our IT department. Knowledge to write code using languages such as (and not limited to) Java, C, C++, C#, VB, VB.Net.\nNo experience is mandatory.\n\nJob Specific Skills/Special Functions:\n\nDevelopment knowledge with Java, VB, MS Access, Oracle/SQL Server,\nData transfer from excel tables to Access and transfer all programs to Access.\nBasic Understanding of RDBMS databases such SQL Server and Oracle. Basic understanding of modern software design and development methodologies.\nExperience on one or... more full release project life cycles.\nBasic understanding of testing tools and unit and integration test scripting, and testing methodologies.\nBasic Database Administration knowledge.\nAble to apply consistently quality and security standards.\nDeveloping general project management/team leader skills. Ability to work effectively in a team and with clients", "occupation": "C++"}, {"title": "Applications Developer - C, C++", "company": "Brainhunter Systems", "location": "Toronto, ON", "via": "via SimplyHired", "type": "Contractor and Temp work", "time": "none", "salary": "none", "links": ["https://www.simplyhired.ca/job/XM14ztuiYpGEw9keB82rPIb59_EEnnTQJWuxplImx8I4X6FpM7fbBA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job details:\n\nPosition : Applications Developer - C, C++\nWork location : Canada-British Columbia-Burnaby / Toronto\nDuration : 06 Months\n\nJob Description:\n\nApplications Developer - C, C++\n• Perform Coding, package configuration compliant with the required development standards, prepares component and assembly test plans, including conditions, data and expected results, and performs component and assembly testing.\n• Creates system documentation for computer programs and subsystems in development or maintenance environment.\n• Able to lead subsystem designs and participate in system design projects.\n• Expected to provide effective knowledge transfer on all work performed to select employees\n• Analyzes, resolves, or assists others in resolving test or production problems\n• Supports business studies, costing and feasibility studies, and proposal preparation efforts\n\nSKILLS:\n• .NET (VB/C#)\n• Big Data (Hadoop/Splunk)\n• SQL/PLSQL\n• ETL Processing\n• Web development\n• PHP\n•... Wordpress\n\nKeywords:\n• Applications Developer, .NET (VB/C#) , Big Data (Hadoop/Splunk), ETL Processing, Wordpress\n\nPlease answer the questions below to push your resume on top of hiring manager list\n• How many years of experience you do have as Applications Developer - C, C++?\n• How many years of experience you do have in .NET (VB/C#) ?\n• How many years of experience you do have in SQL/PLSQL, PHP, Wordpress,if yes how many years respectively?\n• Do you have experience in Big Data (Hadoop/Splunk/Tableau),if yes how many years respectively?\n• Do you have experience in Web development,?\n• Are you Canadian Citizen or Permanent resident of Canada?\n• What is your expected pay rate per hour?\n• Are you Temp/Reg/Inc.: ?\n\nGirish V\nIT Recruiter , North America\nBRAINHUNTE R ®\nBrainhunter Systems Ltd\n• 6479459535 |* E.* girish.vishwambharan AT Brainhunter DOT com |\n\nJob Type: Contract\n\nExperience:\n• Applications Developer - C, C++: 3 years (Required", "occupation": "C++"}, {"title": "Junior Programmer", "company": "Apple One", "location": "Toronto, ON", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.ca/job/UgNqWDcJEEgeCH96wv9TxBQsRL5DK-PkTnzqqNHxCLgAZzlxjNIFdw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Junior Programmer\n\nJob Ref: FC 568\n\nLocation: Markham\nCompensation: $ 45,000- 50,000 + Bonus\nBenefits: Medical, Dental and Vision\n\nOur client is looking for a junior programmer this could be a fantastic opportunity for a recent graduates in the computer science or computer engineering field that holds a Bachelors degree with some experience in C++ and SQL\n\nResponsibilities:\n\n•The Programmer is responsible for making application development configuration changes to CDP (C++ based applications).\n• They will be responsible to understand the business requirements and transform them into configuration changes as per the technical specifications.\n\n•This process invokes the full software development life cycle, from development, to testing, and finally implementation.\n• Work with IT Business Solutions Analyst and Relationship Management Group’s representative to understand and analyze the requirements\n• Provide quotes for programming requests\n• Configure client setup according to the... technical requirements\n• Perform unit and UAT testing evaluate test results, make necessary adjustments to client setup, and regenerate output.\n\nRequirements:\n• 1-2 years of application development experience in Windows operating system is required\n• Working knowledge of MS SQL (stored procedures, functions, queries) is required\n• Some experience in one or more object-oriented programming languages is required (C++ is preferable)\n• Excellent understanding of various file formats\n• Excellent verbal and written communication skills\n• Ability to work well in a team environment\n• Ability to manage competing priorities across multiple projects.\n\nEducation:\n• Bachelor’s degree/diploma in Computer Science or Engineering", "occupation": "C++"}, {"title": "C++ Consultant", "company": "TAL Group", "location": "Toronto, ON", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.ca/job/ZYDw3zB6wmyVWgswM6umWF4kABiS2nVhQAP0d3laOzEsKBF9hfKPiA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Our client is looking for a C++ consultant for a 6 month contract engagement. As a senior member of the development team, you will participate in requirements analysis and assist to design, implement, integrate, test, document and deploy backend related systems. You will also provide professional technical support to new and existing applications, and will be well-versed in SDLC and in building high-performance, high volume systems.\n\nResponsibilities:\n● Contributing to ongoing enhancement processes of the client's ontology\n● Leveraging user data and other terminological resources to take initiatives to enhance the ontology\n● Enhance the metadata associated with the client's website based on the ontology and other information leveraged by other teams in the organization\n\nRequired Skills & Experience:\n● 5+ years C/C++ development experience in a production environment\n● Experience developing applications in Win64/32 development environments, UNIX/LINUX/QNX\n● Scripting experience with at... least one of the following: Bash, Python, Shell, Perl\n● Experience building high availability / scalability systems\n● Knowledge of web services, REST/Soap\n● SQL Experience with SQL Server or Oracle\n● Strong documentation skills\n● Computer Science Degree", "occupation": "C++"}, {"title": "Sr Java and C++ Developer with distributed / grid computing - Perm", "company": "CareerDriven / JulieCoxRecruiting", "location": "Toronto, ON", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.ca/job/bBjjmeUSMcGl-slZU4T31KkqSRyZ7xbqIY-kQ7i4IZweJlQ7exCuyA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Our financial client is looking for a high quality Sr Java and C++ Developer (client calls it Technical Specialist) with some sort of distributed processing or grid computing experience. No financial experience needed. The complex derivatives analytics/risk systems is very complex, low volume. Again, no derivative, cap markets or financial experience is required. This is a perm role downtown Toronto with a salary up to $110k + bonus + pension + stock/RSP plan, 4 weeks vacation and full benefits + bank discounts.\n\nOur client is looking for a seasoned Technical Specialist to help build out and optimize complex derivatives analytics application running on a distributed/grid computing platform within Fixed Income & Currency (FIC) technology. This Toronto based position requires exceptional communication skills necessary for extensive interactions with front office, trading/support and quant groups on a frequent basis. Candidate should have experience developing large complex systems using... both Java and C++ and be capable of generating independent ideas while working effectively within a global team split across several different locations and time zones.\n\nYou will:\n- Assist with efforts to increase the performance and stability of our platform by working on cross team initiatives\n- Help identify and implement optimizations to increase the efficiency of our computing platform\n- Collaborate with other developers to deliver solutions in line with strategic FIC IT Architecture\n- Provide second-level technical support as needed\n- Provide exceptional levels of service for FIC IT customers\n\nMust have:\n- Highly skilled in Java AND C++ programming\n- Highly skilled in distributed / grid computing technologies, such as Data Synapse, IBM Symphony, etc.\n- Experience with databases and distributed cache products (Oracle Coherence, IBM ExtremeScale, NoSQL, Big Data etc.)\n- Experience with cross-platform technologies (XML, RV)\n- Understanding of multi-threaded, distributed application development\n- Experience working on very large complex applications\n- Excellent communications – verbal and written to deal with business users/traders and international team members\n\nNice to have:\n- Ability to formulate and implement efficient algorithms for fast-time systems\n- Experience working with Fixed Income analytics for flow and/or structured products (derivatives)\n- Experience in risk management or structured rate products, knowledge of capital markets and or trading\n- background in Maths, Physics, Quantitative Science, etc.\n\nJob Type: Permanent\n\nLanguage:\n• Canada (Required", "occupation": "C++"}, {"title": "Senior Java or Python Developer with C++", "company": "Seven Hills IT services", "location": "Toronto, ON", "via": "via SimplyHired", "time": "20 days ago", "type": "Contractor", "salary": "none", "links": ["https://www.simplyhired.ca/job/4M-o2AyWUACZ9oHTjUfNLBBUrlRaUdunZoyijcpNu0f5vYTtxoKNOw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Title: Senior Java/Python Developer with C++ skills\n\nLocation: Toronto, ON (Hybrid)\n\nJob Type: Contract\n\nNote: Work from the Client's office 4 days per week\n\nJob Description:\n\nResponsibilities\n\n· Manage timelines/deliverables within the team towards the successful delivery of projects.\n\n· Design software solutions by interacting with portfolio managers, traders, operations staff and peers to understand requirements.\n\n· Develop solutions that are in line with the client's technology biases, deliver efficiency and scalability, and enable new trading activities.\n\n· Provide knowledge transfer to team members and support staff through application demos, walkthroughs, and documentation.\n\nSkills\n\nMust have\n\n· Experience in Java or Python (6+ years) in an enterprise environment, covering the whole development life cycle.\n\n· Knowledge and technical skills in C++\n\n· Must have good communication skills, strong client-facing skills and able to manage client's expectations.\n\n· Good technical... skills with AWS technologies such as Lambda, SNS, SQS, S3\n\nNice to have\n\n· Capital Markets domain experience.\n\n· Preference will be given to candidates experienced both in Java and Python.\n\nPlease fill in the following details & share your resume.\n\nFull Name:\n\nCurrent Location:\n\nPhone:\n\nEmail:\n\nSkype ID:\n\nAvailability:\n\nHourly Rate / Salary:\n\nAre you willing to relocate/travel to Toronto, ON (Hybrid) (Yes/No/NA):\n\nCanada Immigration Status:\n\nJob Type: Contract\nContract length: 12 months\n\nSalary: $60.00-$70.00 per hour\n\nWork Location: In person", "occupation": "C++"}, {"title": "Software Developer C#, C++", "company": "S&P Global", "location": "Toronto, ON", "via": "via Workopolis", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.workopolis.com/jobsearch/viewjob/6rpCokZ8Vmh2PDjxcoMLeJBNj520BlzuTR9wqPrKYebRDWCzdbYf1Wqnw-gsKbnB?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "The Role: Software Developer (C++/C#)\n\nThe Team: Markit Digital is looking for talented, intellectual developers who have a passion for solving difficult problems. We need software engineers who can help us develop and maintain systems that are always online and can handle hundreds of thousands of transactions per second. We write code primarily in 1) C++ using features from C++20, and 2) C#. We are looking for engineers who stay up to date with the latest advances in technology, whether that means C++, C#, Java, compilers, hardware, or operating systems. You are passionate about technology and can act as an ambassador to other teams within Markit to keep our systems moving forward.\n\nThe Impact: We are continually developing and improving our applications, which is where you come in. We are looking for creative, talented, and motivated developers who have a passion for solving difficult problems. We need software engineers who can help us develop and maintain systems that are always... online and can handle hundreds of thousands of transactions per second. Much of our time is spent focusing on developing new capabilities or reworking and enhancing legacy capabilities, necessitating strong design skills which will lead to robust solutions.\n\nBasic Qualifications\n\nProficiency in Modern C++. We write code primarily in C++ using features from C++11/14/17/20.\n\nBachelor’s and/or master’s degree in Computer Science or related technical discipline or demonstrated projects if self-taught.\n\nStrong knowledge of computer science fundamentals, algorithms, and data structures.\n\nExperience with SQL databases.\n\nPreferred Qualifications\n\nReal-time event processing background and high-throughput optimization skills.\n\nExperience with concurrent programming and distributed systems.\n\nBackground in the financial markets, economic theory, or statistics.\n\nCMake and Git knowledge.\n\nProficiency in C# or Java.\n\nMS SQL Server, Cassandra, Hadoop, S3, Elasticsearch\n\nWhat’s in it for you:\n\nHappy developers are productive developers. We understand your desire to have a good work and life balance. We hold regular code reviews to ensure our software is of the highest quality and so that we can all learn from each other. We regularly collaborate via whiteboard design sessions and virtual sessions. We constantly challenge our own assumptions and never accept “because that is the way we’ve always done it” as a justification.\n\nFlexible Working\n\nWe pride ourselves on our agility and diversity, and we welcome requests to work flexibly. For most roles, flexible hours and/or an element of remote working are usually possible. Please talk to us at the interview about the type of arrangement that is best for you. We will always try to be adaptable wherever we can.\n\nReturn to Work\n\nHave you taken time out for caring responsibilities and are now looking to return to work? As part of our Return to Work initiative (link to career site page when available), we are encouraging enthusiastic and talented returners to apply, and will actively support your return to the workplace.\n\nThe Location: Canada remote (Hybrid options available in London, Calgary & Ontario)\n\nThis role is limited to persons with indefinite right to work in Canada.\n\nCompensation/Benefits Information:\n\nBase salary for this role will be based on the individual’s geographical location, experience, and qualifications for the role.\n\nIn addition to base compensation, this role is eligible for an annual incentive plan. This role is not eligible for additional compensation such as sales commission plan.\n\nThis role is eligible to receive additional S&P Global benefits. For more information on the benefits, we provide for our employees, please click here .\n\nAbout Company Statement:\n\nS&P Global delivers essential intelligence that powers decision making. We provide the world’s leading organizations with the right data, connected technologies and expertise they need to move ahead. As part of our team, you’ll help solve complex challenges that equip businesses, governments and individuals with the knowledge to adapt to a changing economic landscape.\n\nS&P Global Market Intelligence partners with customers to broaden their perspective and operate with confidence by bringing them leading data sources and technologies that embed insight in their daily work.\n\n-----------------------------------------------------------\n\nEqual Opportunity Employer\n\nS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.\n\nIf you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nUS Candidates Only: The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.\n\n----------------------------------------------------------- 20 - Professional (EEO-2 Job Categories-United States of America), IFTECH202.1 - Middle Professional Tier I (EEO Job Group), SWP Priority – Ratings - (Strategic Workforce Planning)\n\nJob ID: 285972\n\nPosted On: 2023-04-27\n\nLocation: Virtual, Ontario, Canada", "occupation": "C++"}, {"title": "Application Developer C++ & Java, w/ sql or sybase", "company": "CareerDriven", "location": "Toronto, ON", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.ca/job/xQ636ynyhAMIAX7ZNywgY1Amw0vL0PsmBwwCdXJMLEX9RcGMLky5yg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Contract-- Toronto\nApplication Developer EXPERT\n\nKey requirements:\n- Must have 5+ years of C++ AND Java (Spring) experience along with strong object oriented skills\n- experience with either SQL Server or Sybase required\n- must have a banking background along with 2+ years of Capital Markets experience (fixed income, derivatives preferred)\n- excellent communication skills, team player, able to work with the users (traders)\n- Note this request has been open for 2 weeks now, releasing to additional suppliers because we will need coverage on it.\n\nKeys:\n- New position; senior C++/Java developer to maintain existing MarkitWire connectivity and build out new infrastructure for MarkitWire STP. Candidate should come from banking background, previous knowledge of MarkitWire is major plus. Old platform in C++, new one in Java\nExperience:\n- Must have 5+ years of C++/Java (Spring) experience along with strong object oriented skills\n- Experience with either SQL Server or Sybase required\n- must have... a banking background along with 2+ years of Capital Markets experience (fixed income, derivatives preferred)\n- Excellent communication skills, team player, able to work with the users (traders)\n- 2-3 step interview process (phone screen followed by 1-2 in-person interviews, will be required to write a small code test based on C++/Java)\n- Team of 10 (8 in Toronto, 2 in NY), reporting to Director, Head of Derivatives Trading Processing", "occupation": "C++"}, {"title": "Technical Support Engineer (C++ & XML) Full Time", "company": "Staffing Company at GTA", "location": "Toronto, ON", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.ca/job/Uz8dOaPadeUYd65XD2voShskqL-ClBKOLQ6-LCARrPKOjujRfqVORQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "There is no hands on development. They will become a SME of the applications and will support with production issues; reviewing integration points and error logs to help solve and troubleshoot production issues. Additionally they will support with projects reviewing them before production ensure the all configuration and integration points have been taken into account and providing signoff that the application will not fail.\n\n· Coordinate deployment tasks with end-user, operations and quality management\n· Document all work in accordance as per OUR CLIENT'S standards and with re-use in mind\n· Perform code level impact analysis as well as produce data mapping documents, which requires ability to correctly interpret various layouts. Eg: Interface Agreement document, Data mapping document etc\n· Review all changes to ensure there is no impact to various systems to ensure there are no issues when the application is moved to production\n· Prior to production review risks and issues associated... with changes and provide potential impacts to the business\n· Provide level 4 support for production issues review error logs and integration points to help troubleshoot and solve\n· Provide SME advice and updates on incident bridges\n· Conduct configuration reviews to ensure the changes will not impact the system\n\nExperience/ skill set:\n\n· Must have 5 or more years of experience developing applications\n· Must have experience supporting and troubleshooting production issues\n· Must have experience with C++ and XML\n· Must have experience with BASE24, its interfaces, tools, technology, especially HP NonStop/Tandem\n· Experience with payment hubs in front-end development and back-end integration considered an asset\n· Strong knowledge and experience with configuration and integration reviews considered an asset\n· Candidates who are currently a SME of an application in their current role considered an asset\n· Payment knowledge and production support background are assets for your application\n\nWhere candidates have been falling short:\n\nI have been able to find candidates who are strong in C++ and XML, however they have not had the production and Tandem support.\n\nJob Type: Full-time\n\nExperience:\n• C++, XML: 5 years (Required", "occupation": "C++"}, {"title": "DÉVELOPPEUR EMBARQUÉ C/C++", "company": "IT link", "location": "Toronto, ON", "via": "via Workopolis", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.workopolis.com/jobsearch/viewjob/VH1GRNaXpVp3zPTRfam6lnI4f62nuUQ7dBE1ArLATA2aP6QIY2zYkXVwW8XAwGQc?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "L’ESSENTIEL\n\nPermanent ou Contrat\n\nAéronautique / Spatial\n\nPartiellement éligible au télétravail\n\nToronto\n\nCOMPÉTENCES\n\nC/C++\n\nLogiciel\n\nIoT, les systèmes\n\nPROFIL\n\nBaccalauréat\n\n> 2 ans\n\nÀ PROPOS\n\nIT Link, 700 employés sur 3 continents, recrute un développeur logiciels C/C++ qui pourra travailler de partout au Canada pour des postes permanents et/ou freelances. C'est une création d'emploi dans une équipe soudée et le rôle a vocation à s’enrichir dans le temps car nous recrutons aussi sur le potentiel, les valeurs de curiosité et de motivation. Ce poste peut permettre une évolution rapide avec un parcours personnalisé à la hauteur de tes ambitions.\n\nEn lançant son plan Connext’25 en janvier 2021, le Groupe IT Link réaffirme sa position de leadership dans le domaine des systèmes connectés en s’appuyant sur un modèle de développement durable et engagé avec des projets, des initiatives et des événements soutenant la responsabilité sociale et environnementale de l’entreprise. Constate par... toi-même notre excellente réputation sur Glassdoor : 92% de nos Linkers nous recommandent. IT Link est aussi certifié “Great Place To Work Canada”!\n\nLe siège nord-américain de Montréal avec aussi un bureau à Toronto, joue un rôle moteur dans le développement international du groupe.\n\nDESCRIPTIF DU POSTE\n\nParmi tes responsabilités tu auras en charge :\n• Développement embarqué pour la conception de systèmes connectés avec des applications multi-secteurs\n• Développer, vérifier et valider le code\n• Reverse engineering : analyse du code source\n• Vous rédigez les spécifications techniques ainsi que la documentation liée au code\n• Vous participez à la conception de l’architecture des solutions\n• Elaboration de tests unitaires\n• Correction des anomalies détectées par l'équipe Intégration/Validation\n• Participation aux réunions d'avancement du sous-système concerné\n• Reporting régulier sur les tâches confiées.\n\nAVANTAGES IT LINK (pour nos employés permanents)\n• 4 semaines de vacances payées, 10 journées maladie\n• Possibilité de travailler hors du Canada un 2 semaines par an après 1 année en emploi\n• Formation: en 2021, près d’un tiers de nos Linkers dans le monde ont reçu une formation (technique, langues, coaching interne…)\n• Assurances collectives dès le 1er jour travaillé (70% payé par IT Link)\n• Cotisation REER d’IT Link (4%)\n• Un suivi carrières et travailler pour une entreprise à taille humaine!\n• Rejoindre une entreprise avec une nouvelle vision 2025, en plein développement international\n\nPROFIL\n• Vous disposez de plus de 2 ans d’expérience en développement software embarqué (C/C++/Python) sur un environnement Linux\n• Vous connaissez l’utilisation des différents protocoles de communication\n• La connaissance du développement de software embarqué en temps réel est un atout ainsi que de l’expérience dans la rédaction des tests unitaires.\n\nVotre profil correspond ? Postulez et venez rencontrer nos équipes afin d’échanger sur nos activités !\n\nEn accord avec notre politique diversité, ce poste est ouvert aux personnes en situation de handicap.\n\nLE PROCESSUS DE RECRUTEMENT\n• La rencontre avec Romain ou Raphaëlle pour établir un projet professionnel\n• L’évaluation avec un gestionnaire IT Link pour challenger et mettre en adéquation tes compétences avec les problématiques de nos projets.\n• L’intégration pour te féliciter de nous avoir rejoint, présenter notre organisation ainsi que les autres nouveaux arrivants.\n\nParfois un test technique en ligne entre l’étape 1 et 2 peut-être demandé pour préparer l’évaluation.\n\nRAPHAELLE FOUEMA\n\nHâte d'échanger avec vous sur vos projets professionnels et de vous presenter nos projets au Canada :-)\n\nLES PLUS DE LA VIE CHEZ IT LINK\n\n4 semaines de vacances payées et 10 journées maladie\n\nAssurances collectives dès le 1er jour travaillé\n\nParticipation épargne-retraite à hauteur de 4%\n\n2 semaines par an de télétravail dans un autre pays", "occupation": "C++"}, {"title": "Senior C++ Developer (Research)", "company": "Mapsted Corp.", "location": "Mississauga, ON", "via": "via Workopolis", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.workopolis.com/jobsearch/viewjob/Xnjcl31ZS_QizbgwKPl_jcOS3xfvEL8KigOiZVRu_hqiLWLurbCs3rc2Fqr93gPn?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company: Welcome to Mapsted (www.mapsted.com)! We are a leading location technology company that provides groundbreaking location-based digital products to help our clients reach and exceed their business goals. Our innovative solutions offer cutting-edge indoor navigation, targeted marketing, and real-time location intelligence without the need for Bluetooth beacons, Wi-Fi connectivity, or additional hardware. With approximately 800,000,000 square feet of physical space enabled across 6 continents, we are transforming the way people navigate the world. Join us at Mapsted and be a part of the future of location technology!\n\nJob Description:\n\nWe are looking for passionate, smart, self-motivated, and eager to learn individuals with a solid software engineering background to join our core R&D team. You will be involved in the development of key software system components. We are looking for candidates who are excited about the opportunity to work with a cutting-edge team of R&D engineers... and contribute to a fast-pace environment.\n\nRequired Background:\n• B.Sc./M.Sc. in Software Engineering, Computer Science, or a related field\n• 6-8 years industry experience\n• Strong experience working with C++17, C++14, or C++11\n• Strong understanding of object-oriented programming concepts, designs, best practices\n• Strong analytical, conceptual, innovative, and problem-solving abilities\n• Ability to write clear, concise, well-structured, and well-organized code\n• Excellent English communication skills are a must (both orally and written)\n• Ability to identify weaknesses in existing code and improve it\n• Strong understanding of data structures and code optimization\n• Willing to do whatever it takes to deliver results\n• Experience with C++ configurations (e.g., CMake, installing/building/importing libraries)\n• Experience in a research setting is an asset\n\nInterested candidates should send their resume and a cover letter describing their experience and suitability for the position.\n\nJob Types: Full-time, Permanent\n\nBenefits:\n• Dental care\n• Extended health care\n• Flexible schedule\n• Life insurance\n• On-site parking\n• Paid time off\n• Vision care\n• Work from home\n\nSchedule:\n• Monday to Friday\n\nWork Location: Hybrid remote in Mississauga, ON L5R 3L7", "occupation": "C++"}, {"title": "C++ Developer", "company": "Open Systems Technologies, Inc.", "location": "Mississauga, ON", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.ca/job/4QIGA8GQot9cHtl79b9sKUw_Jyk4jrB_kkkz_HLuPace83Ol9U3FRA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Title: C++ developer for the Equity Derivatives Risk Analytics\n\nReq Description: Client is looking for a C++ developer for the Equity Derivatives Risk Analytics Team (part of the ICG Equity Derivatives-Technology Department).\n\nWe are looking for a developer to solve a variety of interesting problems that arise from building out the next generation equity derivative analytics platform. The team interacts directly with the quantitative groups and brings together all the components for downstream usage. High profile projects that you will work on include web data services and security lifecycle all the way down to language binding generators. There is an opportunity to learn about equity derivatives from the business, analytics, and systems perspective. The team is based in Toronto, with colleagues in the UK and NY.\n\nResponsibilities:\n\no Design and extend the system to support requirements from new downstream systems\n\no Work with the data and testing teams to complete the integration of... new analytic models\n\no Understand and improve performance across complex sets of systems\n\no Able to work across platforms on Windows and Linux\n\no Primary development is in C++, with cross-language exposure to C#, CPP-CLI, Python, and Java Req Qualifications:\n\nRequired Skills\n\no Experienced development in C++ on Windows or Linux\n\no Comfortable implementing and debugging across multiple platforms and languages\n\no Proficiency in generating requirements and turning them into solutions\n\no Ability in picking up new APIs Helpful Skills\n\no Familiarity with Boost and standard C++ libraries\n\no Exposure to Python and Python testing frameworks\n\no Finance knowledge\n\nJob Type: Full-time\n\nExperience:\n• C++: 3 years (Required)\n\nLocation:\n• Mississauga, ON (Required", "occupation": "C++"}]}