{"url": "https://www.google.com/search?q=python+coop+in+Toronto&ibp=htl%3Bjobs&sa=X&hl=en", "jobs": [{"title": "Web Developer (Python/React) - 16 months Co-op/Internship", "company": "Intact", "location": "Toronto, ON", "via": "via Workopolis", "type": "Full-time and Internship", "time": "none", "salary": "none", "links": ["https://www.workopolis.com/jobsearch/viewjob/em6HDwH1_hBPY05Frs8x0kzRbdEulkABC-ITB25bmk7cfOehkd9Jg_DqBpjESTds?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Our employees are at the heart of what we do best: helping people, businesses and society prosper in good times and be resilient in bad times. When you join our team, you’re bringing this purpose to life alongside a passionate community of experts.\n\nFeel empowered to learn and grow while being valued for who you are– here, diversity is a strength. You have our commitment to support you in reaching your goals with tools, opportunities, and flexibility. It’s our employee promise.\n\nOur hybrid work model provides the balance between working from home and enjoying meaningful in-person interactions.\n\nRead on to see how you can shape the future, win as a team, and grow with us.\n\nAbout the role\n\nWe’re looking for a Software Development I to join our growing team!\n\nAs a Web Developer Co-op/Intern, you will participate in a 16-month placement to gain valuable, first-hand, corporate and professional experience at the largest provider property and casualty insurance in Canada, and a leading... provider of specialty insurance in North America\n\nWhat you’ll do here:\n• Innovate and develop on our internal dashboard to meet needs from users and fellow co-workers\n• Code in a modern technology stack:\n\no Next JS, React\n\no REST API, Python, Fast API\n\no SQL, MongoDB\n• Gain proficiency with IntelliJ / VS Code and other development tools\n• Contribute in Service Oriented Architecture (SOA) application development using GitHub, Docker and OpenShift environments\n• Create applications using industry standard development methodologies, such as Agile/Scrum/Kanban\n• Provide proactive and reactive support for production systems to guarantee their functionality\n• Resolve Incidents, Defects and Problem tickets by finding creative solutions, solving complex problems, coding, testing, and debugging a wide variety of systems\n• Be creative and come up with ideas to improve our services and user experiences\n\nWhat you bring to the table:\n• Currently pursuing a university degree in Computer Science, Engineering or a related field\n• Available to work with us for 16 months from May 2024 to August 2024\n• Must be returning to full time studies in 2025 following the internship\n• Preference for student graduating in 2025 and enrolled in a formal co-op/internship program\n• Familiarity with:\n• Building server-side apps using Java 8+, JDBC, Hibernate\n• Creating web services or APIs using REST (and or SOAP), Spring Boot, Spring framework\n• Relational databases like Oracle (and PL/SQL) and No-SQL databases such as MongoDB or ElasticSearch\n• Students with a passion for learning about application development practices and methodologies\n• A “can do” attitude, passion for problem solving, and the ability to take initiative\n• Basic coding experience is an asset\n\nYour career starts here. Apply today!\n\nWe can’t wait to learn more about you. When you complete your application, remember to include your resume and University/College transcript. We hire co-ops every semester (Winter, Summer and Fall)! We’re accepting applications now through September 22, 2023 at 11:59pm EST. All submissions will be reviewed during this time, as well as after the posting closes.\n\nWhat we offer\n\nWorking here means you'll be empowered to be and do your best every day. Here is some of what you can expect as a temporary member of our team:\n• Inspiring leaders and colleagues who will lift you up and help you grow\n• Access to tools and resources to support physical and mental health, embracing change and connecting with colleagues\n• A dynamic workplace learning ecosystem complete with learning journeys, interactive online content, and inspiring programs\n• Inclusive employee-led networks to educate, inspire, amplify voices, build relationships and provide development opportunities.\n• A Community Impact program, because what you care about is a part of what makes you different. And how you contribute to your community should be just as unique.\n\nWe are an equal opportunity employer\n\nAt Intact, we value diversity and strive to create an inclusive, accessible workplace where all individuals feel valued, respected, and heard.\n\nIf we can provide a specific adjustment to make the recruitment process more accessible for you, please let us know when we reach out about a job opportunity. We’ll work with you to meet your needs.\n\nClick here to review other important information about the hiring process, including background checks, internal candidates, and eligibility to work in Canada.\n\nIf you are an employee of Intact or belairdirect, please apply for this role on Contact People", "occupation": "python coop"}, {"title": "AI Backend Developer – 4 Month Co-op/Internship (Fall 2023)", "company": "Intact", "location": "Toronto, ON", "via": "via Workopolis", "type": "Full-time and Internship", "time": "none", "salary": "none", "links": ["https://www.workopolis.com/jobsearch/viewjob/udGfAQMjSsOMvM3usdRnfEhx-r_wyOFu_nLulG8Nk7YIMzN0zyLYwdjOM7w6k-lO?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Who needs insurance? Everybody. That keeps us busy. Very busy. At the Intact Lab, we use machine learning, data science, software engineering, AI, agility, UX and design thinking to transform the customer experience for millions of Canadians.\n\nJoin our team and get ready to explore, take risks, make mistakes, and learn all day, every day. We’ll support your goals with tools, opportunities, and flexibility. It’s our employee promise.\n\nOur hybrid work model preserves the balance between working from home and enjoying meaningful in-person interaction. The needs for every role are different but on average, you will be together with your colleagues at least once per week, with our leadership team in office three to four days weekly to be present for their teams.\n\nReady to make your mark?\n\nAbout the role\n\nIt’s more than a great career. It’s a bright future.\n\nIf you’re a student who wants to fast-track your career AND get valuable and in-depth industry experience while you do it, this is an... opportunity for you!\n\nOur Artificial Intelligence team has many opportunities available for aspiring AI Backend Developer. As an Intern or Co-op student joining our innovation lab, you’ll be surrounded by a diverse team of experts who are transforming the insurance experience for millions of Canadians. Think machine learning, data science, AI, agility, UX, rapid prototyping, and design thinking – it’s all in a day’s work at Intact Lab.\n\nEach year, we welcome more than 300 interns from coast to coast. A term with our lab means you’ll get the experience, coaching, training, development, support, and flexibility you need to be your best self and do your best work. While you’re learning and honing skills in fields like Software Engineering, Data Science, Actuarial and marketing, you’ll meet amazing people along the way, help solve real business problems, and make a difference, together.\n\nIf you want to help shape the future of insurance, win alongside a great team, and grow your career with one of North America’s best employers, apply today to get the conversation started.\n\nAbout the job:\n\nWe are looking for future talent who would like to grow with us. If you think the AI Backend Developer position is for you and you're interested in becoming part of the Intact family, then please read the following and send us your application today!\n\nWhat you’ll do here:\n• Design, test and develop back-end solutions for our artificial intelligence teams\n• Stay current on new approaches or opportunities, and bring them to the solutions you design\n• Help transforming complex data sets into meaningful conclusions and recommendation\n• Work with a Agile team to develop major systems, using the latest Internet and application technologies\n• Find technical solutions by brainstorming with other team members and building prototypes, if necessary\n• Prepare technical documentation to deploy and support completed systems\n• Develop and perform unit tests to validate code\n• Provide advice and support other teams in production and skills transfer\n• Provide estimates and status reports as needed\n• Keep up to date on new technologies and introduce new and practical approaches\n\nHere are some reasons why other people have joined our team:\n• Discover what the work of an AI developer looks like and how technological advances are changing the way insurance is done;\n• Explore new ideas and learn best practices in a fun and inclusive environment;\n• Use your creativity to help the team solve problems and contribute to important and challenging projects;\n• Have the opportunity to be part of social activities with the team to meet people and celebrate successes;\n• To have a competitive salary depending on the number of credits acquired at the time of the internship.\n\nWhat you bring to the table:\n• You are currently pursuing a University Degree in Software Engineering, Computer Science or a related field\n• Available to work with us full-time (35 hours per week) for Fall 2023 (September – December) and will be returning to full time studies in Winter 2024\n• You have 1 or more terms of relevant internship experience\n• Object-oriented programming skills\n• Experience in Python and Java programming\n• An interest in Java/Kotlin, Docker/Kubernetes, Hazelcast/Redis, Spring Boot/Spring Cloud and MongoDB/Oracle technologies\n• Knowledge of development design patterns\n• Knowledge and interest in Artificial Intelligence\n• Understand the basics of an agile way of work\n• A good understanding of the entire software development lifecycle\n• Bilingualism is an asset (French and English)\n\nYour career starts here. Apply today!\n\nWe can’t wait to learn more about you. When you complete your application, remember to include your cover letter, resume, University transcript and links to personal projects you developed. We hire co-ops every semester (Winter, Summer and Fall)!\n\nWe’re accepting applications now through May 26, 2023. All submissions will be reviewed during this time, as well as after the posting closes.\n\nWhat we offer\n\nWorking here means you'll be empowered to be and do your best every day. Here is some of what you can expect as a temporary member of our team:\n• Inspiring leaders and colleagues who will lift you up and help you grow\n• Access to tools and resources to support physical and mental health, embracing change and connecting with colleagues\n• A dynamic workplace learning ecosystem complete with learning journeys, interactive online content, and inspiring programs\n• Inclusive employee-led networks to educate, inspire, amplify voices, build relationships and provide development opportunities\n• A Community Impact program, because what you care about is a part of what makes you different. And how you contribute to your community should be just as unique.\n\nWe are an equal opportunity employer\n\nAt Intact, we value diversity and strive to create an inclusive, accessible workplace where all individuals feel valued, respected, and heard.\n\nIf we can provide a specific adjustment to make the recruitment process more accessible for you, please let us know when we reach out about a job opportunity. We’ll work with you to meet your needs.\n\nClick here to review other important information about the hiring process, including background checks, internal candidates, and eligibility to work in Canada.\n\nIf you are an employee of Intact, belairdirect, or Johnson Insurance, please apply for this role on Contact People", "occupation": "python coop"}, {"title": "Co-Op/Intern Machine Learning Developer, ML Solutions", "company": "Kinaxis", "location": "Toronto, ON", "via": "via Workopolis", "type": "Internship", "time": "none", "salary": "none", "links": ["https://www.workopolis.com/jobsearch/viewjob/JZFXMEbbHAutxx8fSQ5LFdEDD9PO_DeWEjJebD6xcVAXoax3Cs982gYvBQUaMNSM?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobsinit.net/job/co-op-intern-machine-learning-developer-ml-solutions-toronto-canada/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobsintech.ca/job/co-op-intern-machine-learning-developer-ml-solutions/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "About Kinaxis\n\nKinaxis is the global leader in modern supply chain management. We serve supply chains and the people who manage them in service of humanity. Our software is trusted by renowned global brands to provide the agility and predictability needed to navigate today's volatility and disruption. We combine our patented concurrency technique with a human-centered approach to AI to empower businesses of all sizes to orchestrate their end-to-end supply chain network, from multi-year strategic planning through down-to-the-second execution and last-mile delivery. For more news and information, please visit kinaxis.com or follow us on LinkedIn.\n\nCo-Op/Intern Machine Learning Developer, ML Solutions\n\nJob location: our office in Toronto, Canada\n\nTerm length: 8 or 12 months starting January 2024\n\nAbout the Team\n\nWe closely work with the data science and ML-as-a-Service Platform teams to design, implement and scale high performing big data AI solutions to demand forecasting and supply... chain problems in retail.\n\nWe tackle all aspects of the ML lifecycle, build tools to automate it and libraries to scale it. We are highly skilled engineers who are not afraid to tackle hard ML problems in forecasting and optimization and author full ML solutions to ship scalable big data products.\n\nWhat you will do\n• Help develop scalable ML solutions out of the approved client prototypes via our ML libraries\n• Participate in scrum teams developing ML products for demand sensing in different industry verticals\n• May perform other duties as assigned\n\nWhat we are looking for\n• Excellent software engineering skills\n• Good understanding of machine learning algorithms, data structures, pipelines and transformations\n• Proficiency in Python and object-oriented programming\n• Capable of processing data with pandas and PySpark (e.g. querying, transforming, joining, cleaning, etc.), with some experience in numpy and sklearn\n• Ability to work in Linux environments and public clouds with containerization technologies like Docker\n\nThings that Would Definitely Help\n• Machine learning Ops in the cloud with containerization (e.g. Kubernetes, Argo, Workflows)\n• Familiarity with retail and CPG business domain\n• Experience building data science products\n\nWhat we have to offer\n• Challenging Work - We love solving highly complex problems. And as the global leaders in our industry, we never stop innovating—our work is never \"done. That's because across our teams and in all roles, every employee is empowered to bring their best ideas forward and to jump in and solve the problems they're passionate about.\n• Great People - We take our work seriously, but we don't take ourselves too seriously! It's in our DNA to celebrate, laugh, and have fun. We are stronger, together, when we are open, honest, and above all, real. Every person is valued here and plays an important role in our shared success.\n• Global Impact - As a global team spanning continents, boundaries, and cultures, every day we are inspired by the impact our work has on our colleagues, our customers, our communities, and the world at large.\n• Diversity, Equity and Inclusion - Diversity, equity and inclusion are more than words to us. They are the guiding principles for building a culture where we celebrate each others' differences, continuously strive for equality and recognize that inclusion makes us stronger as individuals, a company and a global citizen.\n\nFor more information, visit the Kinaxis web site at www.kinaxis.com or the company's blog at http://blog.kinaxis.com/.\n\nKinaxis strongly encourages diverse candidates to apply to our welcoming community. We strive to make our website and application process accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact us at recruitmentprograms@kinaxis.com. This contact information is for accessibility requests only and cannot be used to inquire about the status of applications", "occupation": "python coop"}, {"title": "R Developer Co-op", "company": "ProCogia", "location": "Toronto, ON", "via": "via Workopolis", "type": "Internship", "time": "none", "salary": "none", "links": ["https://www.workopolis.com/jobsearch/viewjob/fqOjiaGSydi-PZyFDjpYfbujKEEN-__CwfRq3wtAy5462EEmZxdnUWavDUNbBeXo?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "ProCogia is a data consulting firm headquartered in Vancouver, BC with employees and clients across the United States and Canada. We specialize in Data Operations, Data Engineering, BI & Analytics, Data Science & Bioinformatics across a broad range of industries including Telecom, Pharma, Biotechnology, Retail, Logistics, Technology, Financial Services, Media & non-profit. We are a technology-agnostic firm giving us a client-first, independent approach towards delivering our Data solutions.\n\nWe're a diverse, close-knit team with a common pursuit of providing top-class, end-to-end data solutions for our clients. In return for your talent and technical expertise, you will be rewarded with a competitive salary, generous benefits along with ample opportunity for personal development. 'Growth mindset' is something we seek in all our new hires and has helped drive much of our recent growth across North America. Our distinct approach is to push the limits and value derived from data. Working... within ProCogia's thriving environment will allow you to unleash your full career potential.\n\nProCogia has experienced considerable growth over the last two years & core to our culture is maintaining a high-level of gender equality throughout the company. Our diversity and differences allow us to create innovative and effective data solutions for our clients.\n\nOur Mission\n\nWe enable our customers to make intelligent and agile decisions through strategically tailored data solutions. We attract, develop and retain diverse, motivated and collaborative team players who love what they do.\n\nOur Values\n\nTRUST We build trust in all of our relationships, internally and externally\n\nGROWTH We believe in life-long learning; both personally and professionally\n\nINNOVATION Our technology-agnostic & innovative approach enables cutting-edge data solutions\n\nEXCELLENCE We are committed to delivering excellence in everything we do\n\nProCogia Overview\n\nAt ProCogia we're passionate about developing data-driven solutions that provide highly informed answers to our clients' most critical challenges. Our projects are varied, from Data Warehouse builds, deploying Cloud Data Solutions, Dashboarding, & building predictive models.\n\nWe work with industry leading clients from various sectors including Pharmaceuticals, Telecommunications, Technology, Financial Services & Retail. Our work environment ensures opportunities to gain valuable experience in various industries enhancing your personal & career development.\n\nProCogia has doubled in size over the last two years & core to ProCogia's culture is ensuring we maintain a balanced gender ratio. Our diversity, and differences allow us to create innovative and effective solutions for our clients.\n\nJob Description\n\nThe R Developer Consultant has the following responsibilities and duties:\n• Develop, test, and maintain R code for data analysis and visualization projects\n• Collaborate with team members to identify project requirements and develop solutions\n• Participate in code reviews and contribute to the development of best practices\n• Work with data sets to create insightful visualizations and reports\n• Assist with the design and implementation of data processing workflows\n• Stay up-to-date with the latest developments in R programming and data analysis\n\nRequirements\n\nThe R Developer Consultant should have the following skills, education and experience:\n\nSkills\n\nRequired:\n• Strong R Coding skills\n• Experience working with Shiny Applications\n• Familiarity with data analysis concepts and techniques\n• Experience with data visualization tools such as ggplot2 or Plotly\n• Excellent communication skills and ability to work in a team environment\n• Detail-oriented with a strong ability to problem-solve\n• Familiar with Agile methodology and tools\n\nPreferred:\n• Experience with version control systems such as Git\n• Familiarity with other programming languages such as Python or SQL\n• Experience with cloud-based data processing platforms such as AWS\n\nEducation\n\nRequired:\n• Currently enrolled in a bachelor's or master's degree program in computer science, data science, statistics, or a related field\n\n#LI-REMOTE\n\nProCogia is proud to be an equal opportunity employer. We are committed to creating a diverse and inclusive workspace. All qualified applicants will receive consideration for employment without regard to race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status", "occupation": "python coop"}]}