{"url": "https://www.google.com/search?q=Javascript+in+New+York&ibp=htl%3Bjobs&sa=X&hl=en", "jobs": [{"title": "HTML/JavaScript Programmer", "company": "Open Systems Technologies", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Contractor", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Open-Systems-Technologies/Job/HTML-JavaScript-Programmer/-in-New-York,NY?jid=ef197b31d5d7e266&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.smartrecruiters.com/OpenSystemsTechnologies/743999655369433-html-javascript-programmer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company Description\n\nOpen Systems Technologies is a national provider of smeart staffing solutions, providing contract staffing, permanent placements and executive searches in the following skill areas...\n\n- Technology\n\n- Finance, Accounting, and Operations\n\n- Government Services\n\n- Legal\n\n- Global Services\n\nEstablished in New York in 1990, Open Systems Technologies is one of the largest, privately held, staffing companies in the world. We have experienced organic growth over the past 25 years and currently employ over 1,500 consultants in 16 domestic and international markets. Through our brands of Open Systems, OST Financial, OST Legal, OST Government Services, and OST Global we strive for continued expansion and excellence in the staffing industry. With the Global Services division, starting Jan-2012, Open Systems has expanded into the ITO & BPO Projects/Solutions business.\n\nJob Description\n\nResponsibilities\n• Architect and define presentation layer framework to solve complex designs\n• Create all coded Presentation Layer deliverables. Establish presentation layer requirements\n• Develop server side components that interacts with presentation layer\n• Rapidly produce interim deliverables (such as style guide components, technical specifications, browser and market analysis, hi-fidelity prototypes as proofs of concept, etc.) in addition to the final live site or application\n• Take initiative to research and learn emerging technologies\n• Demos of completed software to the business\n\nSkills:\n• Architecting and designing high performance web application.\n• 5+ years experience hand-coding HTML, D/XHTML, JavaScript, CSS 2 & 3, JSP\n• 7+ years experience using J2EE to develop dynamic web applications\n• Expertise developing and testing across multiple browsers, platforms, DOM implementations\n• Experience with JSON, usages of JavaScript statements such as switch, case, throw, closures, and working knowledge of WebKit\n• Experience with Rich Internet Applications, AJAX, particularly technical and coding aspects such as Object Oriented JavaScript, etc. required.\n• User Interface Design, Information Architecture, graphic design experience a plus\n• Understanding of good design principles and ability to adhere to complex design\n• Extensive hand-coding expertise in HTML 4 & 5, D/XHTML, J2EE, JavaScript, CSS 2 & 3, jQuery, Webcomponents, ReactJS\n• Expert level of hand-coding experience in Core JavaScript and JSON\n• Experience working in Agile development environment, scrums meeting, and rapid prototyping\n• Bachelors or Masters degree in Computer Science, Information Science or related technical or quantitative discipline\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "occupation": "Javascript"}, {"title": "HTML Javascript Developer", "company": "Open Systems Technologies", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Open-Systems-Technologies/Job/HTML-Javascript-Developer/-in-New-York,NY?jid=a268dff312f8aefe&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Description\n\nJob Description...\n\nResponsible for the content, quality, and style of the redesign for the AML Compliance website and underlying respective sub-sites.\n\nPerform day-to-day maintenance of the website including: debugging issues that arise with the performance of the website, troubleshooting the site including content, links and making necessary corrections, checking hyperlinks regularly to ensure validity\n\nCreate comprehensive, permission-based SharePoint site to house all internal Compliance communications materials.\n\nCreate permission-based SharePoint site specifically dedicated for Global AML Senior Leadership team to provide greater transparency for all top-level pipeline projects.\n\nIdentify specific web challenges experienced by various target audiences, prioritize key issues and partner with support functions to develop and deliver strategic technical solutions\n\nHelp provide metrics on website activity\n\nEnsure that messaging is consistent across all websites\n\nEnforce standards, branding guidelines and policies\n\nTrain other team members in site maintenance\n\nStay up to date on the web's latest technologies and ensure that the site(s) remain user friendly and deliver content in the most effective manner (i.e., mobile-friendly and multi-platform ready)\n\nPlan for future changes to the website; look for improvements to the website as a whole as the Internet evolves\n\nCompile and review statistics and web analytics to understand the effectiveness of the site(s) and underlying content in order to report insightful results to Senior Management\n\nAbility to assist with other ad hoc Communications efforts as needed\n\nJob Skills:\n\nEducation: BA, Master's degree a plus\n\nMinimum of 7 years working experience including advanced front-end web development and/or graphic design experience (HTML, Javascript, JS)\n\nVideo production skills not required but helpful\n\nExperience understanding and interpreting Web Analytics\n\nExperience with SharePoint & SharePoint Designer 2010/2013\n\nMust have strong written and oral communication skills\n\nProject management experience a plus\n\nHighly experienced with Microsoft Office tools (Word, Excel, Power Point) as well as Adobe\n\nTask oriented and self-motivated\n\nAttention to detail with strong organizational and communication skills\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "occupation": "Javascript"}, {"title": "Node.JS Developer", "company": "MindPal", "location": "New York, NY, USA", "via": "via LinkedIn", "type": "Full-time and Part-time", "time": "none", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/node-js-developer-at-mindpal-3703084347?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.talent.com/view?id=847a7e83c081&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://aikanjobs.com/job/mindpal-looking-for-node-js-developer-at-new-york-united-states/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "???? We are currently seeking a talented and experienced Node.js Developer ????\n• Responsibilities:\n• Develop and maintain server-side web applications using Node.js...\n• Collaborate with cross-functional teams to design and implement robust APIs and backend systems\n• Write clean and efficient code, following best practices and coding standards\n• Conduct thorough testing and debugging of applications to ensure high-quality deliverables\n• Optimize application performance and scalability\n• Stay up-to-date with the latest trends and advancements in Node.js development\n• Requirements:\n• Proven experience as a Node.js Developer, with a solid understanding of Node.js and its core principles\n• Proficiency in JavaScript\n• Knowledge of Express.js or similar web application frameworks\n• Experience with NoSQL databases, such as MongoDB\n• Understanding of asynchronous programming and event-driven architectures\n• Experience with version control systems, preferably Git\n• Strong problem-solving skills and the ability to work in a collaborative team environment\n• Excellent communication and interpersonal skills\n\nNice to have: Familiarity with front-end technologies such as HTML, CSS, and JavaScript frameworks (e.g., React, Angular, Vue.js)\n• We offer:\n• Flexible work-hours\n• part-time/full-time\n• Competitive salary\n\nRequirements\n\nResponsibilities", "occupation": "Javascript"}, {"title": "Javascript Developer", "company": "Atechstar", "location": "New York, NY, USA", "via": "via OPTnation", "type": "Full-time, Part-time and Contractor", "time": "none", "salary": "none", "links": ["https://www.optnation.com/javascript-developer-job-in-new-york-ny-view-jobid-32880?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Requirements Bachelor’s degree in computer science from a top university. 3-5 years experience in technology. Strong Javascript skills. Experience with leading Javascript framework. Familiarity with PHP recommended. Comfort with PHPStorm or Eclipse IDE. Understanding of basic database concepts and SQL. Comfortable with Agile/Scrum SDLC.\n\nKey Skills HTML and CSS. Algorithms and Data Structures... DOM Manipulation. Source Control. Testing/Debugging. How to Choose the Best JavaScript Framework. Web Performance Optimization", "occupation": "Javascript"}, {"title": "JavaScript/Web Applications Software Developer", "company": "Federal Reserve Bank (FRB)", "location": "New York, NY, USA", "via": "via ZipRecruiter", "time": "5 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Federal-Reserve-Bank-(FRB)/Job/JavaScript-Web-Applications-Software-Developer/-in-New-York,NY?jid=f7e6b11176c1de97&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.linkedin.com/jobs/view/javascript-web-applications-software-solutions-%E2%80%93-specialist-at-federal-reserve-bank-of-new-york-3747062373?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.levels.fyi/jobs?jobId=136281097093685958&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.georgiafintechacademy.org/companies/federal-reserve-bank-of-atlanta/jobs/29862849-javascript-web-applications-software-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.monster.com/job-openings/javascript-web-applications-software-developer-new-york-city-ny--5753b816-42f4-476f-b62d-ff470a8e6d3a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.bebee.com/job/20231110-98834800e1c53cc4c99c7267e3be0c4a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jooble.org/jdp/136946168900748340/JavaScript%2FWeb-Applications-Software-Developer-New-York%2C-NY?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.jobrapido.com/jobpreview/3080784671?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "CompanyFederal Reserve Bank of New York\n\nWorking at the Federal Reserve Bank of New York positions you at the center of the financial world with a unique perspective on national and international markets and economies. You will work in an environment with a diverse group of experienced professionals to foster and support the safety, soundness, and vitality of our economic and financial... systems.\n\nThe Bank believes in work flexibility to balance the demands of work and life while also connecting and collaborating with our colleagues in person. Employees can expect to be in the office a couple of days per week as needed for meetings and team collaboration and should live within a commutable distance.\n\nWhat we do:\n\nAs a member of the development sub chapter of supporting the Markets business domain, the area responsible for Trading Desk Decision Support Applications, you will implement financial applications and tools in support of Markets’ operations planning and execution. You will be part of an agile squad that requires close collaboration with other members of the technology team, business users, and other development squad members.\n\nYour role as a JavaScript/Web Applications Software Developer:\n\nA member of the squad is responsible for rapid end to end delivery of business value working directly with the business area. Developers on the squad are expected to deliver frond end, mid-tier integration and backend functionality. Ultimately all developers for this squad are full stack developers.\n\nWhat we are looking for:\n\nWe are looking for a developer who has experienced success across all front end and backend development areas. Just as important we are looking for candidates who have demonstrated a willingness to contribute across multiple development areas and technologies.\n\nQualifications for these include and not limited to:\n• Strong background in designing and developing web applications using JavaScript, Typescript, CSS3, HTML5 and JQuery as well as Java EE, Spring and Springboot. Experience with Vue, and Bootstrap is strongly preferred\n• Strong analytical and communication skills\n• Ability to design and implement user interfaces by incorporating established UI best practices.\n• Experience using Continuous Integration and Deployment tools such as Gitlab/Jenkins, etc.\n• Ability to apply Design Patterns and Enterprise Integration Patterns accordingly.\n• Experience with Agile methodology\n• Experience building decision support applications for operations and analytics in the financial industry\n• Experience Test Driven Development AND Behavior Driven Development (TDD/BDD)\n• Beneficial Technologies: Spring(Data, MVC, Security, Core, etc.), App/Web Server(Tomcat, JBoss, etc.), RDBMS(Oracle, MySQL), Localstack, Docker and AWS Services (IAM, S3, CloudFront, Secrets Manager, EC2, ECS, ALB, RDS, Elasticache, MKS, AmazonMQ)\n\nSalary Range: $134400 - $216000 / year\n\nWe believe in transparency at the NY Fed. This salary range reflects a variety of skills and experiences\n\ncandidates may bring to the job. We pay individuals along this range based on their unique backgrounds. Whether you’re stretching into the job or are a more seasoned candidate, we aim to pay competitively for your contributions.\n\nOur Touchstone Behaviors—Communicate Authentically, Collaborate Inclusively, Drive Progress, Develop Others, and Take Ownership—help shape the culture of the Bank. They also provide a shared language for how we work together and achieve success, and they set clear expectations for leading with impact at every stage of your career with us. Learn more.\n\nBenefits:\n\nOur organization offers benefits that are the best fit for you at every stage of your career:\n• Fully paid Pension plan and 401k with Generous Match\n• Comprehensive Insurance Plans (Medical, Dental and Vision including Flexible Spending Accounts and HSA)\n• Subsidized Public Transportation Program\n• Tuition Assistance Program\n• Onsite Fitness & Wellness Center\n• And more\n\nPlease note that the position requires access to confidential supervisory information and/or FOMC information, which is limited to \"Protected Individuals\" as defined in the U.S. federal immigration law. Protected Individuals include, but are not limited to, U.S. citizens, U.S. nationals, and U.S. permanent residents who either are not yet eligible to apply for naturalization or who have applied for naturalization within the requisite timeframe. Candidates who are permanent residents may be eligible for the information access required for this position if they sign a declaration of intent to become a U.S. citizen and pursue a path to citizenship and meet other eligibility requirements.\n\nIn addition, all candidates must undergo an enhanced background check, comply with all applicable information handling rules, and will be tested for all controlled substances prohibited by federal law, to include marijuana.\n\nThe Federal Reserve Bank of New York is committed to a diverse workforce and to providing equal employment opportunity to all persons without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, age, genetic information, disability, or military service.\n\nThis is not necessarily an exhaustive list of all responsibilities, duties, performance standards or requirements, efforts, skills or working conditions associated with the job. While this is intended to be an accurate reflection of the current job, management reserves the right to revise the job or to require that other or different tasks be performed when circumstances change.\n\nFull Time / Part TimeFull time\n\nRegular / TemporaryRegular\n\nJob Exempt (Yes / No)Yes\n\nJob CategoryInformation Technology\n\nWork ShiftFirst (United States of America)\n\nThe Federal Reserve Banks believe that diversity and inclusion among our employees is critical to our success as an organization, and we seek to recruit, develop and retain the most talented people from a diverse candidate pool. The Federal Reserve Banks are committed to equal employment opportunity for employees and job applicants in compliance with applicable law and to an environment where employees are valued for their differences.\n\nPrivacy Notice", "occupation": "Javascript"}, {"title": "Software Developer (JavaScript)", "company": "SEP Technology Consulting", "location": "New York, NY, USA", "via": "via Wellfound", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://wellfound.com/jobs/255273-software-developer-javascript?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "We are looking for a Software Developer with 4+ years experience in current technologies. You should have experience working with Javascript and strong frontend development skills.\n\nYou will join a fast-paced team that works together to implement software platforms and make meaningful impact by improving services received by residents from their local government agencies. We are looking for a... self-starting, highly energetic, keenly minded individual to be a key member of this team, while focusing largely on configuring and scripting a users needs.\n\nDesired Traits:\n\n● Experience in developing web applications using at least one popular web framework\n\n● Support continuous improvement by investigating alternatives and technologies and presenting these for architectural review\n\n● Exceptional Critical thinking and Problem Solving skills\n\n● Hands on, eager to dive into code, willing to dive into discussions\n\n● Has some knowledge of current “leading edge” technologies, has played/experimented with said technologies\n\n● Produce code that is extensible and maintainable with ease\n\n● Provide detailed technical documentation for design, and code\n\n● Strong grasp of software development principles and solid understanding of maximizing code reusability.\n\n● Engage in all aspects of release cycles\n\n● Work to understand and resolve defects\n\n● Identify gaps in requirements or designs, and present options to address them\n\n● Coding and designing application using best practices for development\n\n● Perform unit testing and identify test cases; fixes during testing Phase\n\nRecommended:\n\n● JavaScript\n\n● HTML5/CSS3\n\n● Spring (Core, Data, MVC, Web)\n\n● REST, SOAP\n\nNice to have:\n\n● AngularJS\n\n● Strong relational database experience (Oracle/SQL Server/DB2)\n\n● Data Conversion Experience\n\n● Rancher\n\n● Event Sourcing & CQRS\n\n● Typescript\n\n● Report Writing skills - SSRS, Crystal Reports\n\n● JIRA\n\n● Agile (SCRUM)\n\n● Git\n\n● Test Driven Development (TDD)\n\nWe are an equal employment opportunity employer and will consider all qualified candidates without regard to disability or protected veteran status.\n\nSEP Technology Consulting focuses on Enterprise Software, IT Management, Testing, and Public Sector. Their company has offices in New York City. They have a small team that's between 11-50 employees.\n\nYou can view their website at http://www.septechconsulting.com", "occupation": "Javascript"}, {"title": "Angular Developer", "company": "Mavinsys", "location": "New York, NY, USA", "via": "via LinkedIn", "time": "5 days ago", "type": "Contractor", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/angular-developer-at-mavinsys-3746307544?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Title : Angular Developer\n\nLocation : Hybrid (New York City...\n\nClient Name : FINANCIAL & MORTGAGE Client\n\nDuration : Long Term Contract\n\nInterview Rounds : 2\n\nJob Description:\n• Angular Developer - strong development experience working on Angular.\n• Have worked in Angular 4 as minimum and have worked on a new version of angular too.\n• Hands-on experience in CSS, HTML, React, JavaScript and Jenkins.\n• Have knowledge of the SDLC process.\n• Good communication skills.\n\n#Angular #React #Angular.js #Angularjs #React #React.js #Javascript #HTML #CSS #Cascadingstylesheet #SDLC #Frontend #FrontendDeveloper #Mavinsys #Mavinsyshiring", "occupation": "Javascript"}, {"title": "Engineering Manager, JavaScript", "company": "NBCUniversal", "location": "New York, NY, USA", "via": "via SmartRecruiters Job Search", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://jobs.smartrecruiters.com/NBCUniversal3/743999921894172-engineering-manager-javascript?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.ziprecruiter.com/c/NBCUniversal/Job/Engineering-Manager,-JavaScript/-in-New-York,NY?jid=f3b04cb2a31bc1a2&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.linkedin.com/jobs/view/engineering-manager-javascript-at-nbcuniversal-3682052552?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.adzuna.com/details/4242922447?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://myjobsny.usnlx.com/new-york-ny/engineering-manager-javascript/5A46896406764FC9A5109D833727E74A/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.levels.fyi/jobs?jobId=103597056725000902&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://nbcuniversal.talentify.io/job/engineering-manager-javascript-new-york-new-york-nbcuniversal-51566737-1-1?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.talent.com/view?id=ecb9e9fc110d&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company Description\n\nNBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world-renowned theme parks and a premium ad-supported streaming service...\n\nHere you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. We strive to foster a diverse and inclusive culture where our employees feel supported, embraced and heard. We believe that our workforce should represent the communities we live in, so that together, we can continue to create and deliver content that reflects the current and ever-changing face of the world. Click here to learn more about Comcast NBCUniversal’s commitment and how we are making an impact.\n\nJob Description\n\nOur Direct-to-Consumer (DTC) portfolio is a powerhouse collection of consumer-first brands, supported by media industry leaders, Comcast, NBCUniversal and Sky. When you join our team, you'll work across our dynamic portfolio including Peacock, NOW, Fandango, SkyShowtime, Showmax, and TV Everywhere, powering streaming across more than 70 countries globally. And the evolution doesn't stop there. With unequalled scale, our teams make the most out of every opportunity to collaborate and learn from one another. We're always looking for ways to innovate faster, accelerate our growth and consistently offer the very best in consumer experience. But most of all, we're backed by a culture of respect. We embrace authenticity and inspire people to thrive.\n\nOur streaming video SDK is at the forefront of technology, leveraging modern video codecs, adaptive bitrate streaming, low-latency streaming, and support for live streaming. We ensure seamless playback across various platforms, including web browsers, smart TVs, gaming consoles, and streaming media devices. This compatibility allows us to reach a wide audience and provide exceptional streaming experiences regardless of the device or operating system.\n\nThe Core Video JavaScript team is looking for an exceptional Engineering Manager to grow and develop our international talent base into a first-class team of engineers. Join us as we redefine the future of streaming video technology. While your primary focus will be Consoles, you will be a part of a bigger JavaScript team that is responsible for other platforms such as TVs, browsers, and set-top boxes. Together, we will shape our culture, solve technical problems, and create extraordinary streaming experiences that captivate audiences worldwide.\n\nKey Responsibilities\n• Mentor and coach team members.\n• Collaborate closely with cross-functional teams and stakeholders across the organization to gather requirements, understand user needs, and provide technical direction.\n• Strive to constantly improve the overall quality through code reviews, tech talks, pair programming and other collaborative practices.\n• Understand business needs and design valuable software solutions that work well within the wider architecture.\n• Proactively estimate efforts and identify any potential risks.\n• Manage team roadmap and capacity.\n• Push technical boundaries while also recommending new processes and technologies.\n• Help foster an environment of inclusiveness.\n\nQualifications\n• 4 years leading an engineering team with prior senior-level development experience in JavaScript/TypeScript.\n• Experience integrating with MSE/EME JavaScript players.\n• Experience working with console hardware such as Microsoft Xbox and Sony PlayStation\n• Must have an enthusiasm for building a JavaScript/TypeScript library that handles all aspects of video playback.\n• Value collaboration with teammates and stakeholders.\n• Understanding deadlines, constraints and scope of delivery and experience working with stakeholders to ensure the right balance between these are met, setting expectations and handling risks early.\n• Being an analytic problem solver with a strong sense of autonomy, and with an open collaborative approach to getting the job done.\n• Interest in cultivating a strong team culture where engineers of diverse backgrounds can grow.\n\nThis position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. Salary range: $140,000 - $200,000\n\nAdditional Information\n\nNBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable.\n\nIf you are a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation if you are unable or limited in your ability to use or access nbcunicareers.com as a result of your disability. You can request reasonable accommodations in the US by calling 1-818-777-4107 and in the UK by calling +44 2036185726", "occupation": "Javascript"}, {"title": "JavaScript/ReactJS Developer", "company": "New York City", "location": "Brooklyn, NY, USA", "via": "via NYC Jobs - NYC.gov", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://cityjobs.nyc.gov/job/javascript-reactjs-developer-in-brooklyn-jid-13210?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "NOTE: This position is open to applicants who are already permanent in the title of Computer Specialist (Software) or are reachable on the current open competitive list. Please include your list number on your resume and cover letter.\n\nThe Fire Department of the City of New York (FDNY) is the largest Fire Department in the United States and universally is recognized as the world's busiest and... most highly skilled emergency response agency. The Department's main goal is to provide fire protection, emergency medical care, and other critical public safety services to residents and visitors in the five boroughs. FDNY members are sworn to serve and protect life and property and the Department works to continually educate the public in fire, life safety and disaster preparedness, along with enforcing public safety codes. Since its inception in 1865, FDNY has helped lead efforts to make New York the safest big city in the nation. This accomplishment requires a steadfast and daily commitment to maintaining the Department's core values.\n\nThe Fire Department, City of New York (FDNY), seeks a full-time Computer Specialist (Software) L4, in the Bureau of Technology Development and Systems. Reporting directly to the Director of Applications Development, the successful candidate will be responsible developing and supporting web and mobile applications. Additional responsibilities include the following:\n- Develop and support web and mobile applications to work in multiple platform, following industry standard and best practice.\n- Accurately interpret requirement specifications and carry out coding tasks in a timely manner.\n- Define the logic and flow of an application based on the design specifications.\n- Thoroughly test all aspects of development to ensure that products provided are as bug free.\n- Application deployment to production and user support\n- Ability to collaborate cross-functionally.\n\nSpecial Working Conditions: May be required to work shifts including nights, Saturdays, Sundays, and holidays\n\nMinimum Qualifications\n\n(1) A baccalaureate degree from an accredited college, including or supplemented by twenty-four (24) semester credits in computer science or a related computer field and two (2) years of satisfactory full-time software experience in designing, programming, debugging, maintaining, implementing, and enhancing computer software applications, systems programming, systems analysis and design, data communication software, or database design and programming, including one year in a project leader capacity or as a major contributor on a complex project; or\n(2) A four-year high school diploma or its educational equivalent and six (6) years of full-time satisfactory software experience as described in “1\" above, including one year in a project leader capacity or as a major contributor on a complex project; or\n(3) A satisfactory combination of education and experience that is equivalent to (1) or (2) above. College education may be substituted for up to two years of the required experience in (2) above on the basis that sixty (60) semester credits from an accredited college is equated to one year of experience. A masters degree in computer science or a related computer field may be substituted for one year of the required experience in (1) or (2) above. However, all candidates must have a four year high school diploma or its educational equivalent, plus at least one (1) year of satisfactory full-time software experience in a project leader capacity or as a major contributor on a complex project.\nNOTE: In order to have your experience accepted as Project Leader or Major Contributor experience, you must explain in detail how your experience qualifies you as a project leader or as a major contributor. Experience in computer operations, technical support, quality assurance (QA), hardware installation, help desk, or as an end user will not be accepted for meeting the minimum qualification\nrequirements.\nSpecial Note\nTo be eligible for placement in Assignment Level IV, in addition to the Qualification Requirements stated above, individuals must have one year of satisfactory experience in a project leader capacity or as a major contributor on a complex project in data administration, database management systems, operating systems, data communications systems, capacity planning, and/or on-line applications programming.\n\nPreferred Skills\n\nStrong proficiency in JavaScript and ReactJS framework or other front-end development frameworks is required. Candidate will also need to possess advanced knowledge of web-related technologies such as HTM5L, CSS, and the DOM and have utilized UI libraries such as Prime React, Bootstrap, Ant Design or Material UI to build applications that works on multiple form factors. Experience building and consuming RESTful APIs is also required. Knowledge of modern version control systems (GitHub) and automated build workflows/pipelines for web applications. The individual will thrive in a fast-paced agile environment founded on strong analytical and communication skills. Member should be enthusiastic and open for learning new skills and keen on understanding new technologies. Knowledge of Java, PL/SQL and Oracle suite of software/cloud and backend development a plus. Knowledge of modern authentication protocols and mechanisms such as JWT, OAuth2, etc.\n55a Program\n\nThis position is also open to qualified persons with a disability who are eligible for the 55-a Program. Please indicate at the top of your resume and cover letter that you would like to be considered for the position through the 55-a Program.\nPublic Service Loan Forgiveness\n\nAs a prospective employee of the City of New York, you may be eligible for federal loan forgiveness programs and state repayment assistance programs. For more information, please visit the U.S. Department of Education’s website at https://studentaid.gov/pslf/\nResidency Requirement\n\nNew York City Residency is not required for this position\nAdditional Information\n\nThe City of New York is an inclusive equal opportunity employer committed to recruiting and retaining a diverse workforce and providing a work environment that is free from discrimination and harassment based upon any legally protected status or protected characteristic, including but not limited to an individual's sex, race, color, ethnicity, national origin, age, religion, disability, sexual orientation, veteran status, gender identity, or pregnancy", "occupation": "Javascript"}, {"title": "Staff Software Engineer (Full Stack Javascript)", "company": "Vestwell", "location": "New York, NY, USA", "via": "via Vestwell", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.vestwell.com/careers/5763771003?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Who are we looking for?\n\nThe Engineering team is looking for an experienced Full Stack Javascript Engineer to join our growing team. You're a great fit for this role if you have extensive knowledge of the Javascript ecosystem and want to help us build and maintain modern software solutions in an antiquated financial industry...\n\nYou have a strong ability to balance detail-oriented tasks with long term strategy, are adaptable and willing to take ownership over a vertical slice of a product. You have great communication skills that empowers you to collaborate cross-functionally with non-technical operational teams and are able to understand and solve their problems. You value the importance of data integrity when working with highly regulated and secure products.\n\nRequirements\n\nThe Necessities\n• Extensive professional frontend and backend Javascript and Typescript experience in an Agile organization\n• Experience with JSX/TSX (ReactJS) and thorough understanding of functional components, hooks and commonly used libraries like React Query and Material UI.\n• Experience with Nest.js\n• Ability to develop, maintain, and support automation test suites\n• Professional experience with SQL-based databases\n• Experience designing, building, and consuming RESTful APIs\n• Ability to collaborate effectively with product managers, engineers and non-technical stakeholders\n• Have worked with and/or managed remote Engineers\n\nThe Extras\n• Professional experience with GraphQL\n• Microservice architecture experience using Docker\n• DevOps or SysOps experience\n• Familiarity with AWS\n• An understanding of SRE best practices, such as postmortems, logging, alerting, and toil reduction\n• Experience with CI/CD and automation pipelines using Jenkins\n• Proven ability to mentor less experienced developers\n\nDay to day, you may additionally…\n• Partner with, understand problems of, and create solutions for business operations teams\n• Collaborate closely with other Engineers and the rest of the Vestwell team to determine architecture for upcoming projects\n• Work with both engineering and product teams to drive solution design\n• Create complex logical frameworks, workflows, RESTful API endpoints, and JSON formats to exchange key data with the rest of the platform\n• Help plan, automate, and scale our infrastructure\n\nOur Culture\n\nWe aim to follow Agile best practices with a focus on empowering full stack development teams so that they can own a vertical slice of the product, and are empowered to make decisions and create a roadmap for a section of the product and business.\n\nWe want squads to be first class citizens, working as a team to define their roadmap and prioritization, that follows best practices in development, automation testing, deploying, and support.\n\nThe expected salary range for this position is $160K - $180K with a bonus variable. Please note that salary bands are based on NY and other similar metro areas and may differ based on where the role is ultimately hired.\n\nVestwell’s Privacy Policy. Attention California residents: In the course of conducting our business and complying with federal, state, and local government regulations governing such matters as employment, tax, insurance, etc., we must collect Personal Information from you. Should you accept employment with Vestwell you may view our California Privacy Rights Act here: Vestwell’s California Privacy Rights Policy", "occupation": "Javascript"}, {"title": "HTML Javascript UI Developer", "company": "Open Systems Technologies", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Open-Systems-Technologies/Job/HTML-Javascript-UI-Developer/-in-New-York,NY?jid=0a2b8bc11489fbd0&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.whatjobs.com/jobs/HTML-Javascript-UI/new-york-new-york-/1470819251?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company Description\n\nGlobal Investment Bank...\n\nJob Description\n\nThe Role:\n\nThe successful candidate will have the opportunity to work on elegantly factored, well-documented, carefully (and portably) implemented, and thoroughly tested JavaScript components utilizing the latest HTML5, CSS4, and ES6 features. Emphasis will be placed on developing well tested and structured code, and the ability to work in a highly collaborative and fast moving environment.\n\nQualifications:\n• Bachelor's or Master's Degree in Computer Science, Engineering or related field (or equivalent expertise)\n• Minimum of 3 years of JavaScript and HTML development experience\n• Experience with node.js and C++ will be an advantage\n• Solid understanding of Data Structures, Algorithms, and Object-Oriented design\n• Strong problem solving skills\n• Strong (especially written) English communication skills", "occupation": "Javascript"}, {"title": "Senior JavaScript Developer -D4586", "company": "SOFT Inc", "location": "New York, NY, USA", "via": "via SimplyHired", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.simplyhired.com/job/sRoXodwDN2IC4JASJYHWAlhKO4vbDgnLYqastTeZap2gsLFAzgCuZg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "SOFT's client located in New York, NY is looking for a Senior JavaScript Developer for a long term contract assignment.\nQualifications:\nThe Technology Group delivers and supports a wide range of applications using common frameworks, tools and processes. The Software Solutions UI/UX Sub-chapter is responsible for delivery of a repeatable, testable set of browser based and mobile solutions with a... high degree of usability and attention to user experience and design. Computer Science / Web Application Development\n\nResponsibilities:\nTechnology Group is looking for a UI developer to code and maintain applications across the portfolio. The developer must have expert command of modern JavaScript application patterns, libraries such as Angular, backbone.js and require.js, data visualization libraries such as HighCharts, HighMaps, and D3.js, and be able to deliver projects featuring well formatted HTML5 and CSS3 templates. The candidate must be able to communicate effectively with a wide range of stakeholders and collaborate with various teams to deliver projects with a high level of accuracy and personal responsibility.\n\nResponsibilities: Develop UI components for use across the application portfolio Collaborate with UX engineers and designers to implement markup/designs Integrate and deliver functionality with backend teams during development life cycle Ensure requirements are met throughout development efforts Ensure code is in compliance with style guides and pattern libraries\n\nJob Types: Contract, Full-time\n\nSchedule:\n• 8 hour shift\n\nWork Location: In person", "occupation": "Javascript"}, {"title": "UI/ JavaScript", "company": "kpg99 inc", "location": "New York, NY, USA", "via": "via Techfetch", "time": "13 days ago", "type": "Contractor", "salary": "none", "links": ["https://www.techfetch.com/job-description/ui-javascript-new-york-ny-j3600370?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ny.tarta.ai/j/Fdeyq4sBcRajQcTjFA2H1023-ui-javascript-in-new-york-new-york-at-kpg99-inc?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "UI/ JavaScript\n\nClient-PNC Bank...\n\nRate-$60/hr\n\nLocation-Hybrid/Jersey City, NJ (Local)\n\nVisa-USC or gc\n\nJob Description\n\nDevelop highly scalable front-end applications using JavaScript(Vue and/or React JS), HTML5 and CSS3.\nBuild and enhance business reports using Power BI tools.\nCreate and deploy applications in azure environment with various interconnected azure components.\nUnderstand and enhance the applications in Python/Django framework.\nIdentify and fix bottlenecks that may arise from inefficient code.\nKnowledge of user authentication and authorization between multiple systems, servers and environments.\nEnsure that programs are written to the highest standards (e.g., Unit Tests) and technical specifications.\nDocumentation of the key aspects of the project.\nAbility to collaborate on projects and work independently when required.\n\nQualifications\n\nWe need two senior (8+ years) UI developers with good experience working with JavaScript and Vue and/or React JS\n8+ years of prior experience as a developer in the required technologies\nSolid organizational skills, ability to multi-task across different projects\nExperience with Agile methodologies\nSkilled at independently researching topics using all means available to discover relevant information\nAbility to work in a team environment\nExcellent verbal and written communication skills\nSelf-starter with ability to multi-task and to maintain momentum", "occupation": "Javascript"}, {"title": "Javascript and JQuery Developer – Remote", "company": "Cenzen", "location": "New York, NY, USA", "via": "via Salary.com", "time": "12 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.salary.com/job/cenzen/javascript-and-jquery-developer-remote/j202302090516593859380?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.bebee.com/job/20231028-31723ba78550842b646ac8183cea856c?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.trabajo.org/job-1842-20231109-defe33057996f3976c3b10a73f0c440e?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "• New York, NY, USA\n• $25 - $35 an Hour USD\n...\nCenzen\n\nwe are Looking for a US-based remote working Front End Developer, who has an amazing eye for detail and a passion for building beautifully crafted websites. Excellent HTML and CSS (SASS / LESS) skills are a must, along with advanced knowledge of Javascript and JQuery, and of building responsive websites within a headless CMS.\n\nResponsibilities –\n• You’ll be responsible for the production of high-end responsive builds that conform to the latest web standards and deliver to the quality benchmark set by the company.\n• Gather requirements and interpret data to ensure builds comply with the approved design (pixel perfect), build specifications, and checklist to create functional solutions that work cross-browser and resolution.\n• Able to deliver across the website lifecycle; build, content, test, and release.\n• To be able to explain solutions when needed to technical and non-technical stakeholders.\n• Complete the allocated work within the task deadlines set and any queries are raised with the relevant team member/project manager within good time.\n• Effectively communicate, build and maintain strong working relationships internally.\n\nAbout you –\n• Graduate caliber, with advanced knowledge of HTML and CSS (SASS/LESS) and Javascript and JQuery.\n• At least 4 years of proven front-end build experience gained within a creative environment and be able to demonstrate build skills via your portfolio.\n• Excellent level of understanding in building responsive websites within a headless CMS.\n• A proven track record and a passion for building beautifully crafted websites.\n• Thorough understanding of user interface design.\n• An ability to effectively multi-task and take responsibility for organizing your time.\n• Be a team player who uses initiative, is proactive, and has good communication skills.\n• Able to work to tight deadlines and has high attention to detail", "occupation": "Javascript"}, {"title": "Junior Software Developer (JavaScript and SQL Specialist)", "company": "Cenzen Media", "location": "New York, NY, USA", "via": "via Indeed", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.indeed.com/viewjob?jk=aee07f1deb3f24c4&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.salary.com/job/cenzen/jr-software-developer-javascript-sql-expert-full-time/j202302010515328558698?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.glassdoor.com/job-listing/junior-software-developer-javascript-and-sql-specialist-cenzen-media-JV_IC1132348_KO0,55_KE56,68.htm?jl=1008523534699&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.simplyhired.com/job/FeyxoPbKCycDp0nkLJ_D5lH-drmAI92zmX0GzOcwoElu49tg-4ckLw?jobCardTrackingKey=3-0-1gugj8sqk24u0001-1gugj8sqvis2k800-aee07f1deb3f24c4-&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://cenzenmedia.com/job/junior-software-developer-javascript-and-sql-specialist/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://lazyapply.com/jobpreview/job_aee07f1deb3f24c4?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "• New York\n• $15 - $35 USD\n...\nCenzen Media\n\nAre you a passionate Software Developer interested in a small AGILE team performing cutting edge development in the AWS GovCloud One? We are seeking a Full stack Jr. Developer with good experience in Java, JavaScript, SQL, HTML, CSS, jQuery and JavaServer Pages (JSP). You will play a critical role in our close-knit, highly collaborative team with on-site product owners, short sprint cycles and support of an experienced and engaged Project Manager.\n\nThe Requirements Management System (RMS) encompasses the automated and manual functions involved in the Air Force Materiel Command’s (AFMC) Material Requirements Process. This process forecasts and controls procurement and repair requirements of materiel needed for logistics support of weapons systems operated by the Air Force.\n\nPrimary Duties/Responsibilities:\n• Delivering complex code/features that are high-quality and supportable\n• Showing initiative and expertise in determining work to be done to achieve project goals\n• Communicating clearly with project management, team members, and government subject matter experts\n• Making informed recommendations to USAF clients regarding technical problems\n\nDesired Knowledge and Skills:\n• Full Stack Developer with experience with Java, JavaScript, SQL, HTML, CSS, jQuery and JavaServer Pages (JSP)\n• IaC Ansible experience\n• AWS – S3, EC2, RDS, Elastic Beanstalk, CloudWatch\n• Jenkins CI/CD Pipeline\n• BitBucket\n• Git\n• Tomcat\n• Docker\n• Oracle\n• Jenkins\n• Checkmarx\n\nEducation and Experience Required:\n• Bachelor’s Degree in Computer Science, Information Systems, Mathematics or equivalent preferred but not required\n• 1-2 years of software development experience and designing web applications\n• US Citizen with ability to obtain a Secret Security Clearance", "occupation": "Javascript"}, {"title": "2 JavaScript/ Python Developers/Banking", "company": "TekIntegral", "location": "New York, NY, USA", "via": "via LinkedIn", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/2-javascript-python-developers-banking-at-tekintegral-3667479352?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "We need three Python Developers (Not Full Stack Java) WITH BANKING OR FINANCIAL SERVICE (BANKING, HEDGE FUND, WEALTH MANAGENT, TRADING) EXPERIENCE.\n\nCandidates Must...\n• Have Python (Not Full Stack Java) development experience in Banking or Financial services\n• JavaScript Experience\n• Be in NY/NJ and able to commute to Midtown 3 days a week.\n• Develop highly scalable applications in Python/Django framework\n• Two senior positions $80\n\nInterview Process: Video\n\nLocation: Hybrid NYC No Relocation\n\nPlease provide all the below details with each submittal. It is required for the vendor Management system.\n\nNumber Of Years Working With\n\nTotal IT experience:\n\nYears working with: Python\n\nYears working with: Banking/Financial Services\n\nYears Working With\n\nJob Description\n• Develop highly scalable applications in Python/Django framework.\n• Create and deploy applications in azure environment with various interconnected azure components.\n• Understand and enhance front-end applications using JavaScript(Vue and/or React JS), HTML5 and CSS3.\n• Exposure to Power BI tools is highly desirable.\n• Identify and fix bottlenecks that may arise from inefficient code.\n• Knowledge of user authentication and authorization between multiple systems, servers and environments.\n• Ensure that programs are written to the highest standards (e.g., Unit Tests) and technical specifications.\n• Documentation of the key aspects of the project.\n• Ability to collaborate on projects and work independently when required.\n\nQualifications\n• 8+ years of prior experience as a developer in the required technologies\n• Solid organizational skills, ability to multi-task across different projects\n• Experience with Agile methodologies\n• Skilled at independently researching topics using all means available to discover relevant information\n• Ability to work in a team environment\n• Excellent verbal and written communication skills\n• Self-starter with ability to multi-task and to maintain momentum", "occupation": "Javascript"}, {"title": "Javascript Developer", "company": "Open Systems Technologies", "location": "New York, NY, USA", "via": "via SmartRecruiters Job Search", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://jobs.smartrecruiters.com/OpenSystemsTechnologies/83177216-javascript-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Description\n\nWe are looking for talented and enthusiastic engineers who have a deep foundation in core computer science fundamentals, diverse technical experience, and a knack for learning new technologies...\n\nIn this role you will\n\n• Directly contribute to the development of the world's most popular open source video player\n\n• Design and build cross-platform components using the latest web technologies\n\n• Develop technical specifications and take ownership over product releases\n\n• Work on a cross-functional team to define business requirements and set product direction\n\n• Contribute to and work across many different projects and technologies, as needed\n\nRequirements\n\n• B.S. degree or higher in Computer Science or related technical field\n\n• Expert developer in JavaScript\n\n• Practical experience in web development\n\n• Motivated, self-starter who enjoys working in a fast-paced environment\n\nBonus Points\n\n• Git, Grunt, CommonJS/AMD, Node and/or ActionScript\n\n• Experience with web video, 3rd party advertising or analytics\n\n• Experience programming devices like Chromecast, Roku or Fire TV Stick\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "occupation": "Javascript"}, {"title": "Html Developer", "company": "Atechstar", "location": "New York, NY, USA", "via": "via OPTnation", "type": "Full-time, Part-time and Contractor", "time": "none", "salary": "none", "links": ["https://www.optnation.com/html-developer-job-in-new-york-ny-view-jobid-32361?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ny.tarta.ai/j/5CkMH4sBcRajQcTjUI2X1023-html-developer-in-new-york-new-york-at-atechstar?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Responsibilities Knowledge of JavaScript. Experience with web development using HTML5 JavaScript Jquery CSS 3. Experience building Responsive Design layouts using a formal framework like BootStrap. Basic understanding of server-side CSS pre-processing platforms such as LESS and SASS. Understanding of asynchronous request handling partial page updates and AJAX. Basic understanding of web... development and hands-on integration experience.\n\nKey Skills Bachelor's degree in computer science information technology programming languages web services or another related field. Excellent knowledge of HTML5 and CSS3. Knowledge of JavaScript jQuery PHP web APIs and other front-end technologies a bonus", "occupation": "Javascript"}, {"title": "Sr Front end dev (jQuery, JavaScript) - REMOTE", "company": "DISYS", "location": "New York, NY, USA", "via": "via SaluteMyJob", "time": "21 days ago", "type": "Contractor", "salary": "none", "links": ["https://salutemyjob.com/jobs/sr-front-end-dev-jquery-javascript-remote-new-york/1147035364-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.wearegreenbay.com/jobs/sr-front-end-dev-jquery-javascript-remote-new-york/1147035364-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.wavy.com/jobs/sr-front-end-dev-jquery-javascript-remote-new-york/1147035364-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.khon2.com/jobs/sr-front-end-dev-jquery-javascript-remote-new-york/1147035364-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.wane.com/jobs/sr-front-end-dev-jquery-javascript-remote-new-york/1147035364-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.myarklamiss.com/jobs/sr-front-end-dev-jquery-javascript-remote-new-york/1147035364-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.wreg.com/jobs/sr-front-end-dev-jquery-javascript-remote-new-york/1147035364-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.ksnt.com/jobs/sr-front-end-dev-jquery-javascript-remote-new-york/1147035364-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Position: Front End Developer\n\nLocation: REMOTE...\n\nDuration: Contract to Hire\n\nPosition Scope: The Front End Developer is responsible for building the client-side of our web applications. The Front End Developer will translate our company and customer needs into functional and appealing interactive applications.\n\nEssential Functions and Job Responsibilities:\n\n1. Create user-friendly web pages\n\n2. Maintain and improve website\n\n3. Optimize applications for maximum speed\n\n4. Design mobile-based features\n\n5. Collaborate with back-end developers and web designers to improve usability\n\n6. Get feedback from, and build solutions for users and customers\n\n7. Comply with PaceMate Mission, Vision, and Customer Service\nstandards. Adhere to the Code of Conduct and all Company Policies and\nProcedures.\n\nEducation and Experience:\n• 5+ years of experience as a Front-end Developer.\n• Hands on experience with markup languages.\n• Familiarity with browser testing and debugging.\n• In-depth understanding of the entire web development process (design, development and deployment0)\n• An ability to perform well in a fast- paced environment.\n• BSc degree in Computer Science or relevant field preferred\n• Strong communication skills to collaborate with cross-functional teams and explain technical concepts to non-technical stakeholders.\n• Positive and professional approach at all times.\n• Ability to work independently as well as part of a team.\n• Strong attention to detail.\n• Experience with Selenium, jQuery, FHIR API, SFTP, Stripes framework, and YouTrack a strong plus.\n• Experience with and proficiency in using Spring framework (DI, IoC), HL7 v2.x spec - HAPI API, SQL - mybatis (ibatis) / mySql, OOD/OOP - Design patterns, REST API, Repository - git, svn, Bug tracker/issue tracking system, and IDE (Eclipse, STS, IntelliJ) preferred.\n\nDexian is a leading provider of staffing, IT, and workforce solutions with over 12,000 employees and 70 locations worldwide. As one of the largest IT staffing companies and the 2nd largest minority-owned staffing company in the U.S., Dexian was formed in 2023 through the merger of DISYS and Signature Consultants. Combining the best elements of its core companies, Dexian's platform connects talent, technology, and organizations to produce game-changing results that help everyone achieve their ambitions and goals.\n\nDexian's brands include Dexian DISYS, Dexian Signature Consultants, Dexian Government Solutions, Dexian Talent Development and Dexian IT Solutions. Visit to learn more.\n\nDexian is an Equal Opportunity Employer that recruits and hires qualified candidates without regard to race, religion, sex, sexual orientation, gender identity, age, national origin, ancestry, citizenship, disability, or veteran status", "occupation": "Javascript"}, {"title": "Lead engineer javascript", "company": "Averity", "location": "New York, NY, USA", "via": "via Talent.com", "time": "7 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.talent.com/view?id=1b78e921a0c6&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.bebee.com/job/20231028-3015d9a5bb191de43655df329d483a4e?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.trabajo.org/job-640-20231105-68bdc29cc70fe5102bce7741bd720272?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.jobrapido.com/jobpreview/2917040419?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.jobilize.com/job/us-ny-new-york-lead-javascript-engineer-averity-hiring-now-job-immediately?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "We are looking for a talented Lead Software Engineer who specializes in Full-Stack Javascript to join an industry leading HR Analytics SaaS startup in NYC! If you are looking for a great technical culture and love Javascript / Typescript, then check this out!\n\nWho are we...\n\nWe are a rapidly growing startup dedicated to improving the work lives of others. We connect those who strategically cultivate strong teams, while simultaneously aggregating data to help drive their decision making processes and improve their organizations from a talent management perspective.\n\nWhat is the Job?\n\nAs our Lead Software Engineer you will work extensively on our SaaS Analytics Platform. You will provide heavy technical lifting through leadership, architecture, design, hands on coding, and driving implementation downstream through Senior and Junior Engineers.\n\nThis product is the life blood of our organization. Our platform aggregates extensive amounts of data, runs analysis, and provides actionable insight to our customers.\n\nYou will work to build out functionality and new features at Scale in a cutting edge Full-Stack Javascript stack.\n\nWho are you?\n\nYou are an experienced technical leader who lives and breathes Javascript / Typescript with experience working across the full-stack and knack for server side development in Node.\n\nYou bring a strong background where you moved up the ranks and bring a number of years as a tech lead working on SaaS products in the Startup space.\n\nWhat are the must have hard skills for this role?\n• Javascript / Typescript\n• React / Node\n• Microservices\n• Snowflake\n\nWhat are the must have soft skills?\n• Strong communication skills, both written and verbal\n• High Emotional Intelligence with an emphasis on empathy\n• Positive attitude and optimistic is essential\n• Confident but humble\n• Hungry for growth both professionally and technically\n\nWhat is in it for you?\n\nThis is an opportunity to lead a talented team of engineers at a rapidly growing startup. We offer a fully comprehensive compensation and benefits package that includes :\n• Base Salary of $200,000+\n• Equity\n• Medical, dental, and vision benefits\n• Work from home with the option to go onsite in New York!\n• 401K, work-from-home stipend, and more!\n\nLast updated : 2023-11-08", "occupation": "Javascript"}, {"title": "Lead Software Engineer, Full Stack(JavaScript/Java/AWS)", "company": "Capital One", "location": "New York, NY, USA", "via": "via Professional Diversity Network", "type": "Full-time and Part-time", "time": "none", "salary": "none", "links": ["https://www.prodivnet.com/job/lead-software-engineer-full-stack-javascript-java-aws-new-york-new-york-13722477?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.linkedin.com/jobs/view/lead-software-engineer-full-stack-javascript-java-aws-at-capital-one-3743226151?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.indeed.com/viewjob?jk=1ba699e8facc30b1&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://salutemyjob.com/jobs/lead-software-engineer-full-stack-remote-eligible-new-york/1164229728-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.bebee.com/job/20231107-e7e00fd5b5612faad3ad2282fd0bb67d?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.monster.com/job-openings/lead-software-engineer-full-stack-remote-eligible-long-island-city-ny--9362a843-f3a7-4712-8d45-def10736e436?mstr_dist=true&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.builtinnyc.com/job/engineer/lead-software-engineer-full-stackjavascriptjavaaws/241010?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.trabajo.org/job-2003-20231030-4f4ab92e2f2d018dc6b98affb77b7980?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "West Creek 8 (12080), United States of America, Richmond, Virginia\n\nLead Software Engineer, Full Stack(JavaScript/Java/AWS...\n\nDo you love building and pioneering in the technology space? Do you enjoy solving complex business problems in a fast-paced, collaborative, inclusive, and iterative delivery environment? At Capital One, you'll be part of a big group of makers, breakers, doers and disruptors, who solve real problems and meet real customer needs. We are seekingFull Stack Software Engineerswho are passionate about marrying data with emerging technologies. As a Capital One Lead Software Engineer, you'll have the opportunity to be on the forefront of driving a major transformation within Capital One.\nWhat You'll Do:\n• Lead a portfolio of diverse technology projects and a team of developers with deep experience in distributed microservices, and full stack systems to create solutions that help meet regulatory needs for the company\n• Share your passion for staying on top of tech trends, experimenting with and learning new technologies, participating in internal & external technology communities, mentoring other members of the engineering community\n• Collaborate with digital product managers, and deliver robust cloud-based solutions that drive powerful experiences to help millions of Americans achieve financial empowerment\n• Utilize programming languages like JavaScript, Vue.js, Java, HTML/CSS, TypeScript, SQL and Node.js. Open Source RDBMS and NoSQL databases, Container Orchestration services including Docker and Kubernetes, and a variety of AWS tools and services\nBasic Qualifications:\n• Bachelor's Degree\n• At least 6 years of experience in software engineering (Internship experience does not apply)\n• At least 1 year experience with cloud computing (AWS, Microsoft Azure, Google Cloud)\n\nPreferred Qualifications:\n• Master's Degree\n• 7+ years of experience in at least one of the following: JavaScript, Vue.js Angular, Java, TypeScript, SQL and Node.js\n• 3+ years of experience with AWS, GCP, Microsoft Azure, or another cloud service\n• 4+ years of experience in open source frameworks\n• 1+ years of people management experience\n• 2+ years of experience in Agile practices\n\nAt this time, Capital One will not sponsor a new applicant for employment authorization for this position.\n\nThe minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\n\nNew York City (Hybrid On-Site): $197,400 - $225,300 for Lead Software Engineer\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate's offer letter.\n\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\n\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at theCapital One Careers website. Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\n\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City's Fair Chance Act; Philadelphia's Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\n\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).\nPDN-9a5b04dc-8c63-49a8-89cb-f2931ea06b49", "occupation": "Javascript"}, {"title": "REMOTE - Full Stack Engineer - Python/JavaScript", "company": "The Judge Group", "location": "New York, NY, USA", "via": "via BeBee", "time": "4 days ago", "type": "Full-time", "salary": "none", "links": ["https://us.bebee.com/job/20231110-bc4ce4b64db2ff5122b0efb104c118e0?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.trabajo.org/job-1275-20231025-9a46aa81133532d2bac76373cc4dd21d?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "The Role\n\nIn this role, you'll collaborate closely with front office users to build a high-performance system based on distributed Cloud architecture...\nThis is a 4-day onsite position, offering a unique opportunity for hands-on development in a fast-paced, collaborative environment.\nRequired Qualifications\n5+ years of development experience in the hedge funds industry\nStrong computer science background\nPassionate about staying up-to-date with new developments in tech\nExpertise in Object-Oriented Programming and design patterns\nStrong team player\nEffective communication skills\nTech Stack Proficiency\nC#, .NET Core, Entity Framework Core\nAdvanced JavaScript/UI frameworks like Angular, Bootstrap, and JQuery\nService Oriented Architecture; RESTful and SOAP-based web services\nPreferred Experience\nDesigning/implementing Portfolio and Risk Management systems\nFinancial products (equities, derivatives, fixed income)\nRDBMS Concepts, Data Modelling, Database Design\nDocker, Kubernetes\nNoSQL databases\nTest-driven development\nPerformance tuning techniques\nQualified candidates may reach out to for immediate consideration", "occupation": "Javascript"}, {"title": "Full Stack JavaScript / Java Engineer - NYC Tech Firm (200-300K+)", "company": "Gambit Technologies", "location": "New York, NY, USA", "via": "via Geebo", "time": "2 days ago", "type": "Full-time", "salary": "none", "links": ["https://geebo.com/jobs-online/view/id/678240231-full-stack-javascript-java-/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Full Stack JavaScript / Java Engineer NYC Tech Firm (200-300K+) Tech Product Firm in NYC is looking for a software engineer to join their rapidly expanding team in NYC.\nBased on open source technology, the Java based SAAS platform provides portfolio analytics on large volumes of financial data for hedge funds and investors.\nAs a full-stack Java developer, you will solve complex problems and build... technology that brings transparency and impact to the world of finance.\n\nResponsibilities:\nUtilize object-oriented JavaScript, HTML and CSS to design and implement user interfaces Build JavaScript / Java web applications that consume a RESTful API Create new consumer-facing tools and customizable features in JavaScript / Ember.\njs Face off with clients to address and fix JavaScript / Java based application issues and bugs Provide insight into production performance and optimize processes to simplify web development Implement best web practices to produce efficient applications (HTTP, caching, page rendering, etc.\n) Requirements:\n4\nyears' experience with object-oriented development in JavaScript, Java or other 2\nyears' experience with any front-end framework like Ember.\njs, AngularJS, Ext.\njs or ReactJS Experience with MVC frameworks such as Ember, Backbone or Angular B.\nS.\nor M.\nS.\nin Computer Science.\nEstimated Salary: $20 to $28 per hour based on qualifications", "occupation": "Javascript"}, {"title": "Full Stack Software Engineer (Python/JavaScript)", "company": "Stellent IT", "location": "New York, NY, USA", "via": "via LinkedIn", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/full-stack-software-engineer-python-javascript-at-stellent-it-3622225528?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "New York, New York\n\n1 year...\n\nHybrid (2 Days Onsite/3 Days Remote)\n\nThe Opportunity\n\nFull Stack Development, Design, & Implementation of complex MBS (Mortgage-Backed Securities), Front & Mid-Office Applications, Trading, Risk Management, Collateral Management, or Securities Processing Applications. Proficient in translating business requirements to easy to use and\n\nPrimary Skills: Python, JavaScript, Automation\n\nRequirements & Responsibilities\n\nBachelors' degree in Computer Science or Equivalent professional experience.\n\n10-20 years of Hands-on Software Development experience in Python, JavaScript, and SQL (additional programming language experience a definite plus)\n\nFull Stack Developer role, strength in both Front-end & backend development experience required.\n\nExperience with financial, banking systems preferred, ideally Fixed Income - MBS (Mortgage-Backed Securities), Front & Mid-Office Applications, Trading, Risk Management, Collateral Management, or Securities Processing.\n\nExperience on caching frameworks.\n\nExperience on distributed computing using Grid.\n\nGood understanding on OOP fundamentals, Data structures, Design patterns.\n\nAbility to analyze, design, develop and troubleshoot new and existing applications.\n\nExperience on Risk systems in financial industry is added advantage.\n\nGood Communication Skills, Experience Dealing With Global Team Members\n\nPankaj\n\nIT Technical Recruiter\n\nPhone: (201) 584-1186\n\nEmail: *************\n\nGtalk: *************\n\nLinkedIn: https://www.linkedin.com/in/pankaj-sharma-63510b241", "occupation": "Javascript"}, {"title": "Lead Javascript Developer", "company": "fuboTV", "location": "New York, NY, USA", "via": "via Wellfound", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://wellfound.com/jobs/84355-lead-javascript-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "THE JOB\n\nfuboTV is seeking an experienced JavaScript Developer who will be responsible for writing and refactoring performant and scalable JavaScript code. The proper candidate will likely be chosen to lead fuboTV's front-end engineering efforts. You will have the following responsibilities...\n\n- Develop new user-facing features\n\n- Build reusable code and libraries for future use\n\n- Ensure the technical feasibility of UI/UX designs\n\n- Optimize application for maximum speed and scalability\n\n- Collaborate with remote team members\n\nCANDIDATE REQUIREMENTS\n\n- Responsive front-end HTML/CSS/JavaScript experience working for consumer web\n\n- Experience using a MV* framework such as AngularJS, React.js, or Backbone.js.\n\n- Worked with back-end developers to design, document and maintain both public and private APIs\n\n- Knowledge of Continuous Integration & deployment tools such as Jenkins, Travis, Codeship, CircleCI, etc. (we use CircleCI)\n\n- Good understanding of full front-end toolchain - Bower, webpack, grunt, gulp, browserify, npm, etc.\n\nDESIRED EXPERIENCE\n\n- Building process change such as implementing feature branch techniques on git, gitflow, or code review process.\n\n- Performance refactoring of existing front-end code and ability to show x% increase in performance and y% decrease in memory footprint for applications.\n\n- Implementing or maintaining continuous integration and deployment environment for iterative products.\n\n- Implementing canary builds integration systems.\n\n- Experience building feature branch based A/B testing infrastructure for rapid validation of front-end designs.\n\nNICE TO HAVES\n\n- Knowledge of Google Material Design and experience working with Angular-material library\n\n- Experience building backend using technologies such as Rails, Django, NodeJS, etc.\n\n- Experience using BaaS such as Firebase, Parse, etc.\n\nIf you're interested, please take this Codility test to start the application process: https://codility.com/honeypot/fuboTV-Basic-Programming-Test\n\nfuboTV focuses on Sports, Digital Entertainment, and Subscription. Their company has offices in New York City and New York. They have a large team that's between 201-500 employees. To date, fuboTV has raised $151.325M of funding; their latest round was closed on April 2018.\n\nYou can view their website at http://www.fubo.tv or find them on Twitter, Facebook, and LinkedIn", "occupation": "Javascript"}, {"title": "Javascript Developer", "company": "Open Systems Technologies", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Open-Systems-Technologies/Job/Javascript-Developer/-in-New-York,NY?jid=77378ade9f47c8fc&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Description\n\nThe ideal candidate must have experience in application development within an MVC framework. Sucessful candidates must also have experience working with frameworks such as Angular.JS or React.JS...\n\nThe KYC team is comprised of developers who show a strong desire and willingness to be challenged and learn about new technologies and domains. The team is looking for a consultant who is able to hit the ground running in an exciting and fast-paced environment and who can make immediate contributions.\n\nQualifications:\n\n3+ years of experience with OOP Development\n\n3+ years of experience with JavaScript/Node.JS, HTML, CSS\n\n2+ years of experience with a front-end frameworks (React.JS preferred)\n\nExperience developing and integrating with web services APIs\n\nFamiliarity with Linux (Red Hat Enterprise Linux)\n\nStrong analytical and creative problem solving skills\n\nStyling experience with CSS a plus\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "occupation": "Javascript"}, {"title": "Mid Level Software Developer (Python, Java, JavaScript)", "company": "IBM", "location": "New York, NY, USA", "via": "via Mogul", "time": "6 days ago", "type": "Full-time", "salary": "none", "links": ["https://onmogul.com/jobs/mid-level-software-developer-python-java-javascript-ecd0ac09-2b13-4ae5-807c-895c8ed02f01?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Introduction\nSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that literally make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally... or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use latest software development tools, techniques and approaches and work leading minds in the industry to build solutions you can be proud of.\n\nYour Role and Responsibilities\nIBM's Digital Workplace engineering is looking for applicants who will thrive in an open, dynamic, flexible, fun-spirited, collaborative environment and desire creative freedom and an opportunity to work on high performing teams!\n\nIBM Today\nhttps://www.youtube.com/watch?v=OTzveEx-rQw\n\nNo remote opportunities exist\nWill consider relocation for candidates with the right skills/experience\nMust have the ability to work in the US without current/future need for IBM sponsorship\n\nDuties:\n• Build new functionality into web applications with a global audience\n• Engineer information retrieval solutions with modern tools on a corpus of millions of documents\n• Provide users with the information they need, when they need it\n• Create ranking algorithms which incorporate user activity into results feeds\n• Required Professional and Technical Expertise - 3+plus years’ experience in cloud application development, such as JavaScript / Node.js web applications, REST services, HTML, CSS, and Java/J2EE\n\nOur solutions we support are:\n\nw3 Homepage (a productivity tool) - ~8M monthly sessions\n\nInternal search engine - ~2M monthly sessions\n\nBluePages (internal LinkedIn) - ~5M monthly sessions\n\nHelp@IBM (IT Support portal) - ~2M monthly sessions\n\nWe play a major role in delivering technology to the IBM digital workplace the discoverability of tools and information is a significant part of that. Our intranet is vast, with millions of assets indexed, and offers unique challenges. We are looking for a leader with experience driving engineering innovation in Information Retrieval, comfortable making data-driven decisions, and leading technical teams. In this fast-paced and expanding organization, we foster an environment of continuous innovation and working in agile teams.\n\nCIODEM19\nCIODWE\n\nRequired Professional and Technical Expertise\n• 3+plus years’ experience in cloud application development, such as JavaScript / Node.js web applications, REST services, HTML, CSS, and Java/J2EE\n\nPreferred Professional and Technical Expertise\n• NA\n\nAbout Business Unit\nThe IBM Finance organization is responsible for driving enterprise performance and transformation. We are the financial stewards of IBM, delivering IBM’s financial strategy, developing new business models, and mitigating enterprise risk. Do you have a passion for creating business value? Join our team in accounting, financial planning, pricing, business controls, tax, treasury, business development (acquisitions & divestitures), and global financing.\n\nYour Life @ IBM\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\nLocation Statement\nFor additional information about location requirements, please discuss with the recruiter following submission of your application.\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status", "occupation": "Javascript"}, {"title": "Backend Javascript Developer", "company": "Lex", "location": "New York, NY, USA", "via": "via Trabajo.org", "time": "4 days ago", "type": "Full-time", "salary": "none", "links": ["https://us.trabajo.org/job-1275-20231111-5f775ca8c4991b0a4b585a247645a0e7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Participate in Agile development workflow.\nPLANNING Help estimate new features and plan the roadmap towards meeting company goals and OKRs.\nStrategize towards finding the best balance between shipping new features and addressing the tech debt...\nImplementation\nCODING Use good software development practices and tools to write high quality, secure & tested code.\nRELEASES Participate in weekly software deployments and support the mobile team in client releases.\nQUALITY Take responsibility over the whole web app lifecycle: from development to deployments and monitoring.\nPropose and implement best practices for code testing and quality assurance.\nINNOVATION Devise improvements to the Lex backend architecture and services", "occupation": "Javascript"}, {"title": "Senior Software Engineer (C#/JavaScript)", "company": "mParticle", "location": "New York, NY, USA", "via": "via Ladders", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.theladders.com/job/senior-software-engineer-c-javascript-mparticle-new-york-ny_65209642?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "This position is 100% remote!\n\nAbout Us...\n\nmParticle is an AI Customer Data Platform that powers the entire marketing stack with real-time customer data. Companies like NBCUniversal, JetBlue, Venmo, and Airbnb use mParticle to simplify their customer data infrastructure, maximize the value of their data, and accelerate growth at scale. Over the last two years, the company has raised $150M in funding and acquired two companies. Founded in 2013, mParticle is headquartered in New York City with employees around the globe.\n\nHere at mParticle, everyone is equal. We believe strongly and are looking for someone who demonstrates empathy and sincerity to all roles and teammates. mParticle is a core extension of the data infrastructure for some of the largest businesses in the world and our platform processes nearly one-third of the world’s smartphone traffic.\n\nDo you love building connections? Are you passionate about bridging the gap between different technologies and services to enable a seamless customer experience? Can you not only write great software but mentor other engineers to get on your level?\n\nWe're looking for a Senior level software engineer in the US or Canada to join our team! You will work alongside an independent team of engineers and pair directly with product managers and designers to spec and build complex backend experiences. You will help build APIs and write high quality, maintainable code in a tight-knit startup environment. Every team at mParticle is empowered with ownership over a product area, and you'll be central to understanding users' challenges and ensuring the quality and deployment of new features in that area.\n\nResponsibilities\n• As an individual contributor, architect and implement complex data processing features that are highly performant, reliable and cost effective. Efficiently scan and process petabytes of data.\n• Analyze complex systems to identify areas of improvement. Coding and performance tuning a large scale distributed system requires creativity and a deep technical repertoire.\n• Drive mParticle's engineering culture through continual research, self-improvement and internal presentation. Provide technical project leadership using Agile methodologies. Mentor engineers in healthy best practices.\n\nDesired Experience\n• 5+ years of professional hands-on experience developing software, preferably in a SaaS or PaaS environment.\n• Demonstrated technical / project leadership using Agile/Scrum.\n• Experience with C#, Java or another strongly typed language\n• Demonstrated hands-on experience in creating complex large-scale data systems involving both real-time and batch components.\n• Experience with a frontend SPA framework such as React, Vue.js, Angular, Aurelia, or other similar frameworks.\n• Experience in building and modifying REST APIs\n• Experience in SQL-like languages and tools\n• Mastery of software development principles and high-volume applications requiring 24/7 uptime..\n• Ability to learn quickly and display analytical thinking\n\nEmployment opportunities are available to all applicants without regard to race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n\nThe US base salary range for this full-time position is $120,000 - $150,000 + equity & benefits.\n\nEmployment opportunities are available to all applicants without regard to race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status", "occupation": "Javascript"}, {"title": "Sr. Javascript Developer at Boast.AI in New York, NY", "company": "Boast.AI", "location": "New York, NY, USA", "via": "via Geebo", "time": "6 days ago", "type": "Full-time", "salary": "none", "links": ["https://geebo.com/jobs-online/view/id/1007382125-sr-javascript-developer-at-/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "What you'll do:\n- Write, test and document quality code - Enhance and build light weight front end applications and integrate them with backend services - Design and implement new REST APIs and frameworks - Make decisions in collaboration with design and product peers - Perform code reviews and influence our engineering processes - Own components of the platform ensuring successful delivery ... Champion best practices and promote betterment among your team - Automate the testing and deployment of your own code Who you are:\n- 8\nyears experience building RESTful services and frontend applications in Javascript - 5\nyears of experience with React and NodeJS - BS degree in Computer Science, a similar technical field of study, or equivalent practical experience - Knowledge of software engineering best practices for the full software development life cycle, including coding standards, code reviews, source control, build processes, and testing - Experience with Google Cloud Platform, AWS or Azure would be a plus\nSalary Range:\n$150K -- $200K\nMinimum Qualification\nSoftware DevelopmentEstimated Salary: $20 to $28 per hour based on qualifications", "occupation": "Javascript"}, {"title": "Full Stack JavaScript Engineers", "company": "Acquire Me", "location": "New York, NY, USA", "via": "via Chegg Internships", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.internships.com/posting/lit_39561105119?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Title\n\nFullStack Engineer - JavaScript, Angular...\n\nJob Location\n\nNew York, United States\n\nJob Overview\n\nRenowned quantitative hedge fund seeking talented full-stack Software Engineer to work directly with their trading teams on building critical trading applications from the ground up. Financial services experience strongly preferred.\n\nCompensation\n\nPosted 21 hours ago\nPermanent\n$300k - $650k\n\nResponsibilities\n• Work directly with the trading teams to build critical trading applications used by the business\n• Collaborate with the business to build tools that impact the bottom line\n\nRequirements\n• Financial services experience (buy/sell side or fintech)\n• Excellent stakeholder management and communication skills\n• Deep background in building performant C#/.NET applications with strong SQL skills\n• Proficient web development skills leveraging Angular, JavaScript, WPF\n\nWe're excited for you to apply", "occupation": "Javascript"}, {"title": "Javascript", "company": "BUKI", "location": "New York, NY, USA", "via": "via Talent.com", "time": "8 days ago", "type": "Full-time and Part-time", "salary": "none", "links": ["https://www.talent.com/view?id=1cc7a19fba35&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Wage per hour : 80\n\nSubject : JavaScript programming...\n\nPreparation level : Beginner\n\nLessons location : at students’ place; online\n\nAdditional information :\n\nTutor\n\nPart time / full time\n\nDo you want to earn money by teaching? Would you like to have a flexible schedule without being in the office all the time?\n\nAre you creative and do you like to implement your own teaching strategy in private classes? So, the work at BUKI is for you.\n\nTutor of :\n• Languages (English, German, Spanish, French, etc.)\n• Natural sciences (physics, mathematics, chemistry, biology, etc.)\n• Sports disciplines (choreography, chess)\n• Programming (JavaScript, Python, C ++, etc.)\n• Music and instruments (singing, piano, guitar, etc.).\n\nWe are looking for teachers for private lessons and group classes. Classes are taken place in the student area, in the teacher's area or online (Skype, Hangouts).\n\nWe select students with a level of knowledge that corresponds to the levels of teacher training.\n\nYou are an ideal candidate if :\n• You have relevant education or you are a student at the relevant university\n• You are sociable and responsible\n• Teaching experience is welcomed.\n\nConditions of cooperation :\n\nWhen? at any convenient time (partial employment, additional income)\n\nWhere? in the teacher's zone, in the student's zone or on the Internet (Skype, Hangouts)\n\nHow much? you set your own price for the classes and receive requests directly from the student after each class (pre-agreed payment).\n\nLast updated : 2023-11-07", "occupation": "Javascript"}, {"title": "SDET Engineer-Javascript", "company": "City of New York", "location": "New York, NY, USA", "via": "via LinkedIn", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/sdet-engineer-javascript-at-city-of-new-york-3750888409?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.smartrecruiters.com/CityOfNewYork/3743990002895561-sdet-engineer-javascript?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "• Note: Only those serving in the permanent civil service title of COMPUTER SPECIALIST (SOFTWARE) or who have passed and are reachable on the Open Competitive COMPUTER SPECIALIST (SOFTWARE) Exam #1139 will be considered. Please include your list number on your resume.\n\nThe Fire Department of the City of New York (FDNY) is the largest Fire Department in the United States and universally is... recognized as the world's busiest and most highly skilled emergency response agency. The Department's main goal is to provide fire protection, emergency medical care, and other critical public safety services to residents and visitors in the five boroughs. FDNY members are sworn to serve and protect life and property and the Department works to continually educate the public in fire, life safety and disaster preparedness, along with enforcing public safety codes. Since its inception in 1865, FDNY has helped lead efforts to make New York the safest big city in the nation. This accomplishment requires a steadfast and daily commitment to maintaining the Department's core values.\n\nThe Fire Department, City of New York (FDNY), seeks a full time Software Development Engineer in the Bureau of Technology Development and Systems. Reporting directly to the Deputy Director of BA, QA & UX, the successful candidate will help deliver the quality and performance of large-scale multi-platform software products. Collaborate with product, engineering, and other domain teams to understand features, develop, and automate test cases, improve product quality, and shorten release time from dev to production. Focuses on contributing to the development of automated Functional Integration tests and end-to-end tests through open-source test frameworks for overall system.\n\nEssential Job Duties And Responsibilities\n• Tests complex API, web and mobile based applications that reference database back-end systems.\n• Designs, develops, maintains, and troubleshoots automated suites of tests through continuous integration for value added feedback.\n• Creates and maintains automated test cases, executes test suites, reviews and diagnoses reported bugs, and ensures overall system quality prior to a customer release.\n\nSpecial Working Conditions: May be required to work shifts including nights, Saturdays, Sundays, and holidays.\n\nNOTE: This position may be eligible for remote work up to 2 days per weeks, pursuant to the Remote Work Pilot Program agreed between the City and DC37.\n\nMinimum Qualifications\n• A baccalaureate degree from an accredited college, including or supplemented by twenty-four (24) semester credits in computer science or a related computer field and two (2) years of satisfactory full-time software experience in designing, programming, debugging, maintaining, implementing, and enhancing computer software applications, systems programming, systems analysis and design, data communication software, or database design and programming, including one year in a project leader capacity or as a major contributor on a complex project; or\n• A four-year high school diploma or its educational equivalent and six (6) years of full-time satisfactory software experience as described in “1\" above, including one year in a project leader capacity or as a major contributor on a complex project; or\n• A satisfactory combination of education and experience that is equivalent to (1) or (2) above. College education may be substituted for up to two years of the required experience in (2) above on the basis that sixty (60) semester credits from an accredited college is equated to one year of experience. A masters degree in computer science or a related computer field may be substituted for one year of the required experience in (1) or (2) above. However, all candidates must have a four year high school diploma or its educational equivalent, plus at least one (1) year of satisfactory full-time software experience in a project leader capacity or as a major contributor on a complex project.\n\nNOTE: In order to have your experience accepted as Project Leader or Major Contributor experience, you must explain in detail how your experience qualifies you as a project leader or as a major contributor. Experience in computer operations, technical support, quality assurance (QA), hardware installation, help desk, or as an end user will not be accepted for meeting the minimum qualification\n\nrequirements.\n\nSpecial Note\n\nTo be eligible for placement in Assignment Level IV, in addition to the Qualification Requirements stated above, individuals must have one year of satisfactory experience in a project leader capacity or as a major contributor on a complex project in data administration, database management systems, operating systems, data communications systems, capacity planning, and/or on-line applications programming.\n\nPreferred Skills\n• Strong programming skills using JavaScript, Java, SQL, HTML and CSS. -Experience developing applications using open-source JavaScript frameworks such as ReactJS, AngularJS and NodeJS. -Experience using automation tools such as Selenium, Appium, Cypress, Playwright or Microfocus QTP/UFT. -Experience with API testing or integration (REST APIs) -Knowledge of Continuous Integration and related tools (Jenkins/GitHub/CloudBees). -Ability to self-manage time, manage workload, multi-task, prioritize, and meet deadlines. -Able to work in fast pace high performance development environment.\n\n55a Program\n\nThis position is also open to qualified persons with a disability who are eligible for the 55-a Program. Please indicate at the top of your resume and cover letter that you would like to be considered for the position through the 55-a Program.\n\nPublic Service Loan Forgiveness\n\nAs a prospective employee of the City of New York, you may be eligible for federal loan forgiveness programs and state repayment assistance programs. For more information, please visit the U.S. Department of Education’s website at https://studentaid.gov/pslf/.\n\nResidency Requirement\n\nNew York City Residency is not required for this position\n\nAdditional Information\n\nThe City of New York is an inclusive equal opportunity employer committed to recruiting and retaining a diverse workforce and providing a work environment that is free from discrimination and harassment based upon any legally protected status or protected characteristic, including but not limited to an individual's sex, race, color, ethnicity, national origin, age, religion, disability, sexual orientation, veteran status, gender identity, or pregnancy", "occupation": "Javascript"}, {"title": "Javascript/node.JS developer", "company": "Open Systems Technologies", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Open-Systems-Technologies/Job/Javascript-node.JS-developer/-in-New-York,NY?jid=8eafa8398320be47&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.smartrecruiters.com/OpenSystemsTechnologies/79989146-javascript-node-js-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company Description\n\nJob Description...\n\nThe Role:\n\nR&D is looking for developers for an immediate opening in building a brand new web based product being developed from the ground up. Experience in web application development in an MVC framework is also required. Candidate will be working in an exciting fast-paced environment and is expected to 'hit the ground running'.\n\nQualifications:\n• 3+ years of experience with OOP Development\n• 3+ years of experience with JavaScript/Node.JS, HTML, CSS\n• 2+ years of experience with Python\n• 1+ years experience working with a relational database such as Oracle or MySQL, including schema design as well as sql.\n• Experience developing and integrating with web services APIs\n• Desire and willingness to be challenged and learn about new technologies as domains\n• Familiarity with Linux (Red Hat Enterprise Linux)\n\nAdditional Qualifications:\n• Strong analytical and creative problem solving skills\n• Strong communication skills\n• Experience with web front end frameworks such as React.js a plus", "occupation": "Javascript"}, {"title": "Lead / Senior Software Engineer ( / 3D / Javascript )", "company": "HERE Technologies", "location": "New York, NY, USA", "via": "via BeBee", "time": "6 days ago", "type": "Full-time", "salary": "none", "links": ["https://us.bebee.com/job/20231109-cced95d4044edee4f99dd6cfd5ee611a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.jobilize.com/job/us-ny-new-york-lead-senior-software-engineer-three-js-3d-javascript?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "What's the role?:\n\nWe are looking for a skilled software engineer with a strong background in TypeScript /JavaScript development, a strong grasp of performance optimization and cross-platform development, interest in cutting-edge technologies and enthusiasm to join our Location Services Research & Development team...\n\nIf you are a passionate engineer, we want you to join the team to develop the world's best cross-platform mapping offering that will stretch the boundaries of modern web platforms.\n\nLink:\n\nResponsibilities:\n• Creation of the next generation 3D web-based map offering with cutting edge technologies\n• Design and implementation of mapping-related high-performance components for desktop and mobile use\nWho are you?:\n\nSkill and experience:\n• Bachelor/Master in Computer Science, Software Engineering or similar technical degree\n• Strong knowledge of TypeScript/JavaScript\n• Good understanding of software algorithms and data structures\n• Ability to write clean and tested code\n• Experience in maintaining large code base with long lifecycles\n• Experience in developing multi-platform client-side web applications (mobile and desktop)\n• Hands-on experience with object-oriented software engineering\n• Experience in Agile software development (SCRUM)\n• Excellent command of written and spoken English\n\nWould be a plus:\n• Experience in computer graphics , WebGL)\n• Experience in GIS-related problem solving\n• Understanding of web application performance optimization\n• Experience with common JavaScript Maps APIs\n\nWhat Do We Offer?\n• Work on the development of high scale services, serving and storing petabytes of data\n• Work with cutting edge, modern technologies\n• A great work-life balance\n• 30 paid vacation days\n• Flexible working hours\n• Competitive salary plus bonus\n• Fantastic & talented people from 60+ countries worldwide\n• Brown bag talks, team events, BBQ on the rooftop and more\n\nChange is HERE. Apply Now\n\nAs part of HERE Technologies employment process, candidates will be required to successfully complete a pre-employment screening process. This offer and any related claims are subject to the successful completion of a pre-employment screening. This will involve employment, education, and criminal verification if applicable.\n\n#LI-AY2 #LI-HYBRID\nWho are we?:\n\nHERE Technologies is a location data and technology platform company. We empower our customers to achieve better outcomes from helping a city manage its infrastructure or a business optimize its assets to guiding drivers to their destination safely.\n\nAt HERE we take it upon ourselves to be the change we wish to see. We create solutions that fuel innovation, provide opportunity and foster inclusion to improve peoples lives. If you are inspired by an open world and driven to create positive change, join us. Learn more about us on our YouTube Channel", "occupation": "Javascript"}, {"title": "Full Stack JavaScript Engineer // ReactJS, NodeJS - Remote from...", "company": "Dice", "location": "New York, NY, USA", "via": "via Jobgether", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://jobgether.com/offer/64c86e6e6a3a161a6d886bb4-full-stack-javascript-engineer-reactjs-nodejs?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "This a Full Remote job, the offer is available from: New York (USA)\n\n...\n\nDice is the leading career destination for tech experts at every stage of their careers. Our client, Motion Recruitment, is seeking the following. Apply via Dice today!\n\nA digital media group is in need of a Full Stack JavaScript Engineer to work on their New York City team. The role is 100% fully remote! Through their various platforms they reach over 50 million people every day. You would use primarily react to work on front end applications and webpages.\n\nRequired Skills & Experience\n• 5+ years experience with ReactJS/NodeJS\n• Degree in Computer Science or equivalent experience\n\nDesired Skills & Experience\n• Ideally some experience in high web traffic sites.\n\nWhat You Will Be Doing\n\nTech Breakdown\n• 50% ReactJS\n• 50% NodeJS\n\nRole Breakdown\n• 100% Software Engineering\n\nThe Offer\n• Comprehensive medical benefits with vision and dental\n• 401(k) + matching\n• Potential Stock option and annual bonuses\n\nFull Stack JavaScript Engineer // ReactJS, NodeJS\n\n\"This offer from \"Dice\" has been enriched by Jobgether and got a 83.5% flex score", "occupation": "Javascript"}, {"title": "JS (React, Node.JS) Developer", "company": "MindPal", "location": "New York, NY, USA", "via": "via LinkedIn", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/js-react-node-js-developer-at-mindpal-3706085176?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "We're looking for a Senior JavaScript Developer with expertise in React and Node.js!\n\nResponsibilities...\n• Designing, developing, and maintaining scalable and performant web applications using JavaScript, React, and Node.js\n• Collaborating with cross-functional teams to gather requirements, plan projects, and ensure successful project delivery\n• Writing clean, efficient, and maintainable code following best practices and industry standards\n• Conducting code reviews and providing constructive feedback to team members\n• Troubleshooting and debugging complex technical issues and providing timely resolutions\n• Mentoring and guiding junior developers, sharing your knowledge and expertise\n• Staying up-to-date with the latest trends and advancements in JavaScript, React, and Node.js development\n\nRequirements\n• Extensive experience in JavaScript development, with a strong focus on React and Node.js\n• Proficiency in front-end technologies such as HTML, CSS, and JavaScript frameworks (e.g., React, Redux)\n• Solid understanding of server-side JavaScript frameworks (e.g., Express, Koa) and RESTful API development\n• Experience with database systems such as MongoDB, PostgreSQL, or MySQL\n• Familiarity with version control systems (e.g., Git) and agile development methodologies\n• Strong problem-solving and analytical skills\n• Excellent communication and collaboration abilities\n\nWe Offer\n• Competitive compensation packages\n• Supportive work environment\n• Opportunities for growth and advancement within our organization", "occupation": "Javascript"}, {"title": "JavaScript Development Lead", "company": "Open Systems Technologies", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Open-Systems-Technologies/Job/JavaScript-Development-Lead/-in-New-York,NY?jid=87602389c9cfd424&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.smartrecruiters.com/OpenSystemsTechnologies/98202305-javascript-development-lead?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company Description\n\nOpen Systems Technologies is a national provider of smart staffing solutions, providing contract staffing, permanent placements and executive searches in the following skill areas...\n\n- Technology\n\n- Finance, Accounting, and Operations\n\n- Government Services\n\n- Legal\n\n- Global Services\n\nEstablished in New York in 1990, Open Systems Technologies is one of the largest, privately held, staffing companies in the world. We have experienced organic growth over the past 25 years and currently employ over 1,500 consultants in 16 domestic and international markets. Through our brands of Open Systems, OST Financial, OST Legal, OST Government Services, and OST Global we strive for continued expansion and excellence in the staffing industry. With the Global Services division, starting Jan-2012, Open Systems has expanded into the ITO & BPO Projects/Solutions business.\n\nJob Description\n\nResponsibilities\n• Be an involved and hands-on architect with 50% coding\n• Collaborate with Product Management, User Experience Design teams to understand business requirements and design appropriate solutions.\n• Create product designs and project plans that balance technical and practical considerations\n• Undertake technical investigation and create Proof of Concept examples\n• Lead the architecture and the design, and help build and maintain high performance, flexible and highly scalable web and mobile based applications\n• Provide expert technical guidance on development options and best practices to fellow team members and stakeholders\n• Demonstrated strong technical leadership including leading & mentoring small direct and dotted-line teams\n• Provides strategic direction for all relevant technology efforts\n• Work closely with UX/UI teams to create the desired customer experience.\n\nRequirements\n• 8+ year development experience developing complex, scalable web based applications with 3+ years desired in ad-tech technology domain with high volume transactions\n• 5+ years of deep JavaScript or Node.JS development experience as a full stack developer\n• Display & Mobile Advertising and Mobile Application Development experience\n• Strong problem solving and troubleshooting skills\n• Having worked as a software lead architect with a track record of products running in production environment\n• Experience authoring and maintaining a production web-based application and/or ad-tech focused mobile applications\n• Experience adhering to an Agile development environment and iterative sprint cycle with backend systems running in public cloud (i.e., AWS, Azure)\n• Working experience with Amazon AWS services & real time data analytics technology (Hadoop, Spark, Kinesis, etc)\n• Experience with GIT, bitbucket, or Github and the gitflow model.\n• Working experience with SQL and NOSQL (Mongo, Cassandra, etc) databases\n• Experience with web services, micro services, and REST API\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "occupation": "Javascript"}, {"title": "Remote - Full Stack .Net Developer - C#, .Net, SQL, Javascript", "company": "Envision Horizons", "location": "New York, NY, USA", "via": "via BeBee", "time": "4 days ago", "type": "Full-time", "salary": "none", "links": ["https://us.bebee.com/job/20231110-a48ad11902208cd607fc6e3d4ea38af7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://aikanjobs.com/job/envision-horizons-looking-for-full-stack-developer-at-new-york-ny/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "We are currently seeking a Full-Stack.\nNet Developer, to work with the EH development team on our client-facing web application. Candidates should be fast learners and motivated to take on new projects\n...\nAlthough this position will primarily be focused on web development, there will likely be opportunities to move into other areas (especially data science and machine learning).\n\nLocation:\nUS-based candidates only, Fully Remote\n\nFounded in 2017, Envision Horizons is a turnkey solution for brands looking to make selling on Amazon less stressful.\n\nOur mission is to help brands of all sizes optimize their product pages, navigate common troubleshooting issues, and strategically utilize Amazon Advertising to successfully scale brands on Amazon.\n\nIn addition to full service management, we have also built our own proprietary software, MyHorizons, a customizable reporting and diagnostic tool pulling data from Amazon Seller Central and the Amazon Ads console into one easy to navigate dashboard.\nBe Inquisitive - be naturally curious, love working with data, and determined to find an answer.\n2 years+ experience in at least one of the following - Python, C++, C#\n~ At least 1 year of experience with cloud services like AWS or Microsoft Azure\n~ .NET environment experience (ASP.NET, Entity Framework, .NET Core, etc.)\n~ HTML, CSS, JS\n~ SQL knowledge\n~ A degree in CS, Mathematics, or a related field, or equivalent experience\n~ Data science experience is a plus\n~ Machine learning experience is a plus\n\nWe offer a comprehensive compensation package including a competitive salary and annual bonus structure. NET environment experience (ASP.NET, Entity Framework, .NET Core, etc.)?\nDo you have 2 years+ experience in at least one of the following - Python, C++, C# ?\nDo you have at least 1 year of experience with cloud services like AWS or Microsoft Azure?\nDo you know HTML, CSS, and JS?\n\nEnvision Horizons is committed to building an inclusive environment for people of all backgrounds and everyone is encouraged to apply.\n\nEnvision Horizons is an Equal Opportunity Employer and does not discriminate on the basis of race, color, gender, sexual orientation, gender identity or expression, religion, disability, national origin, protected veteran status, age, or any other status protected by applicable national, federal, state, or local law", "occupation": "Javascript"}, {"title": "Software application", "company": "Federal Reserve System", "location": "New York, NY, USA", "via": "via Talent.com", "time": "7 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.talent.com/view?id=2cfc2250f86a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company\n\nFederal Reserve Bank of New YorkWorking at the Federal Reserve Bank of New York positions you at the center of the financial world with a unique perspective on national and international markets and economies...\n\nYou will work in an environment with a diverse group of experienced professionals to foster and support the safety, soundness, and vitality of our economic and financial systems.\n\nThe Bank believes in work flexibility to balance the demands of work and life while also connecting and collaborating with our colleagues in person.\n\nEmployees can expect to be in the office a couple of days per week as needed for meetings and team collaboration and should live within a commutable distance.\n\nWhat we do :\n\nAs a member of the development sub chapter of supporting the Markets business domain, the area responsible for Trading Desk Decision Support Applications, you will implement financial applications and tools in support of Markets’ operations planning and execution.\n\nYou will be part of an agile squad that requires close collaboration with other members of the technology team, business users, and other development squad members.\n\nYour role as a JavaScript / Web Applications Software Solutions Specialist :\n\nA member of the squad is responsible for rapid end to end delivery of business value working directly with the business area.\n\nDevelopers on the squad are expected to deliver frond end, mid-tier integration and backend functionality. Ultimately all developers for this squad are full stack developers.\n\nWhat we are looking for :\n\nWe are looking for a developer who has experienced success across all front end and backend development areas. Just as important we are looking for candidates who have demonstrated a willingness to contribute across multiple development areas and technologies.\n\nQualifications for these include and not limited to :\n\nStrong background in designing and developing web applications using JavaScript, Typescript, CSS3, HTML5 and JQuery as well as Java EE, Spring and Springboot.\n\nExperience with Vue, and Bootstrap is strongly preferred\n\nStrong analytical and communication skills\n\nAbility to design and implement user interfaces by incorporating established UI best practices.\n\nExperience using Continuous Integration and Deployment tools such as Gitlab / Jenkins, etc.\n\nAbility to apply Design Patterns and Enterprise Integration Patterns accordingly.\n\nExperience with Agile methodology\n\nExperience building decision support applications for operations and analytics in the financial industry\n\nRequired : Experience Test Driven Development AND Behavior Driven Development (TDD / BDD)\n\nRequired Technologies : Spring(Data, MVC, Security, Core, etc.), App / Web Server(Tomcat, JBoss, etc.), RDBMS(Oracle, MySQL), Localstack, Docker and AWS Services ( IAM, S3, CloudFront, Secrets Manager, EC2, ECS, ALB, RDS, Elasticache, MKS, AmazonMQ)\n\nSalary Range : $134400 - $216000 / year\n\nOur Touchstone Behaviors Communicate Authentically, Collaborate Inclusively, Drive Progress, Develop Others, and Take Ownership help shape the culture of the Bank.\n\nThey also provide a shared language for how we work together and achieve success, and they set clear expectations for leading with impact at every stage of your career with us.\n\nBenefits :\n\nOur organization offers benefits that are the best fit for you at every stage of your career :\n\nComprehensive Insurance Plans (Medical, Dental and Vision including Flexible Spending Accounts and HSA)\n\nSubsidized Public Transportation Program\n\nTuition Assistance Program\n\nOnsite Fitness & Wellness Center\n\nThis is not necessarily an exhaustive list of all responsibilities, duties, performance standards or requirements, efforts, skills or working conditions associated with the job.\n\nWhile this is intended to be an accurate reflection of the current job, management reserves the right to revise the job or to require that other or different tasks be performed when circumstances change.\n\nFull Time / Part Time\n\nFull time\n\nRegular / Temporary\n\nRegular\n\nJob Exempt (Yes / No)\n\nJob Category\n\nInformation Technology\n\nWork Shift\n\nFirst (United States of America)\n\nLast updated : 2023-11-08", "occupation": "Javascript"}, {"title": "UI/Front End Developer", "company": "Purple Drive Technologies", "location": "New York, NY, USA", "via": "via SimplyHired", "type": "Full-time and Temp work", "time": "none", "salary": "none", "links": ["https://www.simplyhired.com/job/h1iT1Ix3DoeFydgVWr2-u08PEmuhp6g8gmXd1INM_NIRhbFP2SlzTA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "DURATION: 12 Months-C2C\n\nLocation :NEW YORK,USA...\n\nMandatory Skillsets: React JS|Bootstrap|javascript|Angular JS|Adobe XD|UI/UX\n\nDescription :\n\nWe are searching for an efficient Front-end Developer to join our Development Team. As a Front-end Developer, you should have prior experience in writing front-end code for client-side as well as server-side web applications.\n\nYou should be able to translate the client's requirements into appealing and functioning interactive applications. In addition, you should be good at creating an attractive and functional digital environment for our products by ensuring an exceptional user experience. As a qualified candidate for this role, we expect you to have outstanding user interfaces and experience knowledge. You should be able to create a user-friendly environment via your code for our software applications.\n\nResponsibilities :\n• Work closely with our Design team to better understand the design and UI/UX requirements.\n• Maintain and improve the presentability of our website and web applications.\n• Optimize the design of web applications for robust user experience.\n• Collaborate with graphic designers and back-end developers to improve usability.\n• Acquire feedback from customers and users to build viable solutions.\n• Write functional requirement guides and documents.\n• Create quality prototypes and templates for the client approvals.\n• Ensure brand consistency and high-quality graphics standards.\n• Stay updated on the latest technologies.\n\nRequirements :\n• 5+ years of experience as a Front-end Web Developer, Software Developer, Web Developer, or similar role.\n• Excellent understanding of software architecture and databases.\n• Solid understanding of the markup languages.\n• Experience with jQuery, HTML, CSS, JavaScript frameworks, react js, Angular js, and REST APIs.\n• Know-how debugging and testing software for cross-browser compatibility.\n• Excellent experience in the entire web development process.\n• Good understanding of basic SEO principles.\n• Excellent knowledge of user interface and layout aesthetics.\n• Knowledge of content management systems will be an added advantage.\n• Outstanding multitasking and analytical abilities.\n• Willingness to learn new technologies.\n• Good oral and written communication skills.\n• Attention to detail.\n• Strong organizational skills.\n• Exceptional problem-solving abilities\n\nJob Types: Contract, Full-time\n\nSalary: $38.19 - $70.72 per hour\n\nBenefits:\n• Dental insurance\n• Health insurance\n• Paid time off\n\nSchedule:\n• 8 hour shift\n\nAbility to commute/relocate:\n• New York, NY: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n• UI/UX: 4 years (Preferred)\n• Front-end development: 3 years (Preferred)\n\nWork Location: In person", "occupation": "Javascript"}, {"title": "Jr. Javascript Developer", "company": "Open Systems Technologies", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Open-Systems-Technologies/Job/Jr.-Javascript-Developer/-in-New-York,NY?jid=c9377e0825efb692&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.smartrecruiters.com/opensystemstechnologies/81267474-sql-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.startwire.com/jobs/new-york-ny/javascript-developer-2561659886/amp?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company Description\n\nOpen Systems Technologies is a national provider of smart staffing solutions, providing contract staffing, permanent placements and executive searches in the following skill areas...\n\n- Technology\n\n- Finance, Accounting, and Operations\n\n- Government Services\n\n- Legal\n\n- Global Services\n\nEstablished in New York in 1990, Open Systems Technologies is one of the largest, privately held, staffing companies in the world. We have experienced organic growth over the past 25 years and currently employ over 1,500 consultants in 16 domestic and international markets. Through our brands of Open Systems, OST Financial, OST Legal, OST Government Services, and OST Global we strive for continued expansion and excellence in the staffing industry. With the Global Services division, starting Jan-2012, Open Systems has expanded into the ITO & BPO Projects/Solutions business.\n\nJob Description\n\nYou will use cutting-edge front end technology to expand the current platform and build innovative products.\n\nResponsibilities\n• Implement high-performance web applications for desktop and mobile.\n• Extend and maintain the JavaScript libraries and applications\n• Write elegant, maintainable, testable solutions to complex technical problems.\n• Integrate with third-party platforms and services to pull in auxiliary content, services, and data.\n• Tackle performance bottlenecks and drive improvements to our backend and frontend infrastructure.\n\nQualifications\n• 2+ years of experience in software development with at least 1 years of experience with JavaScript applications.\n• Strong knowledge of ES5.\n• Good understanding of design patterns, object-oriented programming, and asynchronous and event-driven development.\n• Well-versed in testing methodologies (TDD, BDD) and experience writing unit and functional tests.\n• Passion for performance, debugging, and benchmarking.\n• Comfortable with Linux CLI, one or more scripting languages, and SQL.\n• Bachelor's Degree in Computer Science or equivalent.\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "occupation": "Javascript"}, {"title": "Front-End Developer Intern (react.js)", "company": "Razu", "location": "New York, NY, USA", "via": "via Wellfound", "type": "Internship", "time": "none", "salary": "none", "links": ["https://wellfound.com/jobs/370481-front-end-developer-intern-react-js?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Razu is seeking a react.js Intern to work\n\nWe are looking for a great JavaScript Developer who is proficient with React.js. You must love writing code and get excited about bringing beautiful and highly functional user interfaces to life. Your primary focus will be on developing user interface components and implementing them following the well-known React.js workflow using Redux. You will... coordinate with the rest of the team working on different layers of Razu Infrastructure. You will be involved with projects that technologically sound and aesthetically impressive. You will get to report directly to the CTO.\n\nRequirements\n\nStrong Proficiency in Javascript, including DOM Manipulation and the JavaScript Object Model.\n\nThorough understanding of React.js and its core principles\n\nFamiliarity with newer specifications of ECMAScript\n\nKnowledge of isomorphic React is a plus\n\nFamiliarity with Modern front-end build pipelines and tools\n\nExperience with Data Structure libraries (e.g. Immutable.js)\n\nWorking Knowledge of GitHub\n\nTeam Player with Strong Communication Skills\n\nExperience with REST API’s\n\nKnowledge of Modern Authorization mechanisms, such as JSON Web Token and OAuth\n\nThe desire to jump into Full Stack Development when necessary\n\nPlus\n\nFamiliarity with React Context API\n\nExperience with AWS\n\nRazu focuses on Music, Music Services, Independent Music, and Music Technology. Their company has offices in New York City. They have a small team that's between 1-10 employees.\n\nYou can view their website at http://www.razu.io", "occupation": "Javascript"}, {"title": "JavaScript/Web UI Developer", "company": "Open Systems Technologies", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Open-Systems-Technologies/Job/JavaScript-Web-UI-Developer/-in-New-York,NY?jid=33a6343a37b09b56&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.smartrecruiters.com/OpenSystemsTechnologies/743999656034956-javascript-web-ui-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company Description\n\nOpen Systems Technologies is a national provider of smeart staffing solutions, providing contract staffing, permanent placements and executive searches in the following skill areas...\n\n- Technology\n\n- Finance, Accounting, and Operations\n\n- Government Services\n\n- Legal\n\n- Global Services\n\nEstablished in New York in 1990, Open Systems Technologies is one of the largest, privately held, staffing companies in the world. We have experienced organic growth over the past 25 years and currently employ over 1,500 consultants in 16 domestic and international markets. Through our brands of Open Systems, OST Financial, OST Legal, OST Government Services, and OST Global we strive for continued expansion and excellence in the staffing industry. With the Global Services division, starting Jan-2012, Open Systems has expanded into the ITO & BPO Projects/Solutions business.\n\nJob Description\n\nRequired:\n• 5+ years of web/front-end development experience with large, complex applications\n• Strong knowledge in Javascript and modern frameworks (angular.js, react.js, node.js)\n• Solid skills in HTML5 and CSS3\n• Knowledge of the Agile Development Methodology\n• Knowledge of global financial markets and financial products\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "occupation": "Javascript"}, {"title": "Java FullStack Engineer (JavaScript/Typescript)-US", "company": "Zortech Solutions", "location": "New York, NY, USA", "via": "via LinkedIn", "type": "Full-time and Contractor", "time": "none", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/java-fullstack-engineer-javascript-typescript-us-at-zortech-solutions-3731930693?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Role: Java FullStack Engineer (JavaScript/Typescript)\n\nLocation: NY/PA (Onsite...\n\nDuration: Contract\n\nJob Description\n• Extensive experience with JavaScript/Typescript, Angular, Material and CSS\n• Extensive Java, Spring, J2EE, Spring Boot and other distributed technologies n-tier application experience\n• SQL skills with experience in Oracle\n• Experience with Microservice based, Micro front ends & REST API\n• Experience with Tomcat, Linux, Cloud. Gitlab (git + CI/CD), MAVEN, SVN\n• Experience with integrating various systems e.g., mainframes, web services etc.\n• Experience with Tomcat, WebSphere and/or WebLogic\n• Experience with automate build tools and continuous integration (Maven, Jenkins, etc.) strongly desired.\n• Work experience in Agile and Waterfall environments\n• Knowledge of IntelliJ, VSC, Docker, Splunk\n• Knowledge of XML/XSL\n• Knowledge with middleware & Enterprise Messaging Systems such as MQ\n\nTech Stack\n• Development experience using Java8 or higher versions, Angular 8, Spring, Springboot, RESTful webservices, JMS/Kafka\n\nBasics Of Database\n• Working knowledge in J2EE Servlets/JSP/XML, RESTful services\n• Experience in Frameworks Spring, Springboot, Swagger\n• Middleware JMS, Apache Tomcat, MQ, Kafka\n• Oracle 10g/12c PL-SQL\n• OS - Unix commands and Shell scripting\n• Web Technologies HTML, CSS, AJAX, JavaScript, JSON\n• Expertise in Eclipse, SVN, GIT, Maven\n• Scripting languages such as JavaScript\n• 3rd party API and plugins Junit, log4j, Jackson, Findbugs, Checkstyle, PMD\n• DevOps tools Jenkins, Maven, Sonar, Splunk\n\nQualifications\n• Bachelor's degree in computer science engineering or a related discipline, or equivalent work experience required.\n• 7-14 years of experience in software development required; experience in the securities or financial services industry is a plus.\n• Job holder must have understanding interdependencies and business impact of future IT plans.\n• S/he must have prior lead experience selecting and implementing vendor-specific methodologies and prior consulting experience with structured methodologies.\n• Job holder must have broad experience with multi-platform development tools and toolkits", "occupation": "Javascript"}, {"title": "Javascript/Python Developer", "company": "Open Systems Technologies", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Open-Systems-Technologies/Job/Javascript-Python-Developer/-in-New-York,NY?jid=393c6e16fa2bc74a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.smartrecruiters.com/OpenSystemsTechnologies/83319369-javascript-python-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.startwire.com/jobs/new-york-ny/senior-web-application-developer-2561687532?source=seo&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.whatjobs.com/jobs/Senior-Web-Application/new-york-new-york-/1470702959?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Description\n\nThis web application will be a collaborative, community-building platform for the financial services industry. Candidates will have the opportunity to work with React and other web technologies in a start-up environment...\n\nThe candidate will join a growing team in an exciting, fast-paced environment and is expected. Successful candidates will be quick learners who can 'hit the ground running'.\n\nQualifications:\n\n3+ years of experience with OOP Development\n\n3+ years of experience with JavaScript/Node.JS, HTML, CSS\n\n2+ years of experience with Python\n\n1+ years experience working with a relational database such as Oracle or MySQL, including schema design as well as SQL\n\nExperience developing and integrating with web services APIs\n\nDesire and willingness to be challenged and learn about new technologies as domains\n\nFamiliarity with Linux (Red Hat Enterprise Linux)\n\nAdditional Qualifications:\n\nStrong analytical and creative problem solving skills\n\nStrong communication skills\n\nExperience with web front end frameworks such as React.js a plus\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "occupation": "Javascript"}, {"title": "Node.JS Developer with GraphQL", "company": "MindPal", "location": "New York, NY, USA", "via": "via LinkedIn", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/node-js-developer-with-graphql-at-mindpal-3706655708?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "We are looking for Node.JS Developer\n\nResponsibilities...\n• Developing and maintaining Node.js applications in a production environment\n• Creating, implementing, and documenting GraphQL API and managing data in this context\n• Deploying and managing GCP services such as App Engine, Cloud Functions, Cloud Storage, etc.\n• Optimizing and monitoring applications to ensure their performance and reliability\n• Collaborating with the programming team, architects, and other stakeholders to understand business and technical requirements\n\nRequirements\n• At least 2 years of experience in Node.js programming and developing back-end applications\n• Knowledge of GraphQL and experience in creating and managing GraphQL API\n• Familiarity with Google Cloud Platform (GCP) services such as App Engine, Cloud Functions, Cloud Storage, etc.\n• Ability to work with databases such as MongoDB, MySQL, or PostgreSQL\n• Knowledge of version control tools such as Git\n• Problem-solving skills, code analysis, and performance optimization\n• Good command of spoken and written English\n\nWe Offer\n• B2B contract type\n• Full-time employment\n• Remote and flexible working hours", "occupation": "Javascript"}, {"title": "Java/Javascript Legal Developer", "company": "Open Systems Technologies", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Open-Systems-Technologies/Job/Java-Javascript-Legal-Developer/-in-New-York,NY?jid=e5c6872b9c612af3&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.startwire.com/jobs/new-york-ny/java-javascript-legal-developer-2561683001/amp?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company Description\n\nOpen Systems Technologies is a national provider of smart staffing solutions, providing contract staffing, permanent placements and executive searches in the following skill areas...\n\n- Technology\n\n- Finance, Accounting, and Operations\n\n- Government Services\n\n- Legal\n\n- Global Services\n\nEstablished in New York in 1990, Open Systems Technologies is one of the largest, privately held, staffing companies in the world. We have experienced organic growth over the past 25 years and currently employ over 1,500 consultants in 16 domestic and international markets. Through our brands of Open Systems, OST Financial, OST Legal, OST Government Services, and OST Global we strive for continued expansion and excellence in the staffing industry. With the Global Services division, starting Jan-2012, Open Systems has expanded into the ITO & BPO Projects/Solutions business.\n\nJob Description\n\nWe are seeking developers who are motivated to learn so they can be effective in new domains and technologies. The projects you will work on include several client facing JavaScript-based UI applications, relational and non-relational databases, and microservices written in Java and C++.\n\nThe right candidate will be energetic and demonstrate a positive get-it-done attitude, with excellent design and problem solving skills, and an ability to quickly learn and adapt to the latest technologies.\n\nQualifications:\n\nBS in Computer Science/Computer Engineering or equivalent experience\n\n4+ years of Java Programming experience\n\nJavaScript programming experience\n\nProficiency with relational databases / SQL development\n\nLinux skills with experience in shell scripting\n\nSolid understanding of Data Structures, Algorithms & Object-Oriented design concepts\n\nC++ Programming experience in a Unix/Linux environment is a plus\n\nPython programming experience is a plus\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "occupation": "Javascript"}, {"title": "Angular/Javascript Developer", "company": "Open Systems Technologies", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Contractor", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Open-Systems-Technologies/Job/Angular-Javascript-Developer/-in-New-York,NY?jid=9c58bf12ea865502&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.smartrecruiters.com/OpenSystemsTechnologies/96170180-angular-javascript-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company Description\n\nOpen Systems Technologies is a national provider of smart staffing solutions, providing contract staffing, permanent placements and executive searches in the following skill areas...\n\n- Technology\n\n- Finance, Accounting, and Operations\n\n- Government Services\n\n- Legal\n\n- Global Services\n\nEstablished in New York in 1990, Open Systems Technologies is one of the largest, privately held, staffing companies in the world. We have experienced organic growth over the past 25 years and currently employ over 1,500 consultants in 16 domestic and international markets. Through our brands of Open Systems, OST Financial, OST Legal, OST Government Services, and OST Global we strive for continued expansion and excellence in the staffing industry. With the Global Services division, starting Jan-2012, Open Systems has expanded into the ITO & BPO Projects/Solutions business.\n\nJob Description\n\nResponsibilities\n• Execute full lifecycle software development.\n• Write well designed, testable, efficient code.\n• Produce specifications and determine operational feasibility.\n• Integrate software components into a fully functional software system.\n• Document and maintain software functionality.\n• Ability to co-ordinate and work with other local and global development teams.\n• Talk to end users directly and gather requirements.\n• Troubleshoot production issues when reported by end users and other system users and quickly resolve them.\n\nSkills\n• Hands on experience in designing rich interactive JavaScript based applications\n• Good knowledge of Objected Oriented Principles\n• Ability to develop modular front end applications using Angular JS\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "occupation": "Javascript"}, {"title": "REACT NATIVE DEVELOPER", "company": "Atechstar", "location": "New York, NY, USA", "via": "via OPTnation", "type": "Full-time, Part-time and Contractor", "time": "none", "salary": "none", "links": ["https://www.optnation.com/react-native-developer-job-in-new-york-ny-view-jobid-29183?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Description Hand on experience - React Native and Javascript\n\nIn this role you will be responsible for uses cutting edge tools and technology to solve real world problems. A portfolio of projects in which you had key role; for each please be prepared to describe your role in the project the technologies involved the resources dedicated and one challenging technical problem encountered and how... it was overcome\n\nResponsibilities\n\nLots of coding And problem-solving. And more coding Working in a dynamic atmosphere of an evolving strategy and scope Participating in discussions & brainstorming sessions on architecture design and Logic/algorithms Working closely with a great close-knit team Receiving comprehensive platinum-level healthcare and benefits\n\nPreferred qualifications\n\nExperience in the development on a variety of languages platforms frameworks and technologies Design patterns and collaborative software development best practices Pride in shipping beautiful clean and easily maintainable code Experience with cloud microservice architectures configuration operation and maintenance A self-starter who requires little day-to-day supervision/direction and is comfortable providing mentorship to other engineers Able to express intelligence and creativity by using programming to solve complex real-world problems Experience developing software with", "occupation": "Javascript"}, {"title": "Vue.JS Developer", "company": "ClifyX", "location": "New York, NY, USA", "via": "via LinkedIn", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/vue-js-developer-at-clifyx-3531725866?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.techfetch.com/job-description/remote-vue-js-developer-new-york-ny-j3579730?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.careerbuilder.com/job/J3M4S05WV7LFG2N5XJK?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.theladders.com/job-listing/vue-js-developer-clifyx-_v2_-7-3301510785.html?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.jobilize.com/job/us-ny-new-york-vue-js-developer-clifyx-hiring-now-job-immediately?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://ny.tarta.ai/j/AV7APooBcRajQcTj985X0823-developer-vue-js-in-new-york-new-york-at-clifyx-com?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Vue.JS Developer – FTE / SC – Rate: $75/hr – New NY, NY (Remote) / Local candidates preferred – Meredith Corporation – JD Given below.\n\nMandatory Skills: Vue JS, Java Script Frameworks, TypeScript, MongoDB...\n\nJob Description – Vue.JS Developer\n1. Experience with technologies like Javascript, preferably vanilla Javascript (ES5+), NodeJS, VueJs, MangoDB, Keep track of new development-related tools, frameworks, methods, and architectures\n2. Enjoy working and integrating with multiple third-party providers. Demonstrated ability in creating and working with APIs.\n3. Working in performance, and page speed in the web space.\n4. Comfortable using the tools of modern collaborative Agile+Scrum SDLC, including Git, Jira, planning poker, etc\n5. Soft skills : Analytical Skills , Problem-solving Approach , Zeal to Learn and Improve, Adaptability to Emerging Technologies and Tools , Inclination toward Web Development, Basic Understanding of Databases, Frameworks, Design, Communication", "occupation": "Javascript"}, {"title": "Equity Sales C++/Javascript Developer", "company": "Open Systems Technologies", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Open-Systems-Technologies/Job/Equity-Sales-C++-Javascript-Developer/-in-New-York,NY?jid=c5b252558ca0f29c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.smartrecruiters.com/OpenSystemsTechnologies/83259873-equity-sales-c-javascript-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Description\n\nThe Equity Sales Dashboards Team is seeking a driven and dedicated developer to join our fast paced team as it builds a revolutionary product in the equity sales and trading space...\n\nThe ideal candidate has excellent object oriented programming skills and a proven ability to design and build frontend and backend software components that can scale as our product grows. He/She will analyze and improve efficiency, scalability and stability of various parts of the system on a continuous basis. Our developers contribute to the team by putting forth their own ideas regarding product features, UI screens, design decisions, etc. We are looking for a self-starter, a good communicator who will work with the product and sales teams to understand our clients' workflow.\n\nThe team works closely with the product manager and the sales force to play a vital role in influencing the nature and direction of the product. Team members directly meet with clients/end users to understand requirements, demo the product and gauge feedback. The team works at a rapid pace and releases code every week.\n\nQualifications:\n\n2+ years of professional experience with a proven ability to build intuitive user interfaces to enhance and optimize client workflow\n\nExcellent object oriented programming skills in C++, JavaScript or equivalent\n\nA passion for hands-on project management\n\nExcellent problem solving and multi-tasking skills\n\nA strong knowledge of data structures and algorithms\n\nVery good communication skills\n\nKnowledge in the institutional capital markets domain is a plus\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "occupation": "Javascript"}, {"title": "React JS Developer", "company": "Wipro", "location": "United States", "via": "via LinkedIn", "time": "12 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/react-js-developer-at-wipro-3748836622?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Titile: React JS Developer\n\nDuration: Full Time...\n\nLocation: New York City - Hybrid\n\nJob Description:\n• The candidate must possess the ability to create UI components using HTML, CSS3, and JavaScript (ES6).\n• A strong command of HTML, CSS3, and JavaScript is essential.\n• Furthermore, the candidate should demonstrate proficiency in developing web pages/components without relying on Bootstrap or other UI libraries.\n• Basic knowledge of PHP is also required or should have hands-on experience working on PHP frameworks like Laravel, CakePHP etc.\n• Familiarity with ReactJS will be considered an additional advantage.\n\nNote:\n\nWipro is an Equal Employment Opportunity employer and makes all employment and employment-related decisions without regard to a person's race, sex, national origin, ancestry, disability, sexual orientation, or any other status protected by applicable law", "occupation": "Javascript"}, {"title": "JavaScript/Angular Developer", "company": "Open Systems Technologies", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Open-Systems-Technologies/Job/JavaScript-Angular-Developer/-in-New-York,NY?jid=49371f594e59b896&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company Description\n\nOpen Systems Technologies is a national provider of smeart staffing solutions, providing contract staffing, permanent placements and executive searches in the following skill areas...\n\n- Technology\n\n- Finance, Accounting, and Operations\n\n- Government Services\n\n- Legal\n\n- Global Services\n\nEstablished in New York in 1990, Open Systems Technologies is one of the largest, privately held, staffing companies in the world. We have experienced organic growth over the past 25 years and currently employ over 1,500 consultants in 16 domestic and international markets. Through our brands of Open Systems, OST Financial, OST Legal, OST Government Services, and OST Global we strive for continued expansion and excellence in the staffing industry. With the Global Services division, starting Jan-2012, Open Systems has expanded into the ITO & BPO Projects/Solutions business.\n\nJob Description\n\nResponsibilities:\n• Develop and support external client facing web applications\n• Code, test and debug applications\n• Provide technical expertise and recommendations in assessing new software projects and initiatives to support and enhance our existing applications\n• Code, conduct code reviews, and test software as needed\n• Participate in application architecture and design and other phases of the SDLC\n• Provide technical, troubleshooting and design guidance to other application development teams\n\nQualifications\n• Expert in JavaScript technologies with a focus on Angular libraries\n• 5+ years of application development experience in Financial Services or Wealth Management\n• 5+ years of professional experience using CSS, HTML5, Modular JavaScript, Angular and modern\n• 3+ years' experience creating/consuming web services and data\n• 3+ years' experience of working with geographically dispersed teams\n• JavaScript frameworks\n• Exposure or experience to web development is required and mobile web development will be considered an added bonus\n• Strong Analysis, Design and Development Skills\n• Good problem solving skills\n• Solid understanding and experience with Object-Oriented design and development\n• Must have a thorough understanding of web technologies and web architectures\n• Strong Information Taxonomy/Architecture design skills\n• NodeJS experience\n• Experience with CSS utilities such as LESS, SASS, Twitter Bootstrap and Compass\n• Developing Wireframes, site maps and process flows for site architecture\n• Should also possess database skills (preferably DB2, SQLServer) to design new or alter existing table structures to satisfy specifications and requirements\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "occupation": "Javascript"}, {"title": "Angularjs JavaScript Developer", "company": "Keylent, Inc.", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Keylent,-Inc./Job/Angularjs-JavaScript-Developer/-in-New-York,NY?jid=4a14ab96b91d167f&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Visa status: U.S. Citizens and those authorized to work in the U.S. are encouraged to apply.\nTax Terms: W2, 1099\nCorp-Corp or 3rd Parties: Yes...\n\nMandatory Skills:\n• 8+ years of experience in front end technologies such as\no JavaScript (Must)\no HTML\no CSS\no ngularjs 2 and above (Must)\no Bootstrap\no Jquery\no JSON\no NodeJS\n• Proficient in ANSI SQL, procedures and database concepts ( DB2/sybsae/Oracle)\n• Financial Industry knowledge\n• Exposure to working on a global team\n• nalytical thinker / problem solver\n• Good interpersonal skills\n• Good communication skills", "occupation": "Javascript"}, {"title": "Manager, Sr. Software Engineer – (Hybrid NYC) Typescript...", "company": "FactSet Research Systems Inc.", "location": "Newark, NJ, USA", "via": "via Professional Diversity Network", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.prodivnet.com/job/manager-sr-software-engineer-hybrid-nyc-typescript-javascript-python-vue-newark-new-jersey-13360036?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.ihispano.com/job/sr-software-team-lead-engineer-typescript-javascript-python-vue-est-based-boston-massachusetts-13360036?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.vetexchangecareers.org/job/sr-software-team-lead-engineer-typescript-javascript-python-vue-est-based-boston-massachusetts-12518028?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "The newly created Deep Sector and Private Markets Engineering team in the Dealmakers & Wealth Management group is seeking a talented Sr. Software/Team Lead Engineer to lead a team of engineers in the United States. As a Sr. Software/Team Lead Engineer, you will play a crucial role in ensuring the success of FactSet’s new Screening capabilities as well as the overall Deep Sector effort by... fostering the growth and development of your team. You will collaborate closely with product and engineering leadership across the program areas. This position reports directly to the Director, Deep Sector and Private Markets Engineering.\n\nAt FactSet, we believe in hiring smart individuals who are committed to continuous growth. We recognize that supporting employees through development opportunities leads to greater productivity, engagement, and commitment. As a Senior Software Engineer/Engineering Team Leader you will play a vital role in creating an environment conducive to personal and professional growth. To succeed in this role, you should possess exceptional leadership, communication, and interpersonal skills. You should also have a passion for mentoring and motivating individuals to reach their full potential.\n\nResponsibilities:\n• Take a genuine interest in the professional and personal growth of each team member.\n• Support and coach employees to help them achieve their performance and career goals.\n• Partners with team members to identify opportunities for learning and development and facilitate their implementation.\n• Champion technical excellence across the engineering organization\n• Foster strong partnerships with Engineering, Product Management, and other stakeholders\n• Ensure that your reports work in agile teams that are independent yet supported.\n• Advocate for the continuous improvement of processes and practices\n\nMinimum Qualifications:\n• 3-5 years of relevant technical or software engineering experience\n\nCritical Skills:\n• Demonstrated experience leading and managing a team of 5-6 engineers.\n• Proven track record of building successful partnerships with various stakeholders.\n• Experience with JavaScript/TypeScript, Vue, Python, SQL\n\nAdditional Skills:\n• Knowledge of the financial services ecosystem is preferred (AI, Cloud Computing).\n\nEducation:\n• BA/BS degree in STEM field\n\nThe budgeted salary range for this position in the states of California, Connecticut and New York is $105,000.00 - $142,000.00.\n\nAt FactSet, we celebrate diversity of thought, experience, and perspective. We are committed to disrupting bias and a transparent hiring process. All qualified applicants will be considered for employment regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or veteran status. FactSet participates in E-Verify.\n\nFactSet is an Equal Opportunity Employer – M/F/Veteran/Disability/Sexual Orientation/Gender Identity\n\nAt FactSet, we celebrate diversity of thought, experience, and perspective. We are committed to disrupting bias and a transparent hiring process. All qualified applicants will be considered for employment regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or veteran status. FactSet participates in E-Verify\n\nFactSet is an Equal Opportunity Employer – M/F/Veteran/Disability/Sexual Orientation/Gender Identity\nVEVRAA Federal ContractorRequest Priority Protected Veteran & Disabled Referrals for all of our locations within the stateThe EEO is the Law poster is available here.FactSet Research Systems Inc. endeavors to make our website accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact Jennifer Passeck, Lead Recruiting Specialist, Human Resources at +1 (203) 810-2472 or recruiting@factset.com.Equal Opportunity Employment PolicyIt is the policy of FactSet Research Systems Inc. (\"FactSet\") to provide equal employment and advancement opportunities to all qualified employees and applicants for employment regardless of their race, color, religion, sex, age, sexual orientation, gender identity or expression, national origin, physical or mental disability, genetic information, protected veteran status, pregnancy, military or military reserve obligations, or any other class or status protected by law. This policy applies to all policies and procedures related to recruitment, hiring, training, promotion, compensation, benefits, transfer, discharge, and other terms and conditions of employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability or protected veteran status. If you have questions concerning this policy, please contact the Human Resources department at +1 (203) 810-1000.PDN-99ce0f67-cc50-480b-9e82-662689e8f536", "occupation": "Javascript"}, {"title": "Senior JavaScript Engineer (Angular 2/4)", "company": "Syrinx", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Syrinx/Job/Senior-JavaScript-Engineer-(Angular-2-4)/-in-New-York,NY?jid=25d01b11c17960d5&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.linkedin.com/jobs/view/senior-javascript-engineer-angular-2-4-at-syrinx-consulting-3674406763?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Senior JavaScript Consultant (Angular 2)\nThis role ison-site in NYC. Angular 2/4 is a must have\n...\nAre you an experienced JavaScript Developer who is looking for a new challenge working with some of the most cutting edge technologies like Angular 2/4, ES6, Node.js and Typescript? We're looking for a seasoned Engineer whose strengths lie mainly developing in object oriented JavaScript. Our client is making a commitment to Angular 2/4.\nWe are looking for an awesome developer that has very strong skills in JavaScript and can test drive their code. Youshould also have an advanced knowledge of JavaScript, including ES6 development concepts.\nRequired:\n• Experience with javascript toolchain, from build system to automated testing\n• Experience with ES6, AngularJS 2.0 or 4.0 orsimilar frameworks\n• Experience with WebPack 2 (tree shaking, pre compilation), Angular 2/4, TypeScript, and Sass\n• Strong knowledge of JavaScript, HTML, CSS, DOM, AJAX, RestfulAPI Experience with Agile processes Strong communication skills\n• Experience with educational software\n• Experience with backend technology and frameworks.\nPlease apply to:\nColin Reposa atcreposa@syrinx.com", "occupation": "Javascript"}, {"title": "Lead React.JS Developer", "company": "KWI", "location": "Greenvale, NY, USA", "via": "via LinkedIn", "time": "6 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/lead-react-js-developer-at-kwi-3665924897?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.salary.com/job/kliger-weiss-infosystems-inc/react-developer/j202310170500424995549?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.indeed.com/viewjob?jk=4c3f0c4887edfb55&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.bebee.com/job/20231028-086eba4d10c91928fb3d67fc9fd0f39f?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.glassdoor.com/job-listing/javascript-developer-kliger-weiss-infosystems-inc-JV_IC1132267_KO0,20_KE21,49.htm?jl=1008764932748&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Lead React Developer\n• This is a hybrid role\n...\nThe Opportunity\n\nWe are seeking an experienced Lead React Developer proficient with React.js. The primary focus of the role is to drive the development of front-end components. You will be responsible for high quality, performant deliverables and for helping to create, evangelize, and enforce the standards necessary to meet team and company goals for the customer experience.\n\nThe Company\n\nWe are a small team with a big vision: to be the premier provider of cloud technology solutions for retailers. KWI offers a complete, unified commerce solution from a single database, specifically designed to help specialty retailers grow their business. Our portfolio of customers includes Pandora, David Yurman, Tom Ford and many other globally recognizable brands.\n\nWe combine Point of Sale, Merchandising, e-Commerce, CRM, and Loss Prevention into one cloud-based platform. We are a Values and Mission driven organization, and we believe that if we develop and demonstrate leadership in our strategy, operations, and people, we will continue to drive product innovation and service excellence.\n\nCompensation: 160-170k\n\nWhat we value\n• Commitment\n• Respect & Dignity\n• Passion\n• Caring\n• Accountability\n• Reliability\n\nAs a Lead React Developer, you excel at the below core skills\n• Building partnerships and working collaboratively with others to meet shared objectives\n• Operating effectively, even when things are not certain or the way forward is not clear\n• Takes full ownership over decisions, actions, and failures\n\nThe impact you’ll make\n• Develop and implement reusable, high quality, highly responsive components for both web and mobile using react concepts\n• Troubleshoot and resolve front-end issues in a maintainable, resilient, performant manner\n• Translate wireframes and designs/requirements into high quality, maintainable code\n• Analyze and recommend suggestions for UX usability and performance\n• Participate in multi-resource projects in an agile\n• Evaluate/recommend industry standards, tools, and methods\n• Document software design and contribute to design reviews\n\nWhat you will bring\n• Bachelor’s degree (computer science or related) or equivalent experience\n• At least 5-7 years of experience in front-end development using JavaScript\n• At least 5-7 years of experience using React\n• At least 5-7 years of experience with Tailwind.css\n• Experience with node.js a plus\n• Experience in defining interfaces and implementing/consuming web services\n• Excellent presentation, interpersonal, written, and oral communication skills (including technical writing)\n• Experience working in a Scrum/agile environment\n\nAs a member of the KWI team you will receive\n• Full Medical, Dental and Vision\n• 4 weeks of PTO in your first year\n• Summer Fridays....all year round\n• Tuition Reimbursement\n• Discount from building café\n• 401(K) with a 50% company match (up to 6% of employee contribution)\n• Employee Referral Program\n• (1) Volunteer day each year\n\nOur work space\n\nWe understand that our teams need flexibility, which is why we follow a hybrid schedule. Our in-office days are Monday, Tuesday and Thursday, and employees are allowed to work remotely on Wednesdays and Friday.\n\nWe are a collaborative group and believe that getting together in person allows our team to do their best work. Our team enjoys monthly events, bagels every Thursday, a state-of-the-art coffee machine, a full snack pantry and many more surprise and delight moments throughout the year.\n\nThat being said, we understand that our teams need flexibility, which is why we follow a hybrid schedule. Our in-office days are Monday, Tuesday and Thursday, and employees are allowed to work remotely on Wednesdays and Friday.\n\nOur commitment to you\n\nAt KWI, we know that cultivating diversity and fostering an inclusive work environment is critical to our impact and success. We create an environment where no individual is advantaged or disadvantaged because of their background. We offer equal opportunity employment regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, or protected veteran status.\n\nWith a commitment to maintaining a bias-free environment in which harassment is prohibited, we respect cultural diversity and comply with the laws of the places in which we operate. We expect our business partners, suppliers, clients, and all our team members to uphold these commitments", "occupation": "Javascript"}, {"title": "Software Engineer (C++, Java, JavaScript or Python)", "company": "TEKREQS, Inc.", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/TEKREQS,-Inc./Job/Software-Engineer-(C++,-Java,-JavaScript-or-Python)/-in-New-York,NY?jid=9a08944e9fb82d22&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.talent.com/view?id=b85e4989467b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Software Engineer (C++, Java, JavaScript or Python) - all levels\n17 openings\nJob Levels: Mid-level, Intermediate-level, Senior Software Engineer & Technical Lead...\nLocation: New York, NY\n\nJoin a growing FinTech firm located in New York City working as a Mid-level, Intermediate-level or Senior Software Engineer within the Market & Community Apps Group on the Equity team. For over 30 years, this team’s clients have relied on the firm’s core product, to access the data and analytics they need to make informed investment decisions. This team absorbs billions of data points from hundreds of financial markets every single day. The team’s Software Developers build software applications that fuel the markets by providing intelligent analytics and transparency to level the playing field. This team shares a real passion for solving today’s problems by innovating for tomorrow. This team’s Software Engineers write high performance, low latency and scalable code using proprietary and open source technologies to develop large-scale systems. This team delivers real life solutions to clients across all industries by rolling up their sleeves and collaborating seamlessly.\n\nThis team builds software applications to analyze market trends, compare and contrast companies, evaluate analyst predictions and refine investment ideas. For example, a client can see what Wall Street analysts believe the performance of a company will be, build an investment model from thousands of characteristics and then analyze the model's performance historically. This platform delivers real-time critical insights and alerts based on our clients' current holdings. The team uses Big Data technologies on top of vast global data sets that span over 30 years. You'll gain a deep understanding of data modeling and data processing, how to architect high-performance backend systems, and visual design.\n\nYou’ll need to have (Required Skills):\n• 3+ years of experience programming in C++ (open to Java, JavaScript or Python with a willingness to work on C++)\n• 3+ years of experience with object-oriented design, data structures, algorithms and all phases of software development\n• An aptitude for analytical problem solving\n\nWe'd love to see (Any of the following skills would be considered a plus):\n• Financial knowledge\n• Agile SDLC development environment", "occupation": "Javascript"}, {"title": "Quant Research Software Developer - JavaScript, Python, Cloud...", "company": "3coast", "location": "New York, NY, USA", "via": "via Dice", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.dice.com/job-detail/5735e5d3-b258-4d93-9054-5c26242f3c20?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.salary.com/job/3coast/quant-research-software-developer-javascript-python-cloud-apps-sql/j202308110155466750416?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "RG19778\n\nPosition: Quant Research Software Developer - JavaScript, Python, Cloud Apps, SQL...\nLocation: New York City, NY\nCompensation: $175,000 - $200,000 + 25%-50% Bonus + Excellent Benefits + Relocation Assistance\n\nJob Description:\n\nThis is a Hybrid position, work remote 3 days a week.\n\nThe Quantitative Research team for this major midsize hedge fund is responsible to deliver scalable products that integrate portfolio management, relative value, trade capture, model development, and risk management into a common platform that is used by all members of the firm.\nThis role is a hands-on development role for a mid-level, experienced software engineer.\n\nResponsibilities:\n\nManage design and development of the company’s UI (Galileo) and microservice efforts from interface definitions to writing front-end and back-end code.\nCollaborate with CRO to prioritize and evolve the product roadmap.\nDevelop software in a well-written, easily understandable, and maintainable way.\nMentor junior team members on related projects pertaining to Galileo.\nProvide consistent improvements to the codebase via the modernization of components and selection of state-of-the-art technologies.\nContinuously survey the technical landscape and recommend updates or new ways of improving the platform/tech stack.\n\nQualifications:\n\nApproximately 5 years or experience in a similar role.\nBachelor’s degree in Computer Science or equivalent.\nSolid knowledge of programming fundamentals: algorithms, data structures, design patterns, and paradigms.\nStrong understanding and proven track record developing web-based applications.\nAdvanced knowledge of web development, with a deep understanding of the JavaScript / Typescript / React.js / Flask / FastAPI frameworks.\nDirect experience setting up and deploying applications on the cloud – (AWS or Azure).\nStrong, proven programming skills in Python.\nStrong skills working with traditional and modern database technologies (SQL, etc.).\nExperience using material UI, Ag-grid a plus.\nStrong written and verbal communication skills.\nTalent for communicating and working effectively with various business departments. Translate business requirements into executable plans.\nAbility to work in a fast-paced interdisciplinary environment.\nManage the development and coordinate projects via Agile development methodology", "occupation": "Javascript"}, {"title": "ADMOH With Java, Javascript, SQL", "company": "Sonsoft Inc", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Sonsoft-Inc/Job/ADMOH-With-Java,-Javascript,-SQL/-in-New-York,NY?jid=6b1ed8e584630f60&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.smartrecruiters.com/SonsoftInc/743999654032352-admoh-with-java-javascript-sql?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company Description\n\nSonsoft , Inc. is a USA based corporation duly organized under the laws of the Commonwealth of Georgia. Sonsoft Inc. is growing at a steady pace specializing in the fields of Software Development, Software Consultancy and Information Technology Enabled Services...\n\nJob Description\n\nJob Description:-\n• At least 7 years of experience in technology consulting, enterprise and solutions architecture and architectural frameworks\n• At least 7 years of experience in Java, Javascript, SQL Skills\n• At least 7 years of experience in defining new architectures and driving an independent project from an architectural stand point.\n• Experience in providing advanced technology advisory services.\n• Understanding of market and technology trends.\n• Analytical skills\n• Experience and desire to work in a management consulting environment that requires regular travel\n\nQualifications\n\nBasic Qualifications :-\n• Bachelor's degree or foreign equivalent required from an accredited institution. Will also consider three years of progressive experience in the specialty in lieu of every year of education.\n• At least 11 years of experience in IT\n\nAdditional Information\n• * U.S. Citizens and those who are authorized to work independently in the United States are encouraged to apply. We are unable to sponsor at this time.\n\nThis is a Full-Time / Permanent job opportunity.\n\nOnly US Citizen, Green Card Holder can apply.\n• * All your information will be kept confidential according to EEO guidelines", "occupation": "Javascript"}, {"title": "Angular Developer", "company": "Manning Global", "location": "New York, NY, USA", "via": "via ZipRecruiter", "time": "3 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Manning-Global/Job/Angular-Developer/-in-New-York,NY?jid=d803548471a89f22&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "• Experienced JavaScript frontend developer \\u2013 6+ years including at least 2 years with Angular.\n• Strong proficiency in JavaScript, including DOM manipulation and the JavaScript object model.\n• Thorough understanding of Angular and its core principles...\n• The person will be responsible for Developing the latest user-facing features using Angular.\n• Ability to understand business requirements and translate them into technical requirements.\n• Adhere to SOLID developer standards and coding best practices.\n• Good understanding of common data structures and Algorithms.\n• Experience with common front-end development tools (e.g.: Babel, Webpack, NPM).\n• Comfortable with Test Driven Development. (e.g.; Mocha, Karma, Jasmine", "occupation": "Javascript"}, {"title": "Blockchain Engineer-Javascript (Web3) Integration", "company": "Omega One", "location": "New York, NY, USA", "via": "via Wellfound", "time": "14 days ago", "type": "Full-time", "salary": "none", "links": ["https://wellfound.com/jobs/408258-blockchain-engineer-javascript-web3-integration?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "The Omega One platform will ​provide traders, ​investors ​and ​institutions ​with ​a ​decentralized and ​automated ​trade execution ​system ​that ​intelligently ​implements ​their ​trades ​across ​the ​world's ​crypto exchanges, ​shielding ​them ​from ​counterparty ​risk ​and ​significantly reducing the transaction cost of trades. ​By radically ​increasing ​the ​liquidity ​of ​crypto ​markets... ​Omega One is ​laying ​the ​foundation ​for ​their maturation ​as ​an ​asset ​class ​and ​building ​the ​financial ​system ​of ​the ​future. By creating automated trading intelligence and managing its own balance sheet, Omega One will intermediate ​risk ​between ​its ​members ​and ​crypto ​markets.\n\nWe are seeking a Blockchain Engineer to help us build our cutting edge cryptocurrency trading platform for highly sophisticated and demanding cryptocurrency traders across the globe. The ideal candidate will be a blockchain expert, with previous experience in a global financial services or fintech firm working on a trading platform and on large scale, high traffic web applications. Ideally you will have moderate experience in cryptography and at least a strong personal interest and willingness to learn more about cryptocurrency. The Blockchain Engineer will be working on designing and building cutting edge technology solutions that do not yet exist today.\n\nSince we’re building the first of its kind cryptocurrency exchange trading platform, we’re looking for engineers who are passionate about emerging business & technology models as well as working in a space full of unknowns. This is an excellent opportunity for any engineer seeking to explore new ideas with the team. We need engineers who are enthusiastic and rigorous when tackling new problems, extremely versatile, who thrive in an agile, test-driven development and automated testing environment.\n\nExperience/Qualifications:\n• Demonstrated experience formulating technology strategy and architecture\n• High proficiency with client side JavaScript frameworks (preferably React/Redux), server side frameworks (preferably NodeJS), NoSQL databases (preferably MongoDB), and some exposure to relational database concepts\n• Ability to integrate with and manage APIs exposing microservices (REST, JSON-RPC), including development and support of Java/JavaScript services\n• Familiarity with event-based System of Engagement architectures\n• Moderate cryptography engineering or experience\n• Experience in or with:\n• * Javascript and Web3 integration work with Solidity\n• * A server-side language: C++, Python, Node.js\n• * Blockchain, web and enterprise related technologies such as go-ethereum/Solidity, Node.js, AngularJS, Python, Go, or Rust\n• * Low-level application development in C++ or Go\n• * Web Technologies: JSON, HTML, CSS, JavaScript, and RESTful web services\n• * Framework : MVC Framework like Spring, JPA, Hibernate, Jaxb\n• * Database : RDBMS like MySQL, Oracle, NO SQL databases\n• * Tools : Git\n• * Operational linux and/or AWS experience a plus\n• Preliminary understanding of or self-taught knowledge/experience:\n• * Amazon web service\n• * Devops: docker, salt, ansible\n• * Bitcoin, Hyperledger or Ethereum\n• * Some html, front end development\n• Excellent communication skills, both written and verbal\n• BS/MS in computer science, engineering or equivalent practical experience\n\nResponsibilities:\n• Perform all Javascript and Web3 integration work with Solidity\n• Translate complex business needs into innovative technical solutions and contribute to product advancement to guarantee solutions are designed for successful deployment\n• Develop high quality prototypes, proofs of concept in addition to production‐quality solutions\n• Ensure efficient performance and scalability of solutions - optimize applications for maximum speed\n• Participate in team/project activities: requirement refinement, sprint planning, task estimations, coding, troubleshooting, retrospectives, etc.\n• Be available for level 3 support to triage production issues\n• Stay current on emerging technologies and participate in Blockchain or cryptocurrency consortiums and industry events\n• Some international travel may be required\n\nOmega One focuses on Blockchain / Cryptocurrency and Web3. Their company has offices in New York City. They have a small team that's between 1-10 employees.\n\nYou can view their website at https://omega.one/ or find them on LinkedIn", "occupation": "Javascript"}, {"title": "Front End developer - Fulltime", "company": "Jose Merciline", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Jose-Merciline/Job/Front-End-developer-Fulltime/-in-New-York,NY?jid=371a5bc1f7eb4204&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "We are looking for a great JavaScript developer who is proficient with React.js. Your primary focus will be on developing user interface components and implementing them following well-known React.js workflows (such as Flux or Redux). You will ensure that these components and the overall application are robust and easy to maintain. You will coordinate with the rest of the team working on... different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and quality product is important.\n\nRequirements for the role:\n\n1) Building reusable components and front-end libraries for future use\n\n2) Working with GraphQL endpoints, Zeplin, Git, and JIRA\n\n3) Developing new user-facing features using React.js\n\n4) Translating designs and wireframes into high quality code\n\n5) Optimizing components for maximum performance across a vast array of web-capable devices and browsers\n\nSkills required for the role:\n\n1) Strong proficiency in JavaScript, including DOM manipulation and the JavaScript object model\n\n2) Thorough understanding of React.js and its core principles\n\n3) Experience with popular React.js workflows (such as Flux or Redux)\n\n4) Familiarity with newer specifications of EcmaScript\n\n5) Experience with data structure libraries (e.g., Immutable.js)\n\n6) Knowledge of isomorphic React is a plus\n\n7) Familiarity with RESTful APIs\n\n8) Knowledge of modern authorization mechanisms, such as JSON Web Token\n\n9) Familiarity with modern front-end build pipelines and tools\n\n10) Experience with common front-end development tools such as Babel, Webpack, NPM, etc.\n\n11) Ability to understand business requirements and translate them into technical requirements\n\n12) A knack for benchmarking and optimization", "occupation": "Javascript"}, {"title": "C++/Javascript/SQL Developer", "company": "Open Systems Technologies", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Open-Systems-Technologies/Job/C++-Javascript-SQL-Developer/-in-New-York,NY?jid=c955c0b5819daab5&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Company Description\n\nJob Description...\n\nThe applicant will play a key role in building low-latency, high capacity and error-free multi asset routing applications, to continue to maintain a leading position in algo and high frequency trading. The applicant will play an active role in all stages of the software development life cycle, from discussions with business, project/resource planning, development, testing and rollout. The applicant should be knowledgeable in javascript, service frameworks, relational database systems, C/C++, and debuggers. The applicant should have strong written and oral skills, as they will be interacting heavily with the business and sales teams to achieve success in their work.\n\nQualifications:\n\n2+ years of solid C/C++/UNIX/Javascript experience\n\nStrong data structure and relational database (SQL)\n\nExperience in writing service-oriented architecture\n\nStrong interpersonal and communication skills\n\nExperience with socket and multi-threading is preferred\n\nExperience in building mission critical real-time systems is a plus\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "occupation": "Javascript"}, {"title": "Python/React Developer", "company": "Elite Hedge Fund", "location": "New York, NY, USA", "via": "via LinkedIn", "time": "2 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/python-react-developer-at-elite-hedge-fund-3725933627?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://salutemyjob.com/jobs/python-react-developer-new-york/1144716895-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.wearegreenbay.com/jobs/python-react-developer-new-york/1144716895-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.wane.com/jobs/python-react-developer-new-york/1144716895-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.careerbuilder.com/job/J3N0VQ6N371P4S0LZGY?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.wavy.com/jobs/python-react-developer-new-york/1144716895-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.ksnt.com/jobs/python-react-developer-new-york/1144716895-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.myarklamiss.com/jobs/python-react-developer-new-york/1144716895-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Jr-Mid Level Python/React Engineer\n\nHybrid - NYC only...\n\nDirect hire\n\nFinancial Industry\n\nMust have 2+ years of exp as a Python Developer with Financial firm\n\nMust have 2+ years of exp with React\n\nMust have a CS degree or equivalent\n\nThanks", "occupation": "Javascript"}, {"title": "Senior Javascript/Ruby Developer", "company": "Open Systems Technologies", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Full-time", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Open-Systems-Technologies/Job/Senior-Javascript-Ruby-Developer/-in-New-York,NY?jid=7330519929a84ee8&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://jobs.smartrecruiters.com/OpenSystemsTechnologies/81439725-senior-javascript-ruby-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Job Description\n\nThe client applications team produces full stack applications that determine how customers interact with the platform by using a variety of web technologies with a focus on Ruby and front-end JavaScript frameworks that communicate with enterprise scale data stores and services...\n\nYou should be able to solve difficult problems related to building and designing large scale web applications and contribute to a web application that is backed by enterprise and Internet scale data in a pragmatic and creative way. As a key contributor, you will participate in all phases of the software development lifecycle.\n\nQualifications:\n\nBS in Computer Science/Computer Engineering or BA degree with comparable experience\n\n3+ years of experience with JavaScript including ability to extend JavaScript frameworks, develop complex UI components, and knowledge of JQuery\n\n3+ years of experience with Ruby on Rails\n\nExperience building large scale client facing web applications backed by a service oriented architecture\n\nAbility to develop web layouts using HTML and CSS that match visual design intent while providing structure for application functionality\n\nAbility to build and use bootstrap CSS frameworks and experience with HAML and SASS is a strong plus\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines", "occupation": "Javascript"}, {"title": "Engineer Technologist - JS", "company": "Proto Innovation Consulting", "location": "New York, NY, USA", "via": "via Wellfound", "time": "12 days ago", "type": "Full-time", "salary": "none", "links": ["https://wellfound.com/jobs/1409750-engineer-technologist-js?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Proto is a new innovation consultancy that helps companies in the face of disruption. We exist to help incumbents and startups understand what makes them meaningful and create new relevance in rapidly changing contexts. We partner with our clients to set actionable visions for their future offerings at the intersection of technology, brand purpose, and human behavior. We design bespoke... actionable outputs – business models, brand identity systems, prototypes, and pilot programs – that accelerate a client's transformation and make a measurable impact on their business.\n\nWe believe in intersectional innovation, the idea that by combining the perspectives of people with different skill sets and backgrounds, we generate better, more actionable ideas. Our innovation strategy teams are made up of people with different backgrounds but united in their creative approaches for finding growth and in their rigor applied in building compelling cases for change.\n\nResident engineers are part of the core technology innovation team at proto. They will be the engines of creativity expressed through applied technology ranging from data/AI, AR/MR experiences, IoT applications and more. They are talented, hands-on technologists who thrive on building new experiences with technology of their choice and applications which helps business showcase potential opportunities to our wide range of clients.\n\nWe’re looking for a full-stack developer with experience in modern web and mobile app development and a passion for creating high-quality, delightful user experiences. If you’re a developer with three or more years experience with user experience focused technology, such as Typescript, Node, ReactJS/Native, AR or equivalent web framework, we’d love to hear from you!\n• Once you’re here *\n• You’ll be collaborating with Product Managers, Designers, Strategists and the rest of the Engineering team to turn ideas into working products and services across web, mobile, and connected devices.\n• Work using tests, pull requests, and continuous integration to ensure a high level of quality in your code and an excellent end product for consumers.\n• Use Agile techniques to iteratively ship products in small, self-organized teams.\n• Checking in regularly with the technology team, sharing and helping the team improve the way we work and operate.\n• We may ask you to get involved in helping the technology team grow by being part of the hiring process for new team members.\n• You’ll be working closely with our clients teams, collaborating with and presenting to them.\n• Specific duties and responsibilities *\n• You are happy to move between focusing on coding with research, prototyping, testing and product strategy.\n• Full stack experience writing readable, maintainable code.\n• You have shipped production code with modern programming languages such as Type/JavaScript, Python and Node.\n• Your interest in development extends past coding; you have a passion for products and a perspective on user experience and product design.\n• Highly Collaborative. Able to work collaboratively with your Proto team and our clients teams.\n• Curious. You have an interest in new and emerging technologies and the possibilities they offer.\n• Resilient. You can work under pressure in a dynamic and fast-moving environment.\n• Adaptable. You can handle ambiguity and are comfortable switching contexts.\n• Technical Expertise *\n• At least 5 years of hands-on experience creating public, complex systems using multiple languages.\n• Proficiency in Node.js and Typescript - experience with languages such as Java, Python, Bash Script, are a major bonus.\n• Proficiency with front end application frameworks such as Angular and React.\n• Proficiency with fundamental front end languages such as HTML, SCSS and CSS, TypeScript and JavaScript.\n• Familiarity with database technology such as Graph, MongoDB, MySQL.\n• Familiarity with AWS cloud services such as Lambda, CloudFormation, the AWS Serverless Application Model, Elastic Beanstalk, S3, DynamoDB, IAM Policies & Permissions.\n• Experience with Azure or Google Cloud is considered a bonus.\n• Experience building native and responsive experiences on android and apple platforms.\n• Experience with Git flow / deployment; designing CI/CD pipelines; Docker & Kubernetes experience/knowledge a bonus.\n• Experience in or the capacity for a client-driven, fast-paced environment with tight deadlines.\n• Working knowledge of JS frameworks like AR.js, tensoflow.js or other similar immersive reality or Machine Learning packages.\n• Soft Skills Required *\n• The following skills and capabilities may be beneficial on some projects, but are not a core requirement of the role.\n• Experience working in digital consulting business with tight timelines.\n• Ability to present your ideas in a multi-disciplinary team where you are the technical expert.\n• Ability to balance you opinions based on needs and constraints on hand.\n• Ability to expand your learning continuously across new frameworks like AR.js and ML5.JS, both which are key to our immediate plans.\n• What’s in it for you *\n• Unlimited PTO\n• An extra day of holiday on your birthday\n• Company pension scheme\n• Private healthcare\n• Flexible working hours\n• Maternity and paternity benefits\n• Company laptop with admin rights and any other tech you need to do your job\n• We’ll get you a phone and pay the bills\n• Investment in your professional development; whether it is formal training, conference attendance or just buying books — learning is important to us\n• Regular company lunches, drinks, supper clubs and away days, as well as our summer party by the canal and our Christmas beach party in Dorset.\n• We like people who *\n• See the bigger picture. Your contribution is valued with a profound impact through your innovative lens in solving the corporation's challenges gracefully\n• Have a strong sense of empathy for clients and their customers. You should see your job as helping your clients succeed with their most important audiences.\n• Appreciate what it takes to make things. You should have a maker mentality and a pragmatism that enables your ideas to come to market.\n• Are able to clearly speak their mind. You should be comfortable leading senior executives to make better decisions.\n• Push for change. You should have a track record of helping clients shift away from business as usual.\n• Work well in high-performing teams. You should have a passion for helping the people around you grow.\n\nProto launched in early 2021. We may be brand new, but our founding team is composed of established industry leaders with 5 years of collaboration behind us. We have the backing of WPP and offer competitive salaries and benefits.\n\nProto is committed to creating an equitable workforce.\n\nProto Innovation Consulting focuses on Innovation Management and Innovation Engineering. Their company has offices in New York City. They have a mid-size team that's between 51-200 employees.\n\nYou can view their website at https://www.wearepro.to", "occupation": "Javascript"}, {"title": "Principal Frontend Engineer (React/Javascript/Typescript) (FTE)", "company": "Braintrust", "location": "United States", "via": "via LinkedIn", "time": "3 days ago", "type": "Full-time and Temp work", "salary": "none", "links": ["https://www.linkedin.com/jobs/view/principal-frontend-engineer-react-javascript-typescript-fte-at-braintrust-3745059211?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "About Us\n\nBraintrust is a user-owned talent network that connects top-tier professionals with the world's leading enterprises. We prioritize transparency, eliminating middlemen and high markups, ensuring job-seekers are matched swiftly to innovative roles while clients benefit from unparalleled efficiency and quality...\n\nAbout The Hiring Process\n\nThe hiring process for this role involves completing your Braintrust profile, applying directly to the role on Braintrust, and undergoing a one-time screening to ensure you meet our vetted talent specifications. After this, the hiring team will contact you directly if they believe you are a suitable match.\n\nOur process isn't for everyone, that's intentional. If you believe that you are a top candidate for this job, please join our network to give yourself the opportunity to work with top companies.\n\nJOB TYPE: Direct Hire/ FTE Position (no agencies/C2C - see notes below)\n\nLOCATION: United States only - CST/CDT | partial day overlap\n\nSALARY RANGE $170,000 – $250,000 /yr\n\nESTIMATED DURATION: 40/week - long term\n\nBRAINTRUST JOB ID: 9548\n\nThe Opportunity\n\nUS ONLY\n\nAustin or Boston-based\n\nYou're either living in the Austin or Boston area - or you're willing to relocate there.\n\nFinal Comp Based On Qualifications And Experience\n\nWhat You'll Be Working On\n\nWe are looking for a Principal Software Engineer (Frontend) to join our team of developers building the next generation of the Patient Portal and Payment applications. You are a senior developer who demonstrates design & engineering excellence and has experience building web applications, preferably in public and private cloud environments. You are an excellent communicator and nimble learner who embraces the challenges and complexity of working in the healthcare space.\n\nThe Team\n\nThe Patient Portal and the Payment Org provides a comprehensive suite of tools for patients to:\n• Review lab results and submit medical forms\n• Securely message their providers\n• Quickly and securely pay their providers for treatments and provide insight into their past payments\n\nCome join this innovative team that is moving quickly to meet the fast-growing market demand.\n\nJob Responsibilities\n• Provide technical leadership and contribute individually to code and system design/development as part of an Agile team consisting of Engineers, a Scrum Master, a Product Owner, and an Experience Designer\n• Collaborate inclusively with cross-functional team members to develop product solutions and promote productivity and effectiveness; mentor and advise engineer team members; take ownership of what the team builds and coordinate efforts to ensure proper completion\n• Develop knowledge to act as a domain expert; share business and technical insights with the broader engineering and product organization\n\nTypical Qualifications\n• Ideally, 8+ years of software engineering experience with significant product development expertise\n• Bachelor’s Degree or equivalent experience\n• Extensive web application development experience with focus on the frontend (eg. MicroUI architecture, responsive designs)\n• Proficient with the Javascript, Typescript and React framework (including advanced concepts like hooks, portals)\n• Ability to write code that is technically sound, performant, scalable, and readable\n• Ability to lead teams/technical projects including technical design, scoping and estimation\n• Experience with deployment (CI/CD) pipelines using Jenkins along with git, bitbucket and other sourcecode repositories preferred\n• Any testing framework (e.g. Jest, Cypress) and GraphQL experience would be a bonus\n• Experience in building accessible web applications and portals would be a bonus\n\nApply Now!\n\nNotes\n\nOur employers all have varying legal and geographic requirements for their roles, they trust Braintrust to find them the talent that meet their unique specifications. For that reason, this role is not available to C2C candidates working with an agency. If you are a professional contractor who has created an LLC/corp around their consulting practice, this is well aligned with Braintrust and we’d welcome your application.\n\nBraintrust values the multitude of talents and perspectives that a diverse workforce brings. All qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status", "occupation": "Javascript"}, {"title": "Manager, Sr. Software Engineer - (Hybrid NYC) Typescript...", "company": "FactSet Research Systems, Inc.", "location": "New York, NY, USA", "via": "via ZipRecruiter", "time": "20 days ago", "type": "Full-time", "salary": "none", "links": ["https://www.ziprecruiter.com/c/FactSet-Research-Systems,-Inc./Job/Manager,-Sr.-Software-Engineer-(Hybrid-NYC)-Typescript,-JavaScript,-Python,-Vue/-in-New-York,NY?jid=77e86b290219aa51&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.linkedin.com/jobs/view/manager-sr-software-engineer-%E2%80%93-hybrid-nyc-typescript-javascript-python-vue-at-factset-3684109753?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.levels.fyi/jobs?jobId=111980976231326406&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.bebee.com/job/20231111-d1a9bfa3f9f7f553bf4ede10d3510163?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.adzuna.com/details/4246004453?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://us.jobrapido.com/jobpreview/3008127890?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "The newly created Deep Sector and Private Markets Engineering team in the Dealmakers & Wealth Management group is seeking a talented Sr. Software/Team Lead Engineer to lead a team of engineers in the United States. As a Sr. Software/Team Lead Engineer, you will play a crucial role in ensuring the success of FactSet's new Screening capabilities as well as the overall Deep Sector effort by... fostering the growth and development of your team. You will collaborate closely with product and engineering leadership across the program areas. This position reports directly to the Director, Deep Sector and Private Markets Engineering.\n\nAt FactSet, we believe in hiring smart individuals who are committed to continuous growth. We recognize that supporting employees through development opportunities leads to greater productivity, engagement, and commitment. As a Senior Software Engineer/Engineering Team Leader you will play a vital role in creating an environment conducive to personal and professional growth. To succeed in this role, you should possess exceptional leadership, communication, and interpersonal skills. You should also have a passion for mentoring and motivating individuals to reach their full potential.\n\nResponsibilities:\n• Take a genuine interest in the professional and personal growth of each team member.\n• Support and coach employees to help them achieve their performance and career goals.\n• Partners with team members to identify opportunities for learning and development and facilitate their implementation.\n• Champion technical excellence across the engineering organization\n• Foster strong partnerships with Engineering, Product Management, and other stakeholders\n• Ensure that your reports work in agile teams that are independent yet supported.\n• Advocate for the continuous improvement of processes and practices\n\nMinimum Qualifications:\n• 3-5 years of relevant technical or software engineering experience\n\nCritical Skills:\n• Demonstrated experience leading and managing a team of 5-6 engineers.\n• Proven track record of building successful partnerships with various stakeholders.\n• Experience with JavaScript/TypeScript, Vue, Python, SQL\n\nAdditional Skills:\n• Knowledge of the financial services ecosystem is preferred (AI, Cloud Computing).\n\nEducation:\n• BA/BS degree in STEM field\n\nThe budgeted salary range for this position in the states of California, Connecticut and New York is $105,000.00 - $142,000.00.\n\nAt FactSet, we celebrate diversity of thought, experience, and perspective. We are committed to disrupting bias and a transparent hiring process. All qualified applicants will be considered for employment regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or veteran status. FactSet participates in E-Verify.\n\nFactSet is an Equal Opportunity Employer - M/F/Veteran/Disability/Sexual Orientation/Gender Identity\n\nAt FactSet, we celebrate diversity of thought, experience, and perspective. We are committed to disrupting bias and a transparent hiring process. All qualified applicants will be considered for employment regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or veteran status. FactSet participates in E-Verify\n\nFactSet is an Equal Opportunity Employer - M/F/Veteran/Disability/Sexual Orientation/Gender Identity", "occupation": "Javascript"}, {"title": "Senior qa engineer", "company": "Motion Recruitment", "location": "New York, NY, USA", "via": "via Talent.com", "time": "4 days ago", "type": "Full-time and Temp work", "salary": "none", "links": ["https://www.talent.com/view?id=455c3a8c9417&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Contract $45-55 / hr New York City,New YorkJob Description A powerhouse American financial intuition is looking to onboard several highly technical QA engineers to work on some brand-new projects.\n\nThey are looking for an engineer with 5+ years of experience who has used JavaScript and Cypress to develop automation testing frameworks for a client facing banking applications...\n\nThis is a great opportunity to work with a top tier company, using the latest cutting-edge technology to test brand new software.\n\nContract Duration : 6 12 Months with Extension! Required Skills & Experience+ JavaScript+ Cypress+ Selenium+ Rest Assured / Postman+ SQLDesired Skills & Experience+ 5+ years of experience+ Great interpersonal skillsWhat You Will Be Doing Tech Breakdown+ 70% Automation Testing+ 30% Manual TestingDaily Responsibilities+ 100% Hands OnThe Offer You will receive the following benefits : + Medical Insurance+ Dental Benefits+ Vision Benefits+ Paid Time Off (PTO)+ 401(k)Applicants must be currently authorized to work in the US on a full-time basis now and in the future.\n\nLI-JC6Motion Recruitment Partners is an Equal Opportunity Employer, including EOE Protected Veterans / Disability / Women.\n\nAll applicants must be currently authorized to work on a full-time basis in the country for which they are applying, and no sponsorship is currently available.\n\nEmployment is subject to the successful completion of a pre-employment background screening including a criminal check. Accommodation will be provided in all parts of the hiring process as required under Motion Recruitment Employment Accommodation policy.\n\nApplicants need to make their needs known in advance.\n\nLast updated : 2023-11-11", "occupation": "Javascript"}, {"title": "Service Now Developer", "company": "eTeam Inc.", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Contractor", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/eTeam-Inc./Job/Service-Now-Developer/-in-New-York,NY?jid=2471c5227e56d92a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "https://www.jobilize.com/job/us-ny-brooklyn-service-now-developer-eteam-hiring-job-immediately?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "• 5+ years of experience working with web application technologies (HTML, CSS, JavaScript, REST, etc.)\n• 3+ years of ServiceNow development / implementation / administrative experience\n• Strong knowledge and understanding of Mid Server, Integrations, LDAP, Flow Designer and SSO, API's and Integrations...\n• Experience in generating reports, patching, and monitoring ServiceNow instance\n• Hands-on experience with ServiceNow components such as Service Catalog, Change Management Incident Management, Problem Management, CMDB, Knowledge, Security Operations, Service Portal\n• Experience developing applications on the ServiceNow platform and related technology (App Creator, Studio, ES5/ECMAScript, related client, and server API's)\n• Create and configure Business Rules, UI Policies, UI Actions, Client Scripts, REST APIs and ACLs including advanced scripting logic.\n• Create and configure Notifications, UI pages, UI Macros, Script Includes, Formatters, etc.\n• Experience working with structured data, schema, and databases\n• Experience integrating internal and external applications.\n• Exposure to Identity Management and Single Sign on/Active Directory integrations.\n• Experience with Agile and SCRUM software development approaches\n• Superior attention to detail with excellent written and verbal communication skills.\n• Ability to understand complex business needs and adapt appropriately.\n• Ability to learn and adapt to new technologies applicable to the ServiceNow platform.\n• Ability to manage multiple projects and priorities.\n• Previous success working in a dynamic environment with the ability to adapt to changing priorities", "occupation": "Javascript"}, {"title": "JavaScript/ReactJS Developer / Brooklyn, NY, 12 Months Contract", "company": "Suncap Technology, Inc.", "location": "New York, NY, USA", "via": "via ZipRecruiter", "type": "Contractor", "time": "none", "salary": "none", "links": ["https://www.ziprecruiter.com/c/Suncap-Technology,-Inc./Job/JavaScript-ReactJS-Developer-Brooklyn,-NY,-12-Months-Contract/-in-New-York,NY?jid=28418a199d436019&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"], "description": "Hybrid Role\n\nJavaScript/ReactJS Developer...\n\nClient is looking for a Mid/Senior JavaScript/ReactJS Developer to join the BTDS application development team.\n\nMANDATORY SKILLS/EXPERIENCE\n• Strong proficiency in JavaScript including DOM, the JavaScript Object Model and other relevant concepts\n• Thorough understanding of ReactJS/React Native and its core principles\n• Expertise on building encapsulated and reusable components\n• Preceding experience with ReactJS/React Native workflows like Redux, Flux, Create React App.\n• Demonstrated expertise building modern UIs and applications using React and its available libraries\n• Proficiency in developing Responsive, PWA and Adaptive Design sites that can work on any form factor\n• Knowledge of modern authentication protocols and mechanisms such as JWT, OAuth2, etc.\n• Knowledge of modern version control systems (GitHub, preferably) and automated build workflows/pipelines for web applications\n• Familiarity with Rest services/API\n• Familiarity with Java is a plus\n• Familiarity with Spring Boot is a plus\n\nDESIRABLE SKILLS/EXPERIENCE\n• Ability to collaborate cross-functionally\n• Thrive in a fast-paced agile environment founded on strong analytical and communication skills", "occupation": "Javascript"}]}